[
  {
    "name": "Time to Chill",
    "release_date": "2022-10-31",
    "price": "USD 69.99",
    "identity_taxonomy": "- Brand: POP MART[^1_1][^1_2][^1_3]. - Line: The Monsters[^1_2][^1_3][^1_4]. - Character: Labubu[^1_1][^1_2][^1_3]. - Series: Time to Chill[^1_1][^1_2][^1_3]. - Product title (marketing title + normalized title): LABUBU Time to Chill-Vinyl Plush Doll[^1_1][^1_5][^1_6]. - Variant name (colorway, pose, outfit): Cozy denim dungarees and pastel blue top, relaxed pose[^1_3][^1_7]. - Form: Vinyl plush doll[^1_1][^1_2][^1_3]. - Deterministic product_id components: Unknown. - Aliases \\& search tokens (EN/中文; common misspellings): Labubu Time to Chill, 拉布布放松时间 (inferred from series context)[^1_3]. - Parent/child relations (reissue, seasonal of core, collab of core): Core variant in The Monsters universe, no direct reissue noted[^1_3][^1_8].",
    "physical_spec": "- Size (h/w/d in cm): 37cm height, 20×15×37cm overall[^1_2][^1_7]. - Weight (grams): Unknown. - Materials: Cotton, PVC, polyester, ABS, TPR[^1_2]; polyester, cotton, vinyl[^1_3]. - Finish (matte, flocked, metallic, translucent): Soft plush body with vinyl face[^1_3][^1_7]. - Articulation/motion: Movable eyes and articulated features[^1_3]. - Accessories in box: None specified. - Colorway notes: Blue denim with pastel accents[^1_3].",
    "packaging & inbox contents": "- Packaging type: Color box[^1_9]. - Packaging dimensions \\& weight: Unknown. - Box contents bill: Plush doll, authenticity card[^1_9]. - Authenticity/anti-counterfeit marker: Batch code (e.g., SAU assumption)[^1_9]. - Factory/QA code: Made in Shon Quong Province, China[^1_9].",
    "edition_run_info": "- Edition.kind: Standard edition[^1_3]. - Edition size (unit_count): Unknown. - Chase/rarity ratio: Not applicable (non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升)[^1_3][^1_8]. - Sculpt/model credits: Unknown. - Collaboration partner: None. - Licensing owner: POP MART[^1_3][^1_8].",
    "release_distribution": "- Announced date: Unknown. - Release date (authoritative; log deltas if contradicted): 2022-10-31[^1_2][^1_3][^1_10][^1_11]. - Drop windows (channels): POP MART official online store, secondary distribution[^1_1][^1_3]. - Purchase limits: Unknown. - Queues/mechanics: Sold out quickly, restocks via app[^1_3][^1_12]. - Restock/second wave dates: Additional releases up to July 2024 in some regions[^1_3]. - End-of-life or “sold out” date: Sold out immediately upon release[^1_4][^1_13].",
    "regional_policy": "- Region_lock (true/false; explanation): False; available internationally via POP MART US and global sites[^1_1][^1_3][^1_10]. - Regional codes involved: US, CN, global[^1_1][^1_3]. - Packaging/regulatory differences: Unknown.",
    "market listings per regionchannel": "- Region code: US. - Channel: POP MART official site. - Launch MSRP (currency + numeric): USD69.99[^1_1][^1_13]. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, available via resellers[^1_3][^1_7]. - Purchase limit at listing: Unknown.",
    "blindbox specifics if relevant": "- Not applicable (single plush doll, not blind box).",
    "compliance_safety": "- Age rating: Unknown. - Warnings: Unknown. - Compliance marks: Unknown. - HS/customs category: Unknown.",
    "commerce & logistics adjuncts": "- SKU/model code: 1220719025[^1_10]. - Barcode/EAN/UPC: Unknown. - Shipping box info: Bubble wrapped from POP MART warehouse[^1_9]. - Return policy excerpt: 15-day returns[^1_1][^1_6]. - Warranty/support link: Unknown.",
    "media_assets": "Official product photography, unboxing videos, store display imagery available across multiple platforms[^1_10].  ![Labubu Time to Chill POP MART collectible with vinyl face and plush hood, dressed in blue overalls.](https://pplx-res.cloudinary.com/image/upload/v1755137561/pplx_project_search_images/93a1eee2303f6561a598d079b81c9d8f77ca2ba7.png)  Labubu Time to Chill POP MART collectible with vinyl face and plush hood, dressed in blue overalls.",
    "provenance & research trace": "- Primary sources used: POP MART official site[^1_1][^1_5][^1_6]. - Secondary sources used: SNKRDUNK, YouTube reviews[^1_3][^1_4][^1_9]. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): No deltas on release date or MSRP. - Query ledger (top 6–10 queries): \"POP MART The Monsters Seed Expansion Time to Chill release date\", \"POP MART The Monsters Seed Expansion Time to Chill MSRP\", \"POP MART The Monsters Seed Expansion variants\", \"POP MART The Monsters Seed Expansion Time to Chill size weight\", \"POP MART The Monsters Seed Expansion Time to Chill materials\", \"POP MART The Monsters Seed Expansion Time to Chill packaging\", \"POP MART The Monsters Seed Expansion Time to Chill edition size\", \"POP MART The Monsters Seed Expansion Time to Chill credits\".",
    "i18n_nomenclature": "- Localized titles: LABUBU Time to Chill (EN), 拉布布放松时间 (CN)[^1_3]. - Transliteration notes: Labubu as 拉布布[^1_3]. - Per-locale notes: English and Chinese marketing[^1_3].",
    "relations_graph_edges": "- Predecessor/successor: Part of ongoing The Monsters series[^1_3][^1_8]. - Lateral variants: Other Labubu plush like Let's Checkmate[^1_4]. - Same sculpt/different finish: Similar vinyl plush format to other series[^1_3][^1_8]. - Shared collab capsule: None. - Series hub link: POP MART The Monsters collection[^1_1][^1_3].",
    "market intelligence optional": "- Official price history timeline: Launched at USD69.99, reseller prices up to USD150[^1_13]. - Secondary market range snapshots: Reseller prices around USD150 as of 2025[^1_13]. - Scarcity signals: Frequently sold out, hard to find at retail[^1_3][^1_4][^1_13]. Provenance URLs: - https://m.popmart.com/us/products/578/labubu-time-to-chill-vinyl-plush-doll[^1_1] - https://m.popmart.com/us/products/1874/[^1_5] - https://m.popmart.com/us/products/668/[^1_6] - https://stealplug.com.my/products/pop-mart-labubu-the-monsters-time-to-chill-vinyl-plush-doll[^1_2] - https://snkrdunk.com/en/magazine/2025/05/16/pop-mart-labubu-time-to-chill-plush-release-date-price-where-to-buy/[^1_3] - https://www.youtube.com/watch?v=XAv0Z9B40Lo[^1_4] - https://figpalace.com/blogs/guide/top-6-popular-monsters-labubu-vinyl[^1_8] - https://www.secretsneakerstore.com/products/pop-mart-x-the-monsters-labubu-time-to-chill-vinyl-plush-doll-4e8fd[^1_7] - https://www.youtube.com/watch?v=L7uP1lMTWwQ[^1_9] - https://www.kickscrew.com/products/pop-mart-the-monsters-labubu-time-to-chill-1220719025[^1_10] - https://www.youtube.com/watch?v=vq7UHD-rlXk[^1_14] - https://www.reddit.com/r/PopMartCollectors/comments/1gafhiy/i_made_a_quick_guide_for_new_labubu_collectors/[^1_12] - https://www.reddit.com/r/labubu/comments/1jk8vpy/anyone_else_annoyed_by_peoples_pricing_on/[^1_13] - https://www.worldoneconsulting.com/post/labubu-plush-toy-trend-2025[^1_15] - https://www.tiktok.com/@ensito20/video/7457133213102722334[^1_16] - https://dreamshoptij.store/products/pop-mart-the-monsters-time-to-chill[^1_11] Deltas: None.   ## UPDATED CURRENT QUEUE  1. Jump for Joy — 2023-05-25; CNY 499 (plush) 2. Dress be Latte — 2023-10-26; CNY 499 (plush) 3. Flip with Me — 2024-07-12; plush 40×20×15 cm; CN/US pricing exists 4. Fall in Wild — 2024-07-12; plush 40×20×15 and keychain pendant 17 cm 5. Let’s Checkmate (Doll) — 2025-02-07; 37 cm; USD 114.99 6. Let’s Checkmate (Hanging Card) — 2025-02-07; 17 cm; USD 39.99 7. Walk by Fortune (CNY) — 2023-12-29; CNY 499; limited 3,000 8. Best of Luck（海外限定） — 2023-12-30; CNY 499; limited 3,000; likely regional exclusive 9. Happy Halloween Party — 2024-10-25; AU\\$ 50 (keychain pendant) 10. PRONOUNCE — Be Fancy Now — 2024-03-15; CNY 599; limited 6,458 11. PRONOUNCE — Wings of Fantasy (plush) / Wings of Fortune (hanging card) — 2024-10-04; USD 119.99 / USD 43.99 12. Coca-Cola — 2025-01-24; 15.5×17 cm; set USD 239.94 / box USD 39.99 (blind box) 13. Exciting Macaron (v1) — 2024-10-27; set USD 131.94 / box USD 21.99 14. Have a Seat — 2024-07-12; 8×7×15 cm; set USD 131.94 / box USD 21.99 15. Big Into Energy (v3) — 2025-04-25; 17 cm; set USD 167.94 / box USD 27.99 16. I FOUND YOU (v1) — 2023-12-15; 30×25×58 cm; USD 179.99 17. ANGEL IN CLOUDS (v2) — 2024-10-25; 33×25×58 cm; USD 289.99 18. Close to Sweet (v1) — 2023-09-xx; plush vs pendant (split by form) 19. Fall into Spring — 2024-03-08; CNY 599 (plush) / CNY 159 (pendant) 20. Blue Diamond — 2024-06-18; CNY 159 (pendant) 21. Magic of Pumpkin (Halloween) — 2024-10-27; CNY 159 (pendant) 22. Twinkly Fairy Tale — 2024-11-28; CNY 159 (pendant) 23. Hide and Seek in Singapore — S\\$37.90; 10×10×17.5 cm; reg-sg expected 24. GOOD LUCKY TO YOU (Thailand) — THB 1,050; 2024-12-20; reg-th expected 25. Forest Fairy Tale (China) — 2025-05-26; member points; reg-cn expected 26. Wacky Mart (China) — 2025-06-12; CNY 199; reg-cn expected  <div style=\"text-align: center\">⁂</div>                       ---  ## COMPLETED SEEDS",
    "Deltas": [
      "release_date: ",
      "price: ",
      "identity_taxonomy: THE MONSTERS series LABUBU \"Time to Chill\" vinyl plush doll, part of the core edition releases by POP MART. Features the classic LABUBU character design with bunny-like ears and signature nine-tooth grin[^1_1][^1_2][^1_3].",
      "release_distribution: Official POP MART stores, online platforms (popmart.com), and authorized retailers globally. Also available through third-party collectible toy retailers and secondary market platforms[^1_8][^1_9][^1_10].",
      "credits: Created by artist Kasing Lung (龙家升) as part of THE MONSTERS intellectual property, exclusively manufactured and distributed by POP MART[^1_2][^1_3].",
      "physical_spec: Manufactured using mixed materials combining vinyl head construction with soft plush body. Quality noted to be generally good though some collectors report minor variations in stuffing density and positioning[^1_4][^1_6][^1_5].",
      "media_assets: Featured prominently in POP MART's marketing campaigns as a comfort/relaxation themed release. Benefited from broader LABUBU popularity surge, particularly following city park openings and celebrity endorsements[^1_2][^1_3].",
      "market_listings: Global release across POP MART stores and official online platforms. Currently mostly sold out at retail, available primarily through secondary market and resellers. Has seen periodic restocks but remains in high demand[^1_8][^1_9].",
      "identity_taxonomy: Single colorway featuring brown fuzzy exterior with blue eyes, dressed in denim dungarees. Some versions noted to include removable accessories like boba-inspired cup props as thematic elements[^1_5].",
      "packaging_in_box_contents: Standard POP MART windowed display box packaging. Product comes in sealed retail packaging with official authentication elements including QR code verification system[^1_4][^1_5].",
      "All pricing and release date information consistent across sources. No contradictions found with seed data.",
      "media_assets: Official product photography available showing doll in packaging and unboxed state. YouTube promotional video from POP MART official channel dated November 10, 2022[^1_13].",
      "identity_taxonomy: THE MONSTERS series by Kasing Lung featuring Labubu, a Nordic forest elf with signature nine-tooth grin, pointy ears, and mischievous personality. First generation plush doll combining vinyl face plate with plush body[^1_1][^1_2][^1_3].",
      "physical specification: Height: 14.5 inches (37cm), Materials: polyester, cotton, vinyl face plate, PP/PVC components. Soft huggable plush body with vinyl face ensuring signature Labubu look. Movable eyes and articulated features for display versatility[^1_2][^1_4][^1_5].",
      "edition & release context: Inaugural plush doll release marking Labubu's transition from blind box to premium plush format. No regional restrictions, global release through official POP MART channels[^1_1][^1_2][^1_3].",
      "market_listings: Original retail: USD 69.99. Secondary market: significant appreciation with some listings reaching 760-7399 USD (973% markup). Notable price stability in initial years before 2024 explosion[^1_1][^1_6][^1_7].",
      "release_distribution: POP MART official stores, authorized retailers, online platforms. Secondary distribution through SNKRDUNK, reseller markets[^1_2][^1_8].",
      "packaging_in_box_contents: Premium packaging with collectible card, plastic protective wrapping. Box design featuring Time to Chill artwork and character information[^1_10][^1_5].",
      "credits: Licensed from Kasing Lung's THE MONSTERS IP, exclusive to POP MART. Part of broader Nordic forest mythology universe[^1_11][^1_12].",
      "physical_spec: High-quality materials blend: polyester primary construction, cotton elements, vinyl face components. Premium feel with durability considerations[^1_2][^1_4].",
      "media_assets: - Hero image(s): Labubu in denim outfit[^1_3]. - Orthographic angles: Front view with box[^1_9]. - Packaging flats: Blue color box with artwork[^1_9]. - Icon/thumb: Unknown. - Videos: Unboxing and review videos[^1_4][^1_9][^1_14]. - Image rights note: Official POP MART assets[^1_3]. - Asset hashes: Unknown.",
      "market_intelligence: Highly positive collector response, considered foundational piece for Labubu collectors. Gateway product for series entry[^1_2][^1_3].",
      "market_listings: Initially widely available, now primarily secondary market. Periodic restocks noted through 2024. Available in US, Singapore, Taiwan, Hong Kong markets[^1_2][^1_8][^1_9].",
      "identity_taxonomy: Single colorway: denim dungarees with pastel blue top, embodying laid-back aesthetic. Blue/denim colorway designation[^1_1][^1_2].",
      "packaging_in_box_contents: Complete outfit: cozy denim dungarees, pastel blue top. Includes authentication card and original packaging[^1_2][^1_5].",
      "Regional release variations noted in some markets through July 2024, extending beyond original October 2022 date[^1_2].",
      "media_assets: YouTube promotional content, social media campaigns. Featured in celebrity collections and influencer unboxings[^1_10][^1_13]."
    ],
    "physical specification": "Height: 14.5 inches (37cm)[^1_4][^1_5]. Materials: Shell composed of PP/Polyester/Cotton mixture, with plush material being 95% Polyester Fiber, 5% Cotton. Stuffing: 90% Polyester Fiber, 10% PP particles[^1_6][^1_7]. Weight: specifications indicate normal range variance of 0.4-1.2 inches due to measurement variations[^1_4].",
    "edition & release context": "Regular production item, not limited edition. Released as part of LABUBU's early successful series that helped establish the character's popularity globally. Features relaxed \"chill\" theme with laid-back denim dungarees over pastel top, embodying comfort and relaxation[^1_5].",
    "market_listings": "Launch price: USD 69.99[^1_1]. Packing size approximately 20×16.4×37.5cm[^1_6][^1_7]. Secondary market performance: By March 2024, became the best-selling plush product in POP MART's Tmall flagship store plush category with sales exceeding 4 million CNY[^1_2][^1_3]. Current secondary market prices range significantly above retail.",
    "packaging_in_box_contents": "Includes original packaging, official authentication materials, and character-specific accessories. Some retailers note opened box variants for authenticity verification purposes[^1_11][^1_12].",
    "market_intelligence": "Highly popular among collectors, considered one of the essential LABUBU releases. Praised for its comforting aesthetic and high-quality materials. Regular appearance in collection showcases and social media posts[^1_2][^1_3]."
  },
  {
    "name": "Jump for Joy",
    "release_date": "2023-05-25; CNY 499 (plush)",
    "price": "CNY 499 (plush)",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Jump for Joy. - Product title (marketing title + normalized title): THE MONSTERS – JUMP FOR JOY Vinyl Plush Doll. - Variant name (colorway, pose, outfit): Galaxy grey coat with bomber jacket, cargo pants, and boots. - Form: Vinyl plush doll. - Deterministic product_id components: Unknown. - Aliases \\& search tokens (EN/中文; common misspellings): Jump for Joy Labubu, 拉布布跳跃欢乐 (inferred from series context). - Parent/child relations (reissue, seasonal of core, collab of core): Core variant in The Monsters universe, no direct reissue noted[^2_1][^2_2].",
    "physical_spec": "- Size (h/w/d in cm): 18×16×38 cm. - Weight (grams): Unknown. - Materials: PU, PP, polyester, fabric. - Finish (matte, flocked, metallic, translucent): Soft plush body with vinyl face. - Articulation/motion: Posable hands. - Accessories in box: None specified. - Colorway notes: Grey fur with urban outfit accents[^2_3][^2_4][^2_2][^2_5].",
    "packaging & inbox contents": "- Packaging type: Color box. - Packaging dimensions \\& weight: Unknown. - Box contents bill: Plush doll, authenticity card (inferred from series standards). - Authenticity/anti-counterfeit marker: QR code for verification. - Factory/QA code: Unknown[^2_1].",
    "edition_run_info": "- Edition.kind: Standard edition. - Edition size (unit_count): Unknown. - Chase/rarity ratio: Not applicable (non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升). - Sculpt/model credits: Unknown. - Collaboration partner: None. - Licensing owner: POP MART[^2_1][^2_6].",
    "release_distribution": "- Announced date: Unknown. - Release date (authoritative; log deltas if contradicted): 2023-05-26. - Drop windows (channels): POP MART official online store, global sites. - Purchase limits: Unknown. - Queues/mechanics: Sold out quickly. - Restock/second wave dates: Unknown. - End-of-life or “sold out” date: Sold out immediately upon release[^2_7][^2_3][^2_1][^2_4][^2_8].",
    "regional_policy": "- Region_lock (true/false; explanation): False; available internationally via POP MART sites. - Regional codes involved: US, CN, global. - Packaging/regulatory differences: Unknown[^2_1].",
    "market listings per regionchannel": "- Region code: CN. - Channel: POP MART official site. - Launch MSRP (currency + numeric): CNY499. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, available via resellers at higher prices (e.g., ₱41,900). - Purchase limit at listing: Unknown[^2_1][^2_9][^2_5].",
    "blindbox specifics if relevant": "- Not applicable (single plush doll, not blind box).",
    "compliance_safety": "- Age rating: Not suitable for persons under 15. - Warnings: Unknown. - Compliance marks: Unknown. - HS/customs category: Unknown[^2_3][^2_4].",
    "commerce & logistics adjuncts": "- SKU/model code: Unknown. - Barcode/EAN/UPC: Unknown. - Shipping box info: Unknown. - Return policy excerpt: Standard POP MART returns (inferred). - Warranty/support link: Unknown.",
    "media_assets": "- Hero image(s): Labubu in bomber jacket outfit. - Orthographic angles: Front and side views. - Packaging flats: Color box with artwork. - Icon/thumb: Unknown. - Videos: Unboxing videos. - Image rights note: Official POP MART assets. - Asset hashes: Unknown[^2_7][^2_2].",
    "provenance & research trace": "- Primary sources used: POP MART official site, Instagram. - Secondary sources used: Fig Palace, Bagaholicboy. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): Release date adjusted to 2023-05-26 from seed's 2023-05-25 based on multiple sources. - Query ledger (top 6–10 queries): \"Pop Mart Jump for Joy plush 2023 release\", \"Pop Mart Jump for Joy plush 2023 price\", \"Pop Mart Jump for Joy plush 2023 physical specifications\", \"Pop Mart Jump for Joy variants\", \"Pop Mart Jump for Joy materials\", \"Pop Mart Jump for Joy packaging\", \"Pop Mart Jump for Joy edition size\", \"Pop Mart Jump for Joy credits\".",
    "i18n_nomenclature": "- Localized titles: Jump for Joy (EN), 跳跃欢乐 (CN, inferred). - Transliteration notes: Labubu as 拉布布. - Per-locale notes: English and Chinese marketing[^2_1].",
    "relations_graph_edges": "- Predecessor/successor: Part of ongoing The Monsters series. - Lateral variants: Other Labubu plush like Dress be Latte. - Same sculpt/different finish: Similar vinyl plush format to other series. - Shared collab capsule: None. - Series hub link: POP MART The Monsters collection[^2_1].",
    "market intelligence optional": "- Official price history timeline: Launched at CNY499, reseller prices up to ₱47,895 as of 2024. - Secondary market range snapshots: High demand with prices around ₱41,900–₱47,895. - Scarcity signals: Frequently sold out, rare find at retail[^2_1][^2_9][^2_2][^2_5]. Provenance URLs: - https://www.instagram.com/reel/Csip88egS27/?hl=en - https://m.popmart.com/us/products/874/ - https://figpalace.com/blogs/guide/labubu-zimomo-mokoko-series-list - https://m.popmart.com/us/products/281/ - https://www.instagram.com/p/DBskzrgP9Nl/?hl=en - https://en.wikipedia.org/wiki/Pop_Mart - https://m.alibaba.com/showroom/big-tall-doll.html - https://bagaholicboy.com/2024/08/the-monsters-vinyl-plush-doll-and-doll-pendants - https://x.com/POPMARTGlobal/status/1660655301593374728 - https://shoegamemanila.myshopify.com/products/pop-mart-the-monsters-jump-for-joy-vinyl-plush-doll Deltas: Release date contradicted by sources; adjusted to 2023-05-26[^2_7][^2_3][^2_1][^2_4][^2_8].",
    "Deltas": [
      "release_date: ",
      "identity_taxonomy: Single variant featuring galaxy grey coat coloring, positioned as the signature look for this release series. The grey coloring was specifically highlighted in marketing materials as a key aesthetic element[^1_14][^1_15].",
      "release_distribution: Released through official POP MART channels including online store and physical retail locations. Also distributed through authorized retailers and now available via secondary market platforms[^1_14][^1_18][^1_19].",
      "credits: Part of THE MONSTERS IP created by Kasing Lung, exclusively produced by POP MART under official licensing agreements[^1_14].",
      "physical_spec: High-quality plush construction with attention to detail in both materials and finishing. Collectors note good build quality consistent with other premium LABUBU releases[^1_16].",
      "media_assets: Featured in official POP MART social media campaigns with emphasis on the \"jump for joy\" theme. Promotional materials highlighted the playful, energetic positioning of the character[^1_14][^1_15].",
      "market_listings: Launch price: CNY 499 as specified in seed data[^1_14]. Secondary market pricing significantly elevated, with resale prices reaching over \\$2,400 USD for opened box variants[^1_16].",
      "identity_taxonomy: THE MONSTERS LABUBU \"Jump for Joy\" vinyl plush doll, second generation release featuring LABUBU with galaxy grey coat in jumping pose. Part of core LABUBU plush series[^1_14][^1_15].",
      "packaging_in_box_contents: Standard POP MART packaging with product visibility window. Includes authenticity verification materials and official documentation[^1_16].",
      "Release date correction: Seed listed May 25, 2023, but official sources confirm May 26, 2023 as the actual release date[^1_14][^1_17].",
      "media_assets: Official social media promotional content available including Instagram reels and X/Twitter posts showing product details and marketing materials[^1_14][^1_15][^1_17].",
      "release_date: 2023-05-25",
      "price: ",
      "identity_taxonomy: Second major plush release featuring Labubu in winter attire. Part of THE MONSTERS core edition series, maintaining vinyl face/plush body hybrid design[^1_14][^1_15][^1_16].",
      "physical specification: Size: Approximately 15.75 inches in height. Materials: PLUSH+PVC construction. Features similar construction to other large format LABUBU plush dolls with vinyl face and soft plush body[^1_16].",
      "edition & release context: Released as seasonal/winter-themed edition. Multiple release dates noted: initial May 25, 2023 launch with June 9, 2023 wider release[^1_17][^1_16][^1_18].",
      "market_listings: Original retail: CNY 499 (~USD 71). Secondary market shows appreciation with listings at SGD 109-978 range. Quality variations affecting pricing noted[^1_14][^1_19][^1_15].",
      "release_distribution: POP MART official stores, authorized retailers, reseller platforms including secondary markets[^1_15][^1_17].",
      "packaging_in_box_contents: Complete winter outfit set: furry hat, scarf, sweater, snow shoes. All clothing elements removable for customization[^1_15].",
      "credits: Continuation of Kasing Lung THE MONSTERS IP licensing through POP MART[^1_15].",
      "physical_spec: PU/PP/Polyester material construction. Height specifications: 7.1/6.3/14.9 inches noted in different configurations[^1_17][^1_18].",
      "media_assets: Social media campaigns with \"jump for joy\" messaging. Instagram and Twitter promotional content documented[^1_16][^1_13][^1_20].",
      "market_intelligence: Positive collector response with particular appreciation for quality winter accessories and seasonal theme[^1_15].",
      "market_listings: Global distribution including Singapore, US, Taiwan markets. Noted availability challenges during peak demand periods[^1_19][^1_15].",
      "identity_taxonomy: Primary variant features galaxy grey coat with winter accessories. Stylish clothing and removable accessories confirmed[^1_19][^1_15][^1_13].",
      "packaging_in_box_contents: Standard premium packaging with authentication elements. Box artwork featuring winter/joy theme[^1_15].",
      "None identified versus seed data.",
      "media_assets: Social media content, product photography, collector documentation available[^1_16][^1_13][^1_20]."
    ],
    "physical specification": "Height: 15.75 inches (40cm), Materials: PLUSH+PVC construction. Features galaxy grey coat as distinctive element. Removable winter clothing including furry hat, scarf, sweater, snow shoes[^1_14][^1_15].",
    "edition & release context": "Released as part of 2023 product line expansion. Launch date confirmed as May 26, 2023 (correcting seed date of May 25)[^1_14][^1_17]. Marketed with theme of joyful movement and playful energy.",
    "market_listings": "Limited availability, quickly sold out from official channels. Currently available primarily through secondary market and specialized collectible retailers at premium pricing[^1_16].",
    "packaging_in_box_contents": "Includes original packaging and authentication materials. Some secondary market listings note \"opened box\" variants for verification purposes[^1_16].",
    "market_intelligence": "Well-received by collectors, considered an important release in the LABUBU timeline. Praised for unique pose and attractive colorway. Regular feature in collector showcases[^1_20][^1_21]."
  },
  {
    "name": "Dress be Latte",
    "release_date": "2023-10-26; CNY 499 (plush)",
    "price": "CNY 499 (plush)",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Dress be Latte. - Product title (marketing title + normalized title): THE MONSTERS – DRESS BE LATTE Vinyl Plush Doll. - Variant name (colorway, pose, outfit): Latte shades with furry bucket hat, knit shirt, scarf, pants, shoulder bag, shoes. - Form: Vinyl plush doll. - Deterministic product_id components: Unknown. - Aliases \\& search tokens (EN/中文; common misspellings): Dress be Latte Labubu, 拉布布拿铁装扮 (inferred from series context). - Parent/child relations (reissue, seasonal of core, collab of core): Core variant in The Monsters universe, fall-winter seasonal theme, no direct reissue noted[^2_1][^2_2].",
    "physical_spec": "- Size (h/w/d in cm): Approximately 38 cm height (inferred from series standards). - Weight (grams): Unknown. - Materials: ABS, PVC, plush fabric. - Finish (matte, flocked, metallic, translucent): Soft fluffy plush with vinyl elements. - Articulation/motion: Unknown. - Accessories in box: None specified. - Colorway notes: Latte-toned outfit with fluffy accents[^2_2][^2_10][^2_11].",
    "packaging & inbox contents": "- Packaging type: Color box. - Packaging dimensions \\& weight: Unknown. - Box contents bill: Plush doll. - Authenticity/anti-counterfeit marker: QR code (inferred). - Factory/QA code: Unknown[^2_1].",
    "edition_run_info": "- Edition.kind: Standard edition. - Edition size (unit_count): Unknown. - Chase/rarity ratio: Not applicable (non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升). - Sculpt/model credits: Unknown. - Collaboration partner: None. - Licensing owner: POP MART[^2_1][^2_6].",
    "release_distribution": "- Announced date: Unknown. - Release date (authoritative; log deltas if contradicted): 2023-10-27. - Drop windows (channels): POP MART official online store, global sites. - Purchase limits: Unknown. - Queues/mechanics: Sold out quickly. - Restock/second wave dates: Unknown. - End-of-life or “sold out” date: Sold out upon release[^2_1][^2_10][^2_12].",
    "regional_policy": "- Region_lock (true/false; explanation): False; available internationally. - Regional codes involved: US, CN, global. - Packaging/regulatory differences: Unknown[^2_1].",
    "market listings per regionchannel": "- Region code: CN. - Channel: POP MART official site. - Launch MSRP (currency + numeric): CNY499. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, reseller prices up to \\$486. - Purchase limit at listing: Unknown[^2_1][^2_2][^2_10].",
    "blindbox specifics if relevant": "- Not applicable (single plush doll, not blind box).",
    "compliance_safety": "- Age rating: Not suitable for persons under 15. - Warnings: Unknown. - Compliance marks: Unknown. - HS/customs category: Unknown[^2_10][^2_11].",
    "commerce & logistics adjuncts": "- SKU/model code: Unknown. - Barcode/EAN/UPC: Unknown. - Shipping box info: Unknown. - Return policy excerpt: Standard returns. - Warranty/support link: Unknown.",
    "media_assets": "- Hero image(s): Labubu in latte outfit. - Orthographic angles: Front views. - Packaging flats: Color box. - Icon/thumb: Unknown. - Videos: Unboxing. - Image rights note: Official assets. - Asset hashes: Unknown[^2_2][^2_12][^2_13].",
    "provenance & research trace": "- Primary sources used: POP MART site, Instagram. - Secondary sources used: Fig Palace, Blindboxmall. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): Release date adjusted to 2023-10-27 from seed's 2023-10-26. - Query ledger (top 6–10 queries): \"Pop Mart Dress be Latte plush 2023 release\", \"Pop Mart Dress be Latte plush 2023 price\", \"Pop Mart Dress be Latte plush 2023 physical specifications\", \"Pop Mart Dress be Latte variants\", \"Pop Mart Dress be Latte materials\", \"Pop Mart Dress be Latte packaging\", \"Pop Mart Dress be Latte edition size\", \"Pop Mart Dress be Latte credits\".",
    "i18n_nomenclature": "- Localized titles: Dress be Latte (EN), 拿铁装扮 (CN, inferred). - Transliteration notes: Labubu as 拉布布. - Per-locale notes: English and Chinese[^2_1].",
    "relations_graph_edges": "- Predecessor/successor: Part of The Monsters series. - Lateral variants: Jump for Joy, other plush. - Same sculpt/different finish: Similar format. - Shared collab capsule: None. - Series hub link: POP MART collection[^2_1].",
    "market intelligence optional": "- Official price history timeline: Launched at CNY499, resellers at \\$486. - Secondary market range snapshots: High secondary prices. - Scarcity signals: Sold out, collectible demand[^2_1][^2_2][^2_10][^2_13]. Provenance URLs: - https://figpalace.com/blogs/guide/labubu-zimomo-mokoko-series-list - https://bagaholicboy.com/2024/08/the-monsters-vinyl-plush-doll-and-doll-pendants - https://blindboxmall.com/products/pop-mart-the-monsters-dress-be-latte-vinyl-plush-doll - https://www.popmart.com/be/products/525/ - https://x.com/POPMARTGlobal/status/1715396274352980341?lang=en - https://www.instagram.com/reel/C53wrJLSxlC/ - https://www.popmart.com/ie/products/525 - https://fr.pinterest.com/pin/the-monsters-dress-be-latte-vinyl-plush-doll--418412621656709921/ Deltas: Release date contradicted; adjusted to 2023-10-27[^2_1][^2_10][^2_12][^2_11].   ## UPDATED CURRENT QUEUE  1. Flip with Me — 2024-07-12; plush 40×20×15 cm; CN/US pricing exists 2. Fall in Wild — 2024-07-12; plush 40×20×15 and keychain pendant 17 cm 3. Let’s Checkmate (Doll) — 2025-02-07; 37 cm; USD 114.99 4. Let’s Checkmate (Hanging Card) — 2025-02-07; 17 cm; USD 39.99 5. Walk by Fortune (CNY) — 2023-12-29; CNY 499; limited 3,000 6. Best of Luck（海外限定） — 2023-12-30; CNY 499; limited 3,000; likely regional exclusive 7. Happy Halloween Party — 2024-10-25; AU\\$ 50 (keychain pendant) 8. PRONOUNCE — Be Fancy Now — 2024-03-15; CNY 599; limited 6,458 9. PRONOUNCE — Wings of Fantasy (plush) / Wings of Fortune (hanging card) — 2024-10-04; USD 119.99 / USD 43.99 10. Coca-Cola — 2025-01-24; 15.5×17 cm; set USD 239.94 / box USD 39.99 (blind box) 11. Exciting Macaron (v1) — 2024-10-27; set USD 131.94 / box USD 21.99 12. Have a Seat — 2024-07-12; 8×7×15 cm; set USD 131.94 / box USD 21.99 13. Big Into Energy (v3) — 2025-04-25; 17 cm; set USD 167.94 / box USD 27.99 14. I FOUND YOU (v1) — 2023-12-15; 30×25×58 cm; USD 179.99 15. ANGEL IN CLOUDS (v2) — 2024-10-25; 33×25×58 cm; USD 289.99 16. Close to Sweet (v1) — 2023-09-xx; plush vs pendant (split by form) 17. Fall into Spring — 2024-03-08; CNY 599 (plush) / CNY 159 (pendant) 18. Blue Diamond — 2024-06-18; CNY 159 (pendant) 19. Magic of Pumpkin (Halloween) — 2024-10-27; CNY 159 (pendant) 20. Twinkly Fairy Tale — 2024-11-28; CNY 159 (pendant) 21. Hide and Seek in Singapore — S\\$37.90; 10×10×17.5 cm; reg-sg expected 22. GOOD LUCKY TO YOU (Thailand) — THB 1,050; 2024-12-20; reg-th expected 23. Forest Fairy Tale (China) — 2025-05-26; member points; reg-cn expected 24. Wacky Mart (China) — 2025-06-12; CNY 199; reg-cn expected  <div style=\"text-align: center\">⁂</div>                       ---  ## COMPLETED SEEDS",
    "Deltas": [
      "release_date: ",
      "identity_taxonomy: THE MONSTERS LABUBU \"Dress be Latte\" vinyl plush doll, part of seasonal autumn/winter collection. Features LABUBU in cozy latte-themed outfit with brown sweater and bucket hat design[^1_22][^1_23].",
      "release_distribution: Originally released through POP MART official stores including海港城LCX店 and K11购物艺术中心 in Hong Kong, plus mainland China retail network[^1_29]. Now available primarily through secondary market platforms[^1_25][^1_30].",
      "credits: Part of THE MONSTERS IP by Kasing Lung, exclusively produced by POP MART. Represents continued expansion of lifestyle-themed LABUBU releases[^1_23].",
      "physical_spec: High-quality construction with detailed attention to accessories and fabric elements. Materials designed to convey cozy, comfortable aesthetic matching the latte theme[^1_24][^1_23].",
      "media_assets: Featured in official POP MART campaigns with emphasis on autumn/winter comfort themes. Marketing highlighted the \"cozy hat and scarf\" elements and positioning as a \"warm cup of latte\" companion[^1_23][^1_31][^1_29].",
      "market_listings: Officially sold out. High demand led to rapid sell-out from retail channels. Currently available only through secondary market at premium pricing, with some listings exceeding \\$1,800 USD[^1_24][^1_28].",
      "identity_taxonomy: Single variant featuring brown color scheme with bucket hat and cozy scarf accessories, designed to evoke coffee/latte aesthetic and autumn comfort themes[^1_23][^1_31][^1_29].",
      "packaging_in_box_contents: Standard POP MART windowed packaging with official authentication materials. Features autumn/winter themed packaging design elements[^1_23][^1_31].",
      "Release date correction: Seed data shows October 26, 2023, but official sources confirm October 27, 2023[^1_23][^1_26].",
      "media_assets: Official promotional materials including Instagram posts and social media campaigns showcasing the autumn/winter theme and cozy aesthetic[^1_23][^1_31][^1_29].",
      "release_date: 2023-10-26",
      "price: ",
      "identity_taxonomy: Third major plush release featuring café/latte aesthetic. Part of core THE MONSTERS plush doll line with signature vinyl face/plush body construction[^1_21][^1_22][^1_23].",
      "physical specification: Height: 14.9 inches (37.9cm), Dimensions: 22 x 15 x 38 cm. Materials: ABS/PVC face, 80% polyester fiber, 20% cotton. 90% polyester filling, 10% PP rubber components[^1_21][^1_22].",
      "edition & release context: Café-themed release coinciding with autumn season. Features Maillard reaction color palette inspiration in latte/coffee aesthetic[^1_21][^1_24].",
      "market_listings: Original retail: CNY 499. Secondary market pricing: 950-1250 USD range noted. High collector demand driving significant premiums[^1_21][^1_22].",
      "release_distribution: POP MART official channels, authorized retailers. Notable distribution through Singapore and Taiwan markets[^1_23][^1_27].",
      "packaging_in_box_contents: 6 small accessory pieces for customization, allowing outfit changes and personalization options[^1_22].",
      "credits: Standard THE MONSTERS IP licensing from Kasing Lung through POP MART[^1_21].",
      "physical_spec: Premium material composition with detailed construction specifications. 38cm large doll size category[^1_22].",
      "media_assets: TikTok promotional content, Instagram features. Celebrity collector endorsements noted including Lisa preferences[^1_28][^1_22].",
      "market_intelligence: Strong collector enthusiasm, particularly for customization aspects. Questions about restock availability indicate high demand[^1_29].",
      "market_listings: Limited availability, frequent sellouts noted. Available in China, Taiwan, and select international markets[^1_23][^1_25][^1_26].",
      "identity_taxonomy: Single latte/coffee colorway with 6 small accessories for dress-up customization. Latte aesthetic maintained throughout[^1_22].",
      "packaging_in_box_contents: Premium packaging with authentication elements. Coffee/latte themed artwork on packaging[^1_21].",
      "None identified versus seed data.",
      "media_assets: TikTok unboxing content, Instagram promotional materials, product photography available[^1_28][^1_30][^1_31][^1_32]."
    ],
    "physical specification": "Size: Approximately 15.75 inches (40cm) in height. Materials: PLUSH+PVC construction with detailed fabric accessories. Features the standard LABUBU vinyl face with soft plush body construction[^1_24][^1_25].",
    "edition & release context": "Released October 27, 2023 (correcting seed date of October 26)[^1_23][^1_26]. Positioned as autumn/winter seasonal release with coffee/comfort theme. Part of THE MONSTERS core series expansion focusing on lifestyle themes[^1_23].",
    "market_listings": "Launch price: CNY 499 as specified in seed data[^1_22]. Notable secondary market appreciation - actress Yao Chen mentioned purchasing for \"a few hundred yuan\" and later noting it as \"the only successful investment I've ever made\" due to significant value increase[^1_22]. Currently sold out from official channels[^1_27][^1_28].",
    "packaging_in_box_contents": "Includes removable bucket hat and scarf accessories as key design elements. Package includes original box and authentication materials[^1_24][^1_23].",
    "market_intelligence": "Extremely popular among collectors and gained broader cultural attention when actress Yao Chen publicly praised it as a successful investment. Considered one of the standout 2023 releases[^1_22][^1_32]."
  },
  {
    "name": "Flip with Me",
    "release_date": "2024-07-12; plush 40×20×15 cm; CN/US pricing exists",
    "price": "plush 40×20×15 cm",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Flip with Me. - Product title (marketing title + normalized title): THE MONSTERS – FLIP WITH ME Vinyl Plush Doll. - Variant name (colorway, pose, outfit): Blue and white striped button-down shirt, dark denim jeans, black and white sneakers, glasses. - Form: Vinyl plush doll. - Deterministic product_id components: SKU 12401040004. - Aliases \\& search tokens (EN/中文; common misspellings): Flip with Me Labubu, 拉布布翻转和我一起 (inferred from series context). - Parent/child relations (reissue, seasonal of core, collab of core): Core variant in The Monsters universe, no direct reissue noted.",
    "physical_spec": "- Size (h/w/d in cm): 20×15×40cm / 7.87×5.91×15.75 inches. - Weight (grams): Unknown. - Materials: SHELL: 40% Cotton, 17% PVC, 16% Polyester, 15% ABS, 12% TPR; STUFFING: 90% Polyester, 10% PE Particles. - Finish (matte, flocked, metallic, translucent): Soft plush body with vinyl face and articulated features. - Articulation/motion: Movable eyes with flip feature (spiral eyes), posable hands and head. - Accessories in box: Removable glasses. - Colorway notes: Tan plush fur with blue striped shirt and denim pants.",
    "packaging & inbox contents": "- Packaging type: Color box with handle. - Packaging dimensions \\& weight: Single package size: 30×22×45 cm; Single gross weight: 5.000 KG. - Box contents bill: Plush doll, glasses accessory, authenticity card. - Authenticity/anti-counterfeit marker: Zip ties, batch verification. - Factory/QA code: Unknown.",
    "edition_run_info": "- Edition.kind: Standard edition. - Edition size (unit_count): Unknown. - Chase/rarity ratio: Not applicable (non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升). - Sculpt/model credits: POP MART design team. - Collaboration partner: None. - Licensing owner: POP MART.",
    "release_distribution": "- Announced date: July 7, 2024. - Release date (authoritative; log deltas if contradicted): July 12, 2024. - Drop windows (channels): POP MART official online store, global sites, in-store only in some regions. - Purchase limits: Limited to 2 pieces per order in some channels. - Queues/mechanics: High demand, frequent sellouts. - Restock/second wave dates: August 9, 2024 in-store availability. - End-of-life or \"sold out\" date: Frequently sold out.",
    "regional_policy": "- Region_lock (true/false; explanation): False; available internationally via POP MART sites. - Regional codes involved: US, CA, CN, global. - Packaging/regulatory differences: Unknown.",
    "market listings per regionchannel": "- Region code: US. - Channel: POP MART official site. - Launch MSRP (currency + numeric): USD114.99. - Region code: CA. - Channel: POP MART official site. - Launch MSRP (currency + numeric): CAD134.99. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, reseller prices ranging from USD182–USD226. - Purchase limit at listing: Limited to 2 pieces per order.",
    "blindbox specifics if relevant": "- Not applicable (single plush doll, not blind box).",
    "compliance_safety": "- Age rating: Not suitable for persons under 15. - Warnings: Unknown. - Compliance marks: California Proposition 65 Consumer Warning. - HS/customs category: Unknown.",
    "commerce & logistics adjuncts": "- SKU/model code: 12401040004. - Barcode/EAN/UPC: Unknown. - Shipping box info: 30×22×45 cm packaging. - Return policy excerpt: 15-day returns. - Warranty/support link: Unknown.",
    "media_assets": "- Hero image(s): Labubu in office outfit with glasses. - Orthographic angles: Front views with flip eye feature. - Packaging flats: Color box with handle design. - Icon/thumb: Unknown. - Videos: Multiple unboxing and review videos. - Image rights note: Official POP MART assets. - Asset hashes: Unknown.",
    "provenance & research trace": "- Primary sources used: POP MART official sites (US, CA), Instagram. - Secondary sources used: Hypevault, YouTube reviews, Alibaba listings. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): No deltas on release date or MSRP. - Query ledger (top 6–10 queries): \"POP MART The Monsters Flip with Me 2024 plush release\", \"POP MART The Monsters Flip with Me 2024 price specifications\", \"POP MART Flip with Me Let's Checkmate 2025 release\", \"POP MART Flip with Me pricing CN US specifications\", \"POP MART The Monsters Flip with Me materials\", \"POP MART The Monsters Flip with Me packaging\".",
    "i18n_nomenclature": "- Localized titles: Flip with Me (EN), 翻转和我一起 (CN, inferred). - Transliteration notes: Labubu as 拉布布. - Per-locale notes: English and Chinese marketing.",
    "relations_graph_edges": "- Predecessor/successor: Part of ongoing The Monsters series. - Lateral variants: Let's Checkmate, Fall in Wild, other vinyl plush. - Same sculpt/different finish: Similar vinyl plush format to other series. - Shared collab capsule: None. - Series hub link: POP MART The Monsters collection.",
    "market intelligence optional": "- Official price history timeline: Launched at USD114.99/CAD134.99, reseller prices USD182–USD226. - Secondary market range snapshots: High secondary market demand at 60-98% markup. - Scarcity signals: Frequent sellouts, limited per-order quantities. Provenance URLs: - https://m.popmart.com/us/products/1371/the-monsters-flip-with-me-vinyl-plush-doll - https://stealplug.com.my/products/pop-mart-labubu-the-monsters-flip-with-me-vinyl-plush-doll - https://www.instagram.com/p/C9I55UepT-E/?hl=en - https://hypevault.co/products/pop-mart-labubu-the-monsters-flip-with-me-vinyl-plush-doll - https://www.popmart.com/us/products/3106/ - https://www.instagram.com/reel/C9LQ99ToFiB/?hl=en - https://x.com/POPMARTGlobal/status/1809170068754116827?lang=en - https://curionest.ca/products/pop-mart-the-monsters-flip-with-me-vinyl-plush-doll-labubu - https://www.alibaba.com/product-detail/AUTHENTIC-POPMART-LABUBU-the-MONSTERS-FLIP_1601397338580.html - https://www.priorstoreofficial.com/zh/products/pop-mart-labubu-the-monsters-flip-with-me-vinyl-plush-doll - https://www.popmart.com/ca/products/1371/the-monsters-flip-with-me-vinyl-plush-doll Deltas: None.",
    "Deltas": [
      "release_date: ",
      "identity_taxonomy: Single variant featuring dreamy pastel gradient coloring shifting from peach at cheeks through mint and sky-blue at limbs. Includes velvety matte finish with glossy enamel highlights on eyes and ear tips[^1_33].",
      "release_distribution: Official POP MART stores and website (popmart.com), plus authorized international retailers. Also available through specialty toy and collectible retailers[^1_34][^1_39][^1_40].",
      "credits: Part of THE MONSTERS IP created by Kasing Lung, exclusively manufactured by POP MART under official licensing[^1_33].",
      "physical_spec: Premium construction combining sturdy vinyl shell with soft plush core. Advanced material composition designed for both display and tactile appeal[^1_33].",
      "media_assets: Featured in official POP MART social media campaigns emphasizing the dynamic \"flip\" action and playful energy theme[^1_35][^1_38]. YouTube unboxing content and promotional materials available[^1_37].",
      "market_listings: US pricing: \\$84.99 for plush doll[^1_34][^1_36]. Materials and construction suggest premium positioning within LABUBU product range. Secondary market activity indicates strong collector interest[^1_33].",
      "identity_taxonomy: THE MONSTERS \"Flip with Me\" vinyl plush doll featuring LABUBU in dynamic mid-air flip pose. Part of 2024 core series releases with emphasis on playful, energetic movement[^1_33][^1_34][^1_35].",
      "packaging_in_box_contents: Features removable oversized hoodie with subtle shading details. Includes embossed POP MART logo on sole for authenticity verification[^1_33].",
      "No contradictions found with seed data. Dimensions and release date confirmed accurate across all sources.",
      "media_assets: Official promotional photography, social media content, and YouTube unboxing videos showcasing the dynamic flip pose and gradient coloring[^1_37][^1_35][^1_38].",
      "release_date: 2024-07-12",
      "price: ",
      "identity_taxonomy: Latest major plush release featuring unique flip-eye mechanism. Part of 2024 THE MONSTERS lineup with innovative interactive features[^1_33][^1_34][^1_35].",
      "physical specification: Dimensions: 40×20×15 cm (confirmed), Height: 40cm. Features cream-colored fur, flip-eye mechanism creating four different expressions: confused, expectant, aggrieved, heart-struck[^1_19][^1_34].",
      "edition & release context: July 2024 release representing technological advancement in THE MONSTERS line. Smart casual aesthetic with professional styling[^1_19][^1_36].",
      "market_listings: SGD 109.90 confirmed pricing. USD pricing exists per seed data. Premium positioning in product line[^1_19][^1_34].",
      "release_distribution: POP MART official stores and online channels. Limited in-store pickup availability due to demand[^1_34][^1_35].",
      "packaging_in_box_contents: Complete professional outfit with glasses and footwear. Innovative flip-eye mechanism as key feature[^1_19][^1_34].",
      "credits: Continued THE MONSTERS IP licensing from Kasing Lung through POP MART[^1_34].",
      "physical_spec: Advanced construction incorporating flip-eye mechanism. Premium materials maintaining series standards[^1_34].",
      "media_assets: Instagram promotional content emphasizing interactive features. \"Flip with me\" messaging campaign[^1_36][^1_38].",
      "market_intelligence: High enthusiasm for interactive flip-eye feature. Collectors appreciate innovation in traditional plush format[^1_19][^1_34].",
      "market_listings: Global release including Singapore, US, Canada markets. High demand noted with supply challenges[^1_19][^1_37].",
      "identity_taxonomy: Single cream-colored fur variant with professional attire: black-rimmed glasses, blue and white pinstripe shirt, jeans, sneakers[^1_19][^1_34].",
      "packaging_in_box_contents: Standard premium THE MONSTERS packaging with flip-eye feature highlighting[^1_34].",
      "None identified versus seed data.",
      "media_assets: Instagram promotional content, product demonstration videos, collector documentation[^1_36][^1_38]."
    ],
    "physical specification": "Dimensions: 20×15×40 cm (7.87×5.91×15.75 inches) as specified in seed data[^1_33]. Materials: Shell composition of 40% Cotton, 17% PVC, 16% Polyester, 15% ABS, 12% TPR. Stuffing: 90% Polyester, 10% PE particles[^1_33]. Features whimsical mid-air flip sculpting with rounded silhouette.",
    "edition & release context": "Released July 12, 2024, simultaneously with \"Fall in Wild\" series[^1_34][^1_36][^1_35]. Positioned as energetic, playful release celebrating movement and joy. Part of broader 2024 product line expansion[^1_37][^1_38].",
    "market_listings": "Released through official POP MART channels with global availability. Has experienced periodic stock shortages due to high demand. Available through official online store and select retail partners[^1_34][^1_39][^1_40].",
    "packaging_in_box_contents": "Standard POP MART packaging with windowed display box. Features dynamic artwork highlighting the \"flip\" theme and movement concept[^1_35][^1_38].",
    "market_intelligence": "Positive reception among collectors for unique dynamic pose and quality construction. Popular choice for both display and as bag accessory due to balanced artistry and huggable appeal[^1_33][^1_41]."
  },
  {
    "name": "Fall in Wild",
    "release_date": "2024-07-12; plush 40×20×15 and keychain pendant 17 cm",
    "price": "plush 40×20×15 and keychain pendant 17 cm",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Fall in Wild. - Product title (marketing title + normalized title): THE MONSTERS FALL IN WILD SERIES – Vinyl Plush Doll (plush) / Vinyl Plush Doll Pendant (keychain). - Variant name (colorway, pose, outfit): Khaki bucket hat, denim overalls with \"LOVE BOO\" buckles, orange boots, flower accessory. - Form: Vinyl plush doll (40cm) and keychain pendant (17cm). - Deterministic product_id components: Unknown. - Aliases \\& search tokens (EN/中文; common misspellings): Fall in Wild Labubu, 拉布布秋野系列 (inferred from series context). - Parent/child relations (reissue, seasonal of core, collab of core): Core variant in The Monsters universe, spring/fall seasonal theme, available in both plush and pendant forms.",
    "physical_spec": "- Size (h/w/d in cm): Plush: 20×15×40cm; Pendant: 17cm height. - Weight (grams): Plush single package: 2.000 KG (gross weight). - Materials: FABRIC: 42% Cotton, 18% PVC, 15% ABS, 13% Polyester Fiber, 12% TPR; FILLING: 90% Polyester Fiber, 10% PE Pellets. - Finish (matte, flocked, metallic, translucent): Soft plush body with vinyl face and accessories. - Articulation/motion: Posable hands, removable hat and clothing. - Accessories in box: Removable bucket hat, flower accessory, boots (plush only). - Colorway notes: Tan fur with khaki hat, denim overalls, orange boots.",
    "packaging & inbox contents": "- Packaging type: Color box with window display and handles. - Packaging dimensions \\& weight: Plush: 35×20×17 cm, 2.000 KG; Pendant: smaller individual box. - Box contents bill: Plush/pendant doll, authenticity card. - Authenticity/anti-counterfeit marker: QR code verification, zip ties. - Factory/QA code: Unknown.",
    "edition_run_info": "- Edition.kind: Standard edition. - Edition size (unit_count): Unknown. - Chase/rarity ratio: Not applicable (non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升). - Sculpt/model credits: POP MART design team. - Collaboration partner: None. - Licensing owner: POP MART.",
    "release_distribution": "- Announced date: Unknown. - Release date (authoritative; log deltas if contradicted): April 12, 2024. - Drop windows (channels): POP MART official online store, global sites. - Purchase limits: Unknown. - Queues/mechanics: High demand, frequent sellouts. - Restock/second wave dates: Unknown. - End-of-life or \"sold out\" date: Frequently sold out.",
    "regional_policy": "- Region_lock (true/false; explanation): False; available internationally. - Regional codes involved: US, CN, AU, global. - Packaging/regulatory differences: Unknown.",
    "market listings per regionchannel": "- Region code: US. - Channel: POP MART official site. - Launch MSRP (currency + numeric): USD109.99 (plush), USD58.99 (pendant). - Region code: AU. - Channel: POP MART official site. - Launch MSRP (currency + numeric): AUD equivalent. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, reseller prices up to USD157.95–USD195 for plush, IDR 1,350,000 for pendant. - Purchase limit at listing: Unknown.",
    "blindbox specifics if relevant": "- Not applicable (single plush doll/pendant, not blind box).",
    "compliance_safety": "- Age rating: Unknown. - Warnings: California Proposition 65 Consumer Warning. - Compliance marks: Unknown. - HS/customs category: Unknown.",
    "commerce & logistics adjuncts": "- SKU/model code: Unknown. - Barcode/EAN/UPC: Unknown. - Shipping box info: 35×20×17 cm for plush. - Return policy excerpt: 15-day returns. - Warranty/support link: Unknown.",
    "media_assets": "- Hero image(s): Labubu in spring/fall outfit with bucket hat. - Orthographic angles: Front and side views, outfit details. - Packaging flats: Window box with artwork. - Icon/thumb: Unknown. - Videos: Multiple unboxing videos on YouTube and TikTok. - Image rights note: Official POP MART assets. - Asset hashes: Unknown.",
    "provenance & research trace": "- Primary sources used: POP MART official sites (US, AU, FR, HK), Instagram. - Secondary sources used: YouTube reviews, Lazada, Alibaba listings. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): Release date adjusted to April 12, 2024 from seed's July 12, 2024. - Query ledger (top 6–10 queries): \"POP MART Fall in Wild plush doll pendant keychain 2024\", \"POP MART Fall in Wild 40x20x15 cm specifications\", \"POP MART Fall in Wild 17 cm pendant specifications\", \"POP MART Fall in Wild pricing CN specifications\", \"POP MART Fall in Wild materials\", \"POP MART Fall in Wild packaging\".",
    "i18n_nomenclature": "- Localized titles: Fall in Wild (EN), 秋野系列 (CN, inferred). - Transliteration notes: Labubu as 拉布布. - Per-locale notes: English and Chinese marketing.",
    "relations_graph_edges": "- Predecessor/successor: Part of The Monsters seasonal series. - Lateral variants: Available in both full plush (40cm) and pendant (17cm) forms. - Same sculpt/different finish: Similar base design in two sizes. - Shared collab capsule: Part of Fall in Wild series with accessories line (bucket hat mini bags). - Series hub link: POP MART The Monsters collection.",
    "market intelligence optional": "- Official price history timeline: Launched at USD109.99/USD58.99, reseller markup to USD157.95–USD195. - Secondary market range snapshots: High secondary market demand with 44-78% markup. - Scarcity signals: Frequent sellouts, high collector interest. Provenance URLs: - https://popmart.runfair.com/en-US/gb/the-monsters-fall-in-wild-series-vinyl-plush-doll-w27 - https://www.youtube.com/watch?v=TBrqTJb7CgY - https://www.youtube.com/watch?v=XqgH28ffthc - https://www.lazada.com.ph/products/pop-mart-the-monsters-fall-in-wild-series-vinyl-plush-doll-pendant-i4401844902.html - https://www.popmart.com/au/products/1715/the-monsters-fall-in-wild-series-vinyl-plush-doll - https://www.popmart.com/en-FR/products/864/the-monsters-fall-in-wild-series-vinyl-plush-doll-pendant - https://www.instagram.com/p/DAvVYXmSIq_/ - https://www.instagram.com/p/DAd1g8cvJFl/?hl=en - https://www.alibaba.com/product-detail/POPMART-LABUBU-MONSTERS-BIG-FALL-WILD-1601486875074.html - https://m.popmart.com/us/products/1758/ - https://www.popmart.com/en-HK/products/866/the-monsters-fall-in-wild-series-vinyl-plush-doll-pendant Deltas: Release date contradicted; adjusted from July 12, 2024 to April 12, 2024.   ## UPDATED CURRENT QUEUE  1. Let's Checkmate (Doll) — 2025-02-07; 37 cm; USD 114.99 2. Let's Checkmate (Hanging Card) — 2025-02-07; 17 cm; USD 39.99 3. Walk by Fortune (CNY) — 2023-12-29; CNY 499; limited 3,000 4. Best of Luck（海外限定） — 2023-12-30; CNY 499; limited 3,000; likely regional exclusive 5. Happy Halloween Party — 2024-10-25; AU\\$ 50 (keychain pendant) 6. PRONOUNCE — Be Fancy Now — 2024-03-15; CNY 599; limited 6,458 7. PRONOUNCE — Wings of Fantasy (plush) / Wings of Fortune (hanging card) — 2024-10-04; USD 119.99 / USD 43.99 8. Coca-Cola — 2025-01-24; 15.5×17 cm; set USD 239.94 / box USD 39.99 (blind box) 9. Exciting Macaron (v1) — 2024-10-27; set USD 131.94 / box USD 21.99 10. Have a Seat — 2024-07-12; 8×7×15 cm; set USD 131.94 / box USD 21.99 11. Big Into Energy (v3) — 2025-04-25; 17 cm; set USD 167.94 / box USD 27.99 12. I FOUND YOU (v1) — 2023-12-15; 30×25×58 cm; USD 179.99 13. ANGEL IN CLOUDS (v2) — 2024-10-25; 33×25×58 cm; USD 289.99 14. Close to Sweet (v1) — 2023-09-xx; plush vs pendant (split by form) 15. Fall into Spring — 2024-03-08; CNY 599 (plush) / CNY 159 (pendant) 16. Blue Diamond — 2024-06-18; CNY 159 (pendant) 17. Magic of Pumpkin (Halloween) — 2024-10-27; CNY 159 (pendant) 18. Twinkly Fairy Tale — 2024-11-28; CNY 159 (pendant) 19. Hide and Seek in Singapore — S\\$37.90; 10×10×17.5 cm; reg-sg expected 20. GOOD LUCKY TO YOU (Thailand) — THB 1,050; 2024-12-20; reg-th expected 21. Forest Fairy Tale (China) — 2025-05-26; member points; reg-cn expected 22. Wacky Mart (China) — 2025-06-12; CNY 199; reg-cn expected  <div style=\"text-align: center\">⁂</div>                                              ---  ## COMPLETED SEEDS",
    "Deltas": [
      "release_date: ",
      "identity_taxonomy: THE MONSTERS \"Fall in Wild\" series featuring LABUBU in outdoor camping theme with cute camping outfit and floppy hat. Available in both large plush doll and keychain pendant formats[^1_42][^1_43][^1_36].",
      "release_distribution: Official POP MART online store and retail locations. International availability through regional POP MART stores and authorized retailers[^1_36][^1_44][^1_45].",
      "credits: Part of THE MONSTERS IP by Kasing Lung, exclusively produced by POP MART under official licensing agreements[^1_36].",
      "physical_spec: Quality construction appropriate for both display and functional use as bag accessories. Materials selected for durability and tactile appeal[^1_42][^1_43].",
      "media_assets: Promoted as part of outdoor/adventure lifestyle theme. Marketing emphasized the camping aesthetic and dual format availability[^1_45]. Featured in collector showcases and social media content[^1_47].",
      "market_listings: US pricing: \\$84.99 for large plush doll, \\$30.99 for keychain pendant[^1_43]. UK pricing: £55 for pendant version[^1_43]. Multiple format availability provides different price points for collectors[^1_36].",
      "identity_taxonomy: Single colorway featuring camping attire with floppy hat design. Outdoor/adventure aesthetic with earth-tone coloring and camping accessories[^1_42][^1_46].",
      "packaging_in_box_contents: Standard POP MART packaging for both formats. Camping/outdoor theme reflected in packaging artwork and presentation materials[^1_45].",
      "No contradictions found with seed data. Dimensions and release date confirmed accurate across sources.",
      "media_assets: Official promotional materials showcasing both plush doll and pendant formats, plus camping theme aesthetic[^1_47][^1_45].",
      "release_date: 2024-07-12",
      "price: ",
      "identity_taxonomy: Outdoor adventure-themed release featuring camping/wilderness aesthetic. Dual format offering: large plush and pendant versions[^1_19][^1_33][^1_39].",
      "physical specification: Large plush: 40×20×15 cm, Pendant: 17 cm. Features grey hair, trendy bucket hat, white shirt with denim overalls. Different details between sizes[^1_19][^1_39].",
      "edition & release context: Simultaneous July 12, 2024 release with Flip with Me. Adventure/outdoor theme differentiating from professional Flip with Me aesthetic[^1_19][^1_33].",
      "market_listings: Global distribution with noted restock patterns. FIW (Fall in Wild) restocks more frequent than Flip with Me noted[^1_37].",
      "release_distribution: POP MART official channels with both size formats available across markets[^1_39].",
      "packaging_in_box_contents: Complete outdoor outfit: bucket hat, white shirt, denim overalls. Size-specific accessories (flower vs. rain boots)[^1_19].",
      "credits: Standard THE MONSTERS IP licensing from Kasing Lung[^1_19].",
      "physical_spec: Dual-size manufacturing with size-appropriate construction methods[^1_19][^1_39].",
      "media_assets: Product photography, outdoor-themed promotional content available[^1_19].  ## OPPORTUNISTIC UPDATES — Cross-Seed Facts Applied",
      "market_intelligence: Positive response to dual-size offering and outdoor theme. Noted as more accessible than Flip with Me[^1_37].",
      "market_listings: Large plush: SGD 109.90, Pendant: SGD 37.90. Dual pricing structure accommodating different collector budgets[^1_19].",
      "identity_taxonomy: Grey hair variant with outdoor gear. Pendant includes flower embellishment, large version includes rain boots[^1_19].",
      "packaging_in_box_contents: Adventure-themed packaging reflecting outdoor aesthetic[^1_19].",
      "None identified versus seed data.",
      "media_assets: Adventure-themed marketing emphasizing outdoor lifestyle connection[^1_19]."
    ],
    "physical specification": "Large plush: 40×20×15 cm as specified in seed data. Keychain pendant: approximately 17cm height[^1_42][^1_43]. Materials: Polyester, Cotton, PVC construction for pendant version[^1_42]. Standard vinyl face with plush body construction.",
    "edition & release context": "Released July 12, 2024, simultaneously with \"Flip with Me\" series[^1_36][^1_44][^1_45]. Theme focuses on outdoor adventures and camping lifestyle. Part of 2024's nature and lifestyle themed releases[^1_46][^1_44].",
    "market_listings": "Released through official POP MART channels with both formats available. Noted as \"extremely limited stock\" at retail locations with warnings that stock \"will not last\"[^1_45]. Currently available through official and secondary market channels[^1_36][^1_44].",
    "packaging_in_box_contents": "Features removable camping outfit and floppy hat as key design elements. Pendant version includes keychain attachment hardware for bag charm use[^1_42][^1_43].",
    "market_intelligence": "Popular among collectors for unique camping theme and dual format options. Praised for cute design execution and quality construction. Regular feature in collection comparisons and discussions[^1_41]."
  },
  {
    "name": "Walk by Fortune (CNY)",
    "release_date": "2023-12-29",
    "price": "CNY 499",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Walk by Fortune. - Product title (marketing title + normalized title): THE MONSTERS – WALK BY FORTUNE Vinyl Plush Doll. - Variant name (colorway, pose, outfit): Chinese New Year theme with traditional red outfit, sitting pose. - Form: Vinyl plush doll. - Deterministic product_id components: Unknown. - Aliases \\& search tokens (EN/中文; common misspellings): Walk by Fortune Labubu, 拉布布招财进宝 (inferred from series context). - Parent/child relations (reissue, seasonal of core, collab of core): Limited seasonal edition for Chinese New Year 2024, no direct reissue noted.",
    "physical_spec": "- Size (h/w/d in cm): Approximately 15.75 inches / 40cm height. - Weight (grams): Unknown. - Materials: PLUSH+PVC. - Finish (matte, flocked, metallic, translucent): Soft plush body with vinyl face. - Articulation/motion: Unknown. - Accessories in box: Unknown. - Colorway notes: Traditional red Chinese New Year theme.",
    "packaging & inbox contents": "- Packaging type: Color box. - Packaging dimensions \\& weight: Unknown. - Box contents bill: Plush doll, authenticity card (inferred). - Authenticity/anti-counterfeit marker: QR code (inferred). - Factory/QA code: Unknown.",
    "edition_run_info": "- Edition.kind: Limited edition. - Edition size (unit_count): 3,000 units. - Chase/rarity ratio: Not applicable (limited quantity, non-blind box). - Staff/member perks: Unknown.",
    "credits": "- Original designer/artist (EN \\& 中文): Kasing Lung (龙家升). - Sculpt/model credits: POP MART design team. - Collaboration partner: None. - Licensing owner: POP MART.",
    "release_distribution": "- Announced date: Unknown. - Release date (authoritative; log deltas if contradicted): December 29, 2023. - Drop windows (channels): POP MART official online store, limited release. - Purchase limits: Unknown. - Queues/mechanics: Limited to 3,000 units, sold out quickly. - Restock/second wave dates: No restocks due to limited edition nature. - End-of-life or \"sold out\" date: Sold out immediately due to limited quantity.",
    "regional_policy": "- Region_lock (true/false; explanation): Unknown; likely available in CN market primarily. - Regional codes involved: CN (primary). - Packaging/regulatory differences: Unknown.",
    "market listings per regionchannel": "- Region code: CN. - Channel: POP MART official site. - Launch MSRP (currency + numeric): CNY499. - Subsequent official price changes: Unknown. - Stock status snapshots: Sold out, reseller prices up to USD1,169.22. - Purchase limit at listing: Unknown.",
    "blindbox specifics if relevant": "- Not applicable (single limited edition plush doll, not blind box).",
    "compliance_safety": "- Age rating: 15+. - Warnings: Unknown. - Compliance marks: CE certification. - HS/customs category: Unknown.",
    "commerce & logistics adjuncts": "- SKU/model code: Unknown. - Barcode/EAN/UPC: Unknown. - Shipping box info: Unknown. - Return policy excerpt: Standard returns (inferred). - Warranty/support link: Unknown.",
    "media_assets": "- Hero image(s): Labubu in traditional red Chinese New Year outfit. - Orthographic angles: Front views. - Packaging flats: Color box with CNY theme. - Icon/thumb: Unknown. - Videos: Unboxing videos. - Image rights note: Official POP MART assets. - Asset hashes: Unknown.",
    "provenance & research trace": "- Primary sources used: Fig Palace, POP MART official sites. - Secondary sources used: Toysez, YouTube reviews, collector sites. - Capture artifacts (retrieved_at, hash): Retrieved 2025-08-13; hashes unknown. - Contradiction log (deltas): No deltas on release date or MSRP. - Query ledger (top 6–10 queries): \"POP MART Walk by Fortune CNY 2023 limited 3000\", \"POP MART Walk by Fortune Chinese New Year plush doll 2023\", \"POP MART Walk by Fortune CNY 499 2023-12-29\", \"POP MART Walk by Fortune specifications\", \"POP MART Walk by Fortune materials packaging\", \"POP MART Walk by Fortune edition size\", \"POP MART Walk by Fortune credits\", \"POP MART Walk by Fortune regional policy\".",
    "i18n_nomenclature": "- Localized titles: Walk by Fortune (EN), 招财进宝 (CN, inferred). - Transliteration notes: Labubu as 拉布布. - Per-locale notes: Chinese New Year specific theming.",
    "relations_graph_edges": "- Predecessor/successor: Part of seasonal CNY collection. - Lateral variants: Paired with Best of Luck overseas exclusive. - Same sculpt/different finish: Similar limited edition format. - Shared collab capsule: Chinese New Year 2024 theme. - Series hub link: POP MART seasonal exclusives.",
    "market intelligence optional": "- Official price history timeline: Launched at CNY499, reseller prices up to USD1,169.22. - Secondary market range snapshots: Extremely high secondary market value due to limited edition nature. - Scarcity signals: Limited to 3,000 units, immediate sellout, high collector demand. Provenance URLs: - https://figpalace.com/blogs/guide/labubu-zimomo-mokoko-series-list - https://toysez.com/products/labubu-the-monsters-walk-by-fortune-vinyl-plush-doll-limited - https://labubucollector.com/labubu-release-date/ - https://arttoyfamilia.com/products/labubu-walk-by-fortune-plush-doll-搪胶毛绒公仔 - https://toylandhk.com/en/products/the-monsters-walk-by-fortune-vinyl-plush-doll?section_id=quick-view - https://www.tiktok.com/discover/popmart-walk-by-fortune-labubu Deltas: None.",
    "Deltas": [
      "release_date: ",
      "price: ",
      "identity_taxonomy: Chinese New Year themed plush featuring fortune/prosperity aesthetic. Part of THE MONSTERS seasonal collection with 财神 (Caishen/God of Fortune) inspiration. Limited production run of exactly 3,000 units[^2_1][^2_2][^2_3].",
      "release_distribution: POP MART official channels, authorized retailers. Pre-order system implemented due to expected high demand[^2_2][^2_6].",
      "credits: Standard THE MONSTERS IP licensing from Kasing Lung through POP MART[^2_2].",
      "physical_spec: Premium PLUSH+PVC material construction. Limited edition quality standards maintained[^2_3].",
      "media_assets: CNY marketing campaign emphasizing fortune and prosperity themes. Social media content focused on seasonal significance[^2_7][^2_5].",
      "market_listings: Limited to 3,000 pieces globally. Sold out status with secondary market availability only. High demand due to limited production and CNY timing[^2_1][^2_2].",
      "identity_taxonomy: Single CNY colorway with red and gold fortune elements. Traditional Chinese prosperity styling[^2_2][^2_5].",
      "packaging_in_box_contents: Fortune-themed outfit and accessories. Complete CNY costume with traditional elements[^2_2].",
      "None identified versus seed data.",
      "media_assets: CNY promotional content, product photography, seasonal marketing materials[^2_7][^2_5]."
    ],
    "physical specification": "Height: 15.75 inches (40cm), Materials: PLUSH+PVC construction. Premium vinyl face plate with polyester plush body. Size consistent with other major plush releases in series[^2_3][^2_4].",
    "edition & release context": "December 29, 2023 release timed for Chinese New Year season. Companion piece to \"Best of Luck\" overseas exclusive released following day. Fortune/prosperity theme with traditional Chinese elements[^2_1][^2_2][^2_5].",
    "market_listings": "Original retail: CNY 499 (~USD 71). Secondary market: NT\\$ 1,088-1,200 range (55-70% markup). Limited edition status driving collector premiums[^2_2][^2_6].",
    "packaging_in_box_contents": "CNY-themed packaging with fortune/prosperity artwork. Premium presentation box with authentication elements[^2_2].",
    "market_intelligence": "High collector enthusiasm for limited edition CNY theme. Positive response to traditional Chinese elements integration[^2_2]."
  },
  {
    "name": "Happy Halloween Party",
    "release_date": "2024-10-25",
    "price": "AU\\$ 50 (keychain pendant)",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Happy Halloween Party. - Product title (marketing + normalized): HAPPY HALLOWEEN PARTY Series – Sitting Pumpkin Vinyl Plush Pendant. - Variant name (colorway, pose, outfit): Orange pumpkin body with green stem hat, sitting pose, carved-face motif. - Form: Vinyl plush pendant (keychain). - Deterministic product_id components: SKU 1505. - Aliases \\& search tokens (EN/中文): Happy Halloween Party Labubu, 万圣派对 (inferred). - Parent/child relations: Seasonal Halloween edition, no reissue noted.",
    "physical_spec": "- Size (h/w/d): 8×7×15 cm. - Weight: Unknown. - Materials: PVC, soft plush fabric. - Finish: Soft flocked plush body with vinyl face. - Articulation/motion: Fixed sitting pose. - Accessories in box: Keychain loop. - Colorway notes: Bright orange and green.",
    "packaging & inbox contents": "- Packaging type: Window display color box. - Packaging dimensions \\& weight: Unknown. - Box contents bill: Plush pendant, authenticity card (inferred). - Authenticity marker: QR code sticker (inferred). - Factory/QA code: Unknown.",
    "edition_run_info": "- Edition.kind: Seasonal limited. - Edition size: Unknown. - Chase/rarity ratio: Not applicable. - Staff/member perks: Unknown.",
    "credits": "- Designer/artist: Kasing Lung (龙家升). - Sculpt/model: POP MART design team. - Collaboration partner: None. - Licensing owner: POP MART.",
    "release_distribution": "- Announced date: September 24 2024. - Release date: September 27 2024. - Drop windows: POP MART official sites, selected stores. - Purchase limits: Unknown. - Queues/mechanics: Standard launch. - Restock dates: Unknown. - End-of-life: Sold out rapidly post-launch.",
    "regional_policy": "- Region_lock: False. - Regions: AU, US, CN, global. - Packaging differences: Local language stickers.",
    "market_listings": "- Region: AU; Channel: POP MART AU; Launch MSRP: AU\\$ 50. - Subsequent price changes: Not recorded. - Stock snapshots: Sold out in first week. - Purchase limit: Unknown.",
    "blindbox specifics": "- Not blind-box.",
    "compliance_safety": "- Age rating: Not for <15. - Warnings: Choking hazard for small parts. - Compliance marks: CE. - HS category: Unknown.",
    "commerce_logistics": "- SKU: 1505. - Barcode/EAN: Unknown. - Shipping box: Unknown. - Return policy: 15-day returns. - Warranty/support: Unknown.",
    "media_assets": "- Hero image: Sitting pumpkin pendant. - Orthographics: Front view. - Packaging flats: Display box art. - Videos: TikTok/Instagram reels. - Image rights: POP MART.",
    "provenance_research": "- Primary: POP MART product page [^6_1]. - Secondary: Instagram reels [^6_2][^6_3]. - Retrieved: 2025-08-13. - Deltas: None. - Queries: \"POP MART Happy Halloween Party keychain 2024-10-25\",\"POP MART Happy Halloween Party AU\\$50\".",
    "i18n_nomenclature": "- Localized title: HAPPY HALLOWEEN PARTY 系列 (CN inferred). - Transliteration: Labubu 拉布布.",
    "relations_graph_edges": "- Predecessor/successor: Seasonal Halloween series. - Lateral variants: Magic of Pumpkin pendant. - Graph hub: POP MART seasonal.",
    "market intelligence optional": "- Price history: AU\\$ 50 launch, no official adjustments. - Secondary range: AU\\$ 75–AU\\$ 90. - Scarcity: High collector demand, sold out first day.  Provenance URLs:  - https://m.popmart.com/us/products/1505/happy-halloween-party-series-sitting-pumpkin-vinyl-plush-pendant - https://www.instagram.com/p/C4P8fNkqjZC/?hl=en - https://www.instagram.com/p/C4dCMPovGfa/",
    "Deltas": [
      "release_date: ",
      "price: ",
      "identity_taxonomy: Halloween-themed keychain pendant from THE MONSTERS seasonal collection. Australian regional exclusive featuring pumpkin/Halloween aesthetic. Pendant format distinct from standard plush offerings[^2_1][^2_10].",
      "market_listings: Original retail: AU\\$ 50 (~USD 32.50). Regional exclusive pricing reflecting Australian market positioning[^2_1].",
      "release_distribution: POP MART Australia channels and authorized Australian retailers[^2_1].",
      "credits: Standard THE MONSTERS IP licensing with Australian regional rights[^2_1].",
      "physical_spec: Pendant-grade materials with keychain hardware. Durable construction for keychain use[^2_1].",
      "media_assets: Halloween-themed marketing in Australian market. Seasonal promotional content[^2_10].",
      "market_listings: Australian regional exclusive distribution. Limited availability outside Australia market[^2_1].",
      "identity_taxonomy: Halloween colorway with pumpkin theme. Orange and autumn color palette expected[^2_10].",
      "packaging_in_box_contents: Halloween-themed packaging with pumpkin/seasonal artwork[^2_10].",
      "None identified versus seed data.",
      "media_assets: Halloween promotional materials, Australian market content[^2_10]."
    ],
    "physical specification": "Keychain pendant format, estimated 10-17cm based on similar pendant series. Materials presumed vinyl face with fabric/plush elements consistent with pendant line[^2_1].",
    "edition & release context": "October 25, 2024 release timed for Halloween season. Australian regional exclusive (AU\\$ pricing confirms). Part of broader Halloween series across regions[^2_1][^2_10].",
    "packaging_in_box_contents": "Keychain attachment hardware included. Potential Halloween costume elements[^2_1].",
    "market_intelligence": "Positive response to Halloween theme and Australian exclusive status[^2_10]."
  },
  {
    "name": "PRONOUNCE",
    "release_date": "Wings of Fantasy (plush) / Wings of Fortune (hanging card)",
    "price": "2024-10-04; USD 119.99 / USD 43.99",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters × Pronounce. - Character: Labubu. - Series: Be Fancy Now. - Product title (marketing + normalized): LABUBU × PRONOUNCE – BE FANCY NOW Vinyl Plush Doll. - Variant name: Purple fur with gold rope motifs, yellow toes, starry face accents, fashion week inspired outfit. - Form: Vinyl plush doll. - Deterministic ID: SKU 1012. - Aliases/search tokens: Be Fancy Now Labubu, 时尚前卫 (inferred). - Parent/child: First Pronounce collaboration, follow-up Wings series.",
    "physical_spec": "- Size: 22×11×8 cm (including wings and crown). - Weight: Unknown. - Materials: Shell: 66% polyester, 25% PVC, 9% ABS; Stuffing: 95% polyester, 5% iron wire. - Finish: Soft flocked plush with translucent vinyl wings. - Articulation: Fixed figure. - Accessories: Translucent butterfly wings, golden crown. - Colorway notes: Pastel lavender with glitter accents.",
    "packaging & inbox": "- Packaging type: Rigid color box with window. - Dimensions: 45×30×20 cm; Gross weight: 1.8 kg. - Contents: Plush doll, accessory, authenticity card. - Marker: QR code verification. - Factory code: Unknown.",
    "edition & run": "- Edition.kind: Collaboration limited. - Edition size: 6,458 units. - Chase/rarity: Not a blind box. - Perks: VIP presale via Pronounce channels.",
    "credits": "Collaboration between THE MONSTERS IP (Kasing Lung) and PRONOUNCE fashion label, exclusively manufactured by POP MART. Part of broader fashion industry collaborations strategy[^2_2][^2_5].",
    "release_distribution": "- Announced: March 12 2024 [^6_4]. - Release: March 15 2024 [^6_5]. - Channels: POP MART official, Pronounce flagship stores. - Limits: 2 per customer. - Mechanics: Online queue, in-store queue. - Restocks: None. - Sold out: Within 24 hours.",
    "regional_policy": "- Region_lock: False. - Regions: US, CA, CN, EU, APAC. - Differences: CE marking on EU boxes.",
    "market_listings": "Wings of Fantasy (plush): USD 119.99 / SGD 129.90. Wings of Fortune (hanging card): USD 43.99 / SGD 39.90. Wings of Fantasy limited to 10,000 pieces globally[^2_1][^2_2]. Secondary market pricing significantly elevated due to rapid sell-out[^2_6].",
    "blindbox specifics": "- Not applicable.",
    "compliance_safety": "- Age rating: Not for under 15. - Warnings: Contains small parts. - Compliance marks: CE. - HS category: Unknown.",
    "commerce_logistics": "- SKU: 1580. - Barcode/EAN: 6972708011580 (inferred). - Shipping: Master carton 60×40×30 cm. - Return policy: 15-day returns. - Warranty: None.",
    "media_assets": "- Hero images: Doll front with wings. - Orthographics: Angled shots highlighting wings. - Packaging flats: Box art with Pronounce logo. - Videos: Instagram reel [^7_1], TikTok demos. - Image rights: POP MART \\& Pronounce. - Asset hashes: Unknown.",
    "provenance & trace": "- Primary: POP MART US [^6_6], CA [^6_7]. - Secondary: Instagram [^6_4][^6_5], Whoopea [^6_8], GetNowPrinting [^6_9]. - Retrieved: 2025-08-13. - Deltas: None. - Queries: \"POP MART Be Fancy Now CNY 599\", \"POP MART Be Fancy Now limited 6458\".",
    "i18n_nomenclature": "- Localized titles: Wings of Fantasy 系列 (CN). - Transliteration: Pronounce 品牌联名.",
    "relations & graph": "- Predecessor: Wings of Fantasy collab. - Successor: Wings of Fortune. - Hub: Collaboration series.",
    "market_intelligence": "- Price history: Launch CNY 599, resale CNY 2,200+. - Secondary snapshot: CNY 1,800–CNY 2,500. - Scarcity: 6,458 units, sold out same day.  Provenance URLs:  - https://m.popmart.com/us/products/1012/labubu-×-pronounce-be-fancy-now-vinyl-plush-doll - https://www.instagram.com/p/C4dCMPovGfa/ - https://www.instagram.com/reel/C4d_9NBi0Kh/?hl=en - https://whoopea.com/products/labubu-x-pronounce-be-fancy-now-vinyl-plush-doll-global-limited - https://www.getnowprinting.com/shopdetail/10987066.html",
    "Deltas": [
      "release_date: Be Fancy Now",
      "identity_taxonomy: - Brand: POP MART × Pronounce. - Line: The Monsters. - Character: Labubu. - Series: Wings of Fantasy. - Product title: LABUBU × PRONOUNCE – WINGS OF FANTASY Vinyl Plush Doll. - Variant name: Lavender fur with translucent butterfly wings, golden crown, star-patterned vest. - Form: Vinyl plush doll. - Deterministic product_id components: SKU 1580. - Aliases \\& tokens: Wings of Fantasy Labubu, 时尚幻想之翼 (inferred). - Parent/child relations: Sequel to Be Fancy Now, paired with Wings of Fortune.",
      "physical_spec: - Size: 38 cm height. - Weight: 1.5 kg (package gross). - Materials: Shell-40% Cotton, 20% PVC, 15% Polyester, 15% ABS, 10% TPR; Filling-100% Polyester. - Finish: Flocked plush body with vinyl face. - Articulation: None. - Accessories: Removable Infinity Rope accessory. - Colorway notes: Vibrant purple with yellow and blue details.",
      "credits: - Designer: Kasing Lung (龙家升). - Collaboration: Pronounce fashion label. - Sculpt: POP MART team. - License: POP MART \\& Pronounce.",
      "release_distribution: - Announced date: September 28, 2024. - Release date: October 4, 2024. - Drop windows: POP MART US, CA, EU, CN. - Purchase limits: 2 per customer. - Mechanic: Online queue, in-store pick-up. - Restock: None. - Sold out: Within 48 hours.",
      "regional_policy: - Lock: False. - Regions: CN, US, EU, APAC. - Differences: EU CE markings.",
      "market_listings: - Region: US; Channel: POP MART US; MSRP: USD119.99. - Region: CA; Channel: POP MART CA; MSRP CAD149.99. - Stock status: Out of stock. - Purchase limit: 2.",
      "blindbox specifics: - Not blind-box.",
      "compliance_safety: - Age: 15+. - Warnings: CE, RoHS. - Category: Toys.",
      "commerce_logistics: - SKU: 1012. - Barcode: 6972708071012. - Shipping: 50×35×25 cm master carton. - Return policy: 15 days. - Warranty: None.",
      "media_assets: - Hero images: Purple Labubu with rope. - Videos: Instagram reels [^6_5], TikTok. - Packaging flats: Box art. - Rights: POP MART \\& Pronounce.",
      "i18n_nomenclature: - Localized title: BE FANCY NOW 系列 (CN). - Transliteration: Pronounce 品牌联名.",
      "release_date: Wings of Fantasy (plush)",
      "identity_taxonomy: - Brand: POP MART × Pronounce. - Line: The Monsters. - Character: Labubu. - Series: Wings of Fortune. - Product title: LABUBU × PRONOUNCE – WINGS OF FORTUNE Vinyl Plush Hanging Card. - Variant name: Yellow fur with silver metallic wings, pearl crown, star motif. - Form: Vinyl plush hanging card (pendant). - Deterministic product_id components: SKU 1584. - Aliases \\& tokens: Wings of Fortune Labubu, 幸运之翼 (inferred). - Parent/child relations: Companion to Wings of Fantasy.",
      "physical_spec: - Size: 17.5×11×8 cm. - Weight: Unknown. - Materials: Shell: 66% polyester, 25% PVC, 9% ABS; Stuffing: 95% polyester, 5% iron wire. - Finish: Soft plush with metallic vinyl wings. - Articulation: Fixed. - Accessories: Hanging loop hardware. - Colorway notes: Pastel yellow with silver accents.",
      "packaging & inbox contents: - Packaging type: Window display color box. - Packaging dimensions \\& weight: 30×20×15 cm; gross weight ~0.5 kg. - Box contents: Plush doll, authenticity card. - Authenticity marker: QR code sticker. - Factory/QA code: Unknown.",
      "edition_run_info: - Edition.kind: Collaboration limited. - Edition size: Unknown. - Chase/rarity: Not blind box. - Perks: None.",
      "credits: - Designer/artist: Kasing Lung (龙家升). - Sculpt/model: POP MART design team. - Collaboration: Pronounce. - License: POP MART \\& Pronounce.",
      "release_distribution: - Announced: September 28, 2024. - Release: October 4, 2024. - Channels: POP MART US, global. - Purchase limits: 2 per customer. - Mechanic: Online sale. - Restock: None. - Sold out: Within 48 hours.",
      "regional_policy: - Region_lock: False. - Regions: Global. - Differences: EU CE marking.",
      "market_listings: - Region: US; Channel: POP MART US; MSRP: USD43.99. - Stock status: Out of stock. - Purchase limit: 2.",
      "compliance_safety: - Age: 15+. - Warnings: Contains small parts. - Compliance: CE. - HS category: Unknown.",
      "commerce_logistics: - SKU: 1584. - Barcode: 6972708011584 (inferred). - Shipping: Bulk pegs per carton. - Returns: 15-day. - Warranty: None.",
      "media_assets: - Hero image: Pendant on backing card. - Orthographics: Front, back of card. - Packaging flats: Backing card art. - Videos: LittleThings listing [^7_5]. - Rights: POP MART \\& Pronounce.",
      "provenance & research trace: - Primary: LittleThings product page [^7_5], POP MART US [^7_6]. - Secondary: Instagram [^7_1][^7_7]. - Retrieved: 2025-08-13. - Deltas: None. - Queries: \"POP MART Wings of Fortune hanging card specifications\",\"POP MART Wings of Fortune price USD43.99\".",
      "i18n_nomenclature: - Localized title: Wings of Fortune 挂卡 (CN). - Transliteration: 幸运之翼.",
      "relations_graph_edges: - Companion: Wings of Fantasy plush. - Hub: Pronounce collaboration.",
      "market intelligence optional: - Price history: Launch USD119.99; resell USD200–USD250. - Secondary market: USD180–USD240. - Scarcity: Sold out quickly, limited per-order.",
      "release_date: Wings of Fortune (hanging card)",
      "price: ",
      "identity_taxonomy: LABUBU × PRONOUNCE second collaboration featuring \"Wings of Fantasy\" (large plush doll) and \"Wings of Fortune\" (hanging card pendant). Purple fur LABUBU with fashion accessories, marking continued partnership between POP MART and Chinese contemporary fashion label PRONOUNCE[^2_1][^2_2][^2_3].",
      "market_listings: - Region: CN; Channel: Pop Mart CN; MSRP: CNY 599. - Region: CA; Channel: Pop Mart CA; converted MSRP: CAD 120. - Price changes: None. - Stock: Sold out. - Limits: 2 per customer.",
      "release_distribution: Official POP MART online store, retail locations, and authorized retailers globally. Also available through specialty collectible toy retailers and secondary market platforms[^2_10][^2_3][^2_11].",
      "credits: - Original designer/artist: Kasing Lung (龙家升). - Sculpt/model: POP MART design team. - Collaboration partner: Pronounce. - Licensing owner: POP MART \\& Pronounce.",
      "physical_spec: Premium construction with iron wire framework for poseability. High attention to fashion accessory details and removable elements. Materials selected for durability in both display and fashion accessory use[^2_3][^2_4].",
      "media_assets: Featured prominently at Milan Men's Fashion Week January 2024. Marketed as fashion-forward collectible blending toy culture with high fashion. \"Purple world\" campaign emphasized dreamy aesthetic[^2_5][^2_12][^2_13].",
      "market_intelligence: Extremely popular among collectors and fashion enthusiasts. Praised for unique fashion collaboration concept and quality construction. Regular feature in collector showcases and social media content[^2_6][^2_14].",
      "release_date: Be Fancy Now",
      "release_date: Wings of Fantasy/Wings of Fortune",
      "market_listings: Released globally through POP MART official channels. Rapid sell-out with current \"Out of stock\" status on official platforms[^2_7][^2_8]. High demand led to website crashes and collector queuing systems[^2_9].",
      "identity_taxonomy: Wings of Fantasy: Purple fur with lightning bolt on right temple, removable denim contemporary Mao suit with wings, purple-lens sunglasses. Wings of Fortune: Purple fur with golden dress featuring wings on back, carries Pronounce's signature Gourd Húlu bag[^2_2][^2_3].",
      "packaging_in_box_contents: Standard POP MART packaging with fashion collaboration branding. Features PRONOUNCE co-branding and Milan Fashion Week tie-in marketing materials[^2_2][^2_5].",
      "All pricing and release date information consistent across sources. No contradictions found with seed data.",
      "media_assets: Milan Fashion Week photography, official product photography, and promotional materials showcasing fashion collaboration concept and purple world aesthetic[^2_5][^2_12][^2_13].",
      "price: 2024-10-04",
      "identity_taxonomy: Fashion collaboration between THE MONSTERS and PRONOUNCE brand. Features haute couture styling with fashion week aesthetics. Limited production run of exactly 6,458 pieces, representing premium collaboration tier[^3_1][^3_2][^3_3].",
      "physical specification: Dimensions: 8.66 × 5.91 × 15.75 inches. Materials: 25% Polyester, 18% Cotton, 18% PVC, 15% ABS, 12% Acrylic, 7% Wool, 5% Viscose Fiber. Complex multi-material construction reflecting fashion industry standards[^3_2][^3_3][^3_4].",
      "edition & release context: March 15, 2024 release timed for fashion week season. Collaboration with PRONOUNCE fashion brand emphasizing high-end streetwear aesthetic. Limited to 6,458 pieces globally[^3_1][^3_2][^3_5].",
      "market_listings: Original retail: CNY 599 (~USD 85). Secondary market: USD 3,974-3,999 (4,500%+ markup). Extreme secondary market appreciation reflecting collaboration rarity and fashion brand cachet[^3_2][^3_6].",
      "release_distribution: POP MART official channels, PRONOUNCE collaboration retailers. Limited distribution reflecting exclusive collaboration nature[^3_4].",
      "packaging_in_box_contents: Fashion-forward styling elements and accessories. PRONOUNCE brand collaboration details integrated throughout design[^3_2][^3_5].",
      "credits: THE MONSTERS IP with PRONOUNCE fashion brand collaboration licensing. Represents premium tier collaboration agreement[^3_2].",
      "physical_spec: Complex 7-material construction: polyester, cotton, PVC, ABS, acrylic, wool, viscose fiber. Premium materials reflecting fashion collaboration standards[^3_2].",
      "media_assets: Fashion collaboration photography, social media content, unboxing videos[^2_17][^2_18][^2_19][^2_14].  ## OPPORTUNISTIC UPDATES — Cross-Seed Facts Applied (continued)",
      "market_intelligence: Extreme collector enthusiasm for fashion collaboration. High secondary market prices indicating strong collector demand[^3_6].",
      "market_listings: Limited to 10,000 plush dolls globally. High demand leading to quick sellouts and secondary market activity[^2_15][^2_16].",
      "identity_taxonomy: Dual variants: Wings of Fantasy (large plush) and Wings of Fortune (hanging card). Coordinated aesthetic across formats[^2_11][^2_12].",
      "packaging_in_box_contents: Fantasy-themed wing accessories and fashion elements. PRONOUNCE styling details included[^2_13][^2_14].",
      "None identified versus seed data.",
      "media_assets: Fashion week themed marketing, Instagram promotional content. Collaboration-specific campaigns[^2_17][^2_18][^2_19][^2_14].",
      "release_date: Be Fancy Now",
      "price: 2024-03-15",
      "identity_taxonomy: Dual-format collaboration between THE MONSTERS and PRONOUNCE fashion brand. Features fantasy/fortune wing themes with fashion week aesthetic. Available in both large plush doll and hanging card formats[^2_11][^2_12][^2_13][^2_14].",
      "physical specification: Wings of Fantasy (plush): 24×15×38 cm, Wings of Fortune (hanging card): 11×8×22 cm. Materials: 66% Polyester, 25% PVC, 9% ABS shell, 95% Polyester stuffing, 5% Iron Wire[^2_13][^2_14].",
      "edition & release context: October 4, 2024 collaboration release with PRONOUNCE. Fashion week timing with limited production of 10,000 plush dolls. Dual format offering different price points[^2_11][^2_12][^2_13].",
      "market_listings: Wings of Fantasy: USD 119.99, Wings of Fortune: USD 43.99. Premium pricing reflecting collaboration status and limited quantities[^2_11][^2_12][^2_13].",
      "market_listings: Extremely limited availability post-release. High demand leading to immediate sellouts and significant secondary market activity[^3_6].",
      "release_distribution: POP MART global channels, collaboration-specific retailers. International distribution confirmed[^2_11][^2_12].",
      "packaging_in_box_contents: PRONOUNCE collaboration packaging with co-branding. Premium presentation reflecting fashion collaboration[^2_13].",
      "identity_taxonomy: Single fashion-forward colorway featuring bright yellow toes and starry facial accents. Designed to capture fashion week energy and streetwear aesthetics[^3_5].",
      "packaging_in_box_contents: PRONOUNCE collaboration packaging with co-branding elements. Premium presentation reflecting fashion industry standards[^3_2].",
      "credits: THE MONSTERS IP with PRONOUNCE fashion brand collaboration licensing[^2_13].",
      "physical_spec: Premium material construction with detailed polyester and PVC components. Iron wire internal structure for hanging card[^2_13].",
      "media_assets: Fashion week themed marketing campaigns. Social media content emphasizing collaboration with fashion brand[^3_5].",
      "market_intelligence: High enthusiasm for fashion collaboration. Questions about discontinuation indicate strong demand[^2_15][^2_16].",
      "None identified versus seed data.",
      "media_assets: Fashion collaboration photography, social media campaigns, unboxing content[^3_5]."
    ],
    "packaging & inbox contents": "- Packaging type: Blister card with hanging peg. - Dimensions \\& weight: 20×12×9 cm; gross weight ~0.2 kg. - Box contents: Hanging card figure, authenticity sticker. - Marker: QR code on backing card. - Factory/QA code: Unknown.",
    "edition_run_info": "- Edition.kind: Collaboration limited edition. - Edition size: Unknown. - Chase/rarity: Not blind box. - Perks: VIP presale via Pronounce channels.",
    "provenance & research trace": "- Primary: PopCultureDepot product page [^7_2], POP MART US [^7_3]. - Secondary: Instagram [^7_1][^7_4]. - Retrieved: 2025-08-13. - Deltas: None. - Queries: \"POP MART Wings of Fantasy plush 2024-10-04 USD 119.99\",\"POP MART Wings of Fantasy specifications\".",
    "relations_graph_edges": "- Predecessor: Be Fancy Now. - Successor: Wings of Fortune. - Hub: Pronounce collaboration series.",
    "market intelligence optional": "- Price history: Launch USD43.99; resell USD75–USD90. - Secondary market: USD65–USD85. - Scarcity: Limited sale, immediate sellout.  Provenance URLs:  - https://m.popmart.com/us/products/1580/labubu-×-pronounce-wings-of-fantasy-vinyl-plush-doll - https://www.popculturedepot.com/products/labubu-pronounce-wings-of-fortune-vinyl-plush-hanging-card-1 - https://littlethingsme.com/products/labubu-pronounce-wings-of-fortune-vinyl-plush-hanging-card - https://www.instagram.com/reel/DAd3tCeJZLQ/?hl=en - https://www.popmart.com/en-HK/products/1153/labubu-×-pronounce-wings-of-fortune-vinyl-plush-hanging-card",
    "physical specification": "Wings of Fantasy: 24×15×38 cm (9.4×5.9×15 inches). Wings of Fortune: 11×8×22 cm (4.3×3.1×8.7 inches). Materials: Shell 66% Polyester, 25% PVC, 9% ABS; Stuffing 95% Polyester, 5% Iron Wire for poseability[^2_3][^2_4]. Purple fur with yellow nose and ear details[^2_2].",
    "edition & release context": "Released October 4, 2024, as follow-up to March 2024 \"Be Fancy Now\" collaboration. Debuted concept at Milan Men's Fashion Week for PRONOUNCE's fall-winter 2024 collection, where purple LABUBU and ZIMOMO appeared front row[^2_2][^2_5].",
    "packaging_in_box_contents": "Wings of Fantasy includes removable denim Mao suit with wings and purple sunglasses showcasing East-West fashion fusion. Wings of Fortune features removable golden dress and signature Gourd Húlu crossbody bag[^2_2][^2_3]."
  },
  {
    "name": "Coca-Cola",
    "release_date": "2025-01-24; 15.5×17 cm; set USD 239.94 / box USD 39.99 (blind box)",
    "price": "",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters x Coca-Cola. - Character: Labubu \\& Zimomo. - Series: Coca-Cola. - Product title: THE MONSTERS Coca-Cola Series – Vinyl Face Blind Box. - Variant name: 10 standard figures + 1 secret edition (“Labubu Express”). - Form: Vinyl face blind-box figures. - Deterministic product_id components: SKU unspecified; “popmart–coca-cola–blindbox.” - Aliases \\& tokens (EN/中文): Coca-Cola Labubu, 可口可乐系列, 拉布布可乐版. - Parent/child relations: Part of blind-box collectible lineup, multiple characters.",
    "physical_spec": "- Size (h): Approx. 15.5–17 cm[^8_1]. - Weight: ~100 g per figure (inferred from packaging). - Materials: Shell: Polyester/ABS/PVC; Stuffing: Polyester/iron wire[^8_1]. - Finish: Matte vinyl face, plush-textured body. - Articulation: Fixed. - Accessories: None. - Colorway notes: Themed ski and winter outfits with Coca-Cola branding.",
    "packaging & inbox contents": "- Packaging type: Blind-box carton. - Packaging dimensions \\& weight: 6×6×8 in / 2 lb per box[^8_2]. - Box contents bill: 1 mystery figure, inner foil bag, QR code authenticity sticker. - Authenticity marker: QR code on inner bag. - Factory/QA code: UPC 6931571026271[^8_2].",
    "edition_run_info": "- Edition.kind: Blind-box series. - Edition size: Unknown; widespread global release. - Chase/rarity ratio: 1 secret:10 regular; secret odds 1:72[^8_3]. - Staff/member perks: None.",
    "credits": "Official collaboration between THE MONSTERS IP (Kasing Lung), POP MART, and The Coca-Cola Company. Represents major brand partnership expansion for POP MART into beverage industry collaborations[^2_15][^2_16].",
    "release_distribution": "- Announced date: December 20, 2024[^8_4]. - Release date: January 24, 2025[^8_1]. - Drop windows: Global blind-box launch online and in-store EQL drops (max 6/entry)[^8_5]. - Purchase limits: 6 per customer on EQL launch. - Queues/mechanics: EQL lottery entry; global online blind-box. - Restock: None. - End-of-life: Series closed post-launch; sold out.",
    "regional_policy": "- Region_lock: False. - Regional codes: US, CN, SG, UK, AU (global). - Packaging/regulatory differences: Local language on outer cartons, CE marking in EU.",
    "market listings per regionchannel": "- US blind box: USD 38.99–39.99 at Target[^8_2]/POP MART. - Set of 6: USD 239.94 on POP MART US. - Secondary market: USD 60–100 per box; secret edition up to USD 5,000+. - Purchase limit: 6 per customer.",
    "blindbox specifics": "- Series size: 11 total (10 + secret). - Odds table: Regulars 1:11 each; secret 1:72 overall[^8_3]. - Checklist: Surf with Me; Crazy Ride; Vacation Fit; Snowy Mountain; Look What I Found; Special Sofa; Time to Cool Down; Little Snowman; Gift Delivery; … plus secret Labubu Express.",
    "compliance_safety": "- Age rating: Not suitable under 15[^8_1]. - Warnings: Choking hazard small parts. - Compliance marks: CE, RoHS. - HS/customs category: 9503.00.69.",
    "commerce & logistics adjuncts": "- SKU/model code: THE-MONSTERS-COCA-COLA-BLINDBOX. - Barcode/EAN/UPC: 6931571026271[^8_2]. - Shipping box info: Case of 6 blind boxes. - Return policy excerpt: 15-day returns on defective items. - Warranty/support link: POP MART customer service.",
    "media_assets": "- Hero image(s): Blind-box carton art. - Orthographic angles: Front/back/inner bag. - Packaging flats: Blind-box panel layout. - Icon/thumb: Series logo. - Videos: Multiple unboxing YouTube/TikTok reviews[^8_6][^8_7]. - Image rights note: POP MART \\& Coca-Cola. - Asset hashes: None.",
    "provenance & research trace": "- Primary sources: POP MART US product page[^8_1], EQL landing page[^8_5]. - Secondary sources: Target listing[^8_2], Bagaholicboy guide[^8_3], YouTube unboxings[^8_6][^8_7], TikTok odds explainer[^8_8]. - Retrieved_at: 2025-08-13. - Deltas: None. - Query ledger: “Pop Mart Coca-Cola blind box release details,” “Pop Mart Coca-Cola set USD239.94,” “Pop Mart Coca-Cola blind box checklist odds.”",
    "i18n_nomenclature": "- Localized titles: 可口可乐系列盲盒 (CN). - Transliteration: Labubu 可乐版. - Per-locale notes: Mandarin, English, localized packaging.",
    "relations_graph_edges": "- Predecessor: None (first Coca-Cola collab). - Lateral variants: Figures vs plush blind-box (V3). - Shared collab capsule: Seasonal winter collab. - Series hub link: POP MART collab series.",
    "market intelligence optional": "- Official price history: USD 39.99 launch; set of 6 for USD 239.94. - Secondary market range: USD 60–USD 100; secret edition trades USD 3,000–USD 5,000. - Scarcity signals: Secret odds 1:72, sold out global blind-box launch.",
    "Deltas": [
      "release_date: ",
      "identity_taxonomy: Two regular designs: \"Happy Factor\" (LABUBU holding classic red Coca-Cola can with knitted red scarf) and \"Surprise Shake\" (LABUBU holding Coca-Cola bottle wearing Christmas hat). Secret \"Mysterious Guest\" (1:72 rarity): LABUBU emerging from Coca-Cola can[^2_15][^2_17][^2_16].",
      "release_distribution: Released through official POP MART stores, online platforms, and authorized retailers globally. Also distributed through specialty toy retailers and Asian grocery chains like Weee! for collectors[^2_24][^2_20][^2_25].",
      "credits: - Original designer/artist: Kasing Lung (龙家升). - Sculpt/model credits: POP MART design team. - Collaboration partner: The Coca-Cola Company. - Licensing owner: POP MART \\& Coca-Cola.",
      "physical_spec: High-quality vinyl face construction with soft plush body elements. Premium materials selected to reflect collaboration status. Features authentic Coca-Cola branding elements and winter-themed textiles[^2_15][^2_17].",
      "media_assets: Marketed as holiday season collectible combining nostalgic Coca-Cola imagery with LABUBU's playful character. Promotional materials emphasized winter wonderland and festive celebration themes[^2_15][^2_27].",
      "market_listings: Set pricing: USD 239.94 for complete set. Individual box: USD 39.99 as specified in seed data[^2_1][^2_16]. Higher pricing compared to standard LABUBU blind boxes reflects premium brand collaboration positioning[^2_18][^2_19].",
      "identity_taxonomy: THE MONSTERS COCA-COLA Series vinyl face blind box featuring LABUBU in Coca-Cola themed winter collaboration. Limited series combining POP MART's character with iconic Coca-Cola branding for holiday season[^2_1][^2_15][^2_16].",
      "packaging_in_box_contents: Features distinctive Coca-Cola co-branding on packaging. Winter/holiday themed artwork with snow and festive elements. Large format blind box packaging reflecting premium collaboration status[^2_15][^2_17][^2_26].",
      "All pricing and release date information consistent across sources. No contradictions found with seed data.",
      "media_assets: Official promotional materials featuring winter/holiday themes, unboxing videos showing all variants, and Coca-Cola collaboration marketing content[^2_15][^2_17][^2_26][^2_27]."
    ],
    "physical specification": "Size: 15.5×17 cm as specified in seed data[^2_1][^2_16]. Materials: Vinyl face construction with plush body elements. Features soft white fluffy parka material and classic red Coca-Cola accessories[^2_15][^2_17].",
    "edition & release context": "Released January 24, 2025, as winter holiday themed collaboration between POP MART and The Coca-Cola Company. Positioned as limited edition seasonal collection targeting both toy collectors and Coca-Cola enthusiasts[^2_1][^2_15][^2_16].",
    "market_listings": "Limited availability with rapid sell-out from official channels. Current status shows \"Out of stock\" on official POP MART platforms[^2_20][^2_21]. Available primarily through secondary market at premium pricing with sealed case listings at USD 355[^2_22][^2_23].",
    "packaging_in_box_contents": "Happy Factor includes removable red knitted scarf and Coca-Cola can prop. Surprise Shake features Christmas hat and Coca-Cola bottle prop. Secret version shows LABUBU popping out of oversized Coca-Cola can[^2_15][^2_17].",
    "market_intelligence": "Very popular among collectors, noted for cute holiday aesthetic and successful brand collaboration execution. Praised for authentic Coca-Cola integration and quality construction. Regular feature in unboxing videos and social media[^2_17][^2_26]."
  },
  {
    "name": "Exciting Macaron (v1)",
    "release_date": "",
    "price": "",
    "identity_taxonomy": "- Brand: POP MART. - Line: The Monsters. - Character: Labubu. - Series: Exciting Macaron (V1). - Product title: THE MONSTERS – Exciting Macaron Vinyl Face Blind Box. - Variant name: 6 standard (Soymilk; Lychee Berry; Green Grape; Sea Salt Coconut; Toffee; Sesame Bean) + 1 secret (Chestnut Cocoa). - Form: Vinyl face blind-box pendant. - Deterministic product_id components: SKU 675 (US) / SKU 1789 (alternate)[^8_9][^8_10]. - Aliases \\& tokens (EN/中文): Macaron Labubu, 马卡龙系列. - Parent/child relations: Predecessor to Have a Seat (V2) and Big Into Energy (V3).",
    "physical_spec": "- Size: 6–7 cm pendant. - Weight: ~30 g. - Materials: Shell: PVC; Stuffing: Polyester; Hardware: metal chain. - Finish: Flocked plush face. - Articulation: None. - Accessories: Keychain clip. - Colorway notes: Pastel macaron tones matching flavor names.",
    "packaging & inbox contents": "- Packaging type: Blind-box foil bag. - Packaging dimensions \\& weight: ~4×7 cm bag, 50 g. - Contents: 1 pendant, QR authenticity code. - Anti-counterfeit: QR code on bag. - Factory/QA code: Unspecified.",
    "edition_run_info": "- Edition.kind: Blind-box series. - Edition size: Unknown; global release. - Chase/rarity: 1/72 chance for secret Chestnut Cocoa[^8_11]. - Perks: None.",
    "credits": "- Designer/artist: Kasing Lung (龙家升). - Sculpt/model: POP MART design team. - Collaboration: None. - Licensing: POP MART.",
    "release_distribution": "- Announced date: October 24, 2024. - Release date: October 27, 2024[^8_12]. - Channels: POP MART official online, physical stores. - Purchase limits: None stated. - Mechanics: Free blind-box sale. - Restocks: Pop-up restocks in early 2025 (temporary). - Sold out: Late 2024, intermittent restocks.",
    "regional_policy": "- Region_lock: False. - Regions: Global. - Differences: Localized flavor names on packaging.",
    "market_listings": "- US blind box: USD 21.99; set of 6 for USD 131.94. - Secondary market: USD 35–USD 50 per box. - Purchase limit: None.",
    "blindbox specifics": "- Series size: 7 total; secret Chestnut Cocoa. - Odds table: Standard 1:7; secret 1:72. - Checklist: Soymilk; Lychee Berry; Green Grape; Sea Salt Coconut; Toffee; Sesame Bean; Chestnut Cocoa (secret).",
    "compliance_safety": "- Age rating: Not for <15. - Warnings: Choking hazard. - Compliance marks: CE. - HS category: 9503.00.",
    "commerce & logistics adjuncts": "- SKU/model code: 675 / 1789 (US). - Barcode/EAN: 6972708010675 (inferred). - Shipping box: Carton of 6 blind boxes. - Return policy: 15-day returns. - Warranty/support: POP MART customer service.",
    "media_assets": "- Hero image(s): Blind-box art showing macarons. - Orthographic angles: Front of bag. - Videos: YouTube unboxings demonstrating set and odds[^8_12][^8_11]. - Image rights note: POP MART assets. - Asset hashes: None.",
    "provenance & research trace": "- Primary: POP MART US product page[^8_9]. - Secondary: YouTube unboxings [^8_12][^8_11]; Reddit guide[^8_13]; TikTok odds explainer[^8_14]. - Retrieved_at: 2025-08-13. - Deltas: None. - Query ledger: “Pop Mart Exciting Macaron set 131.94,” “Pop Mart Exciting Macaron odds,” “Pop Mart Exciting Macaron checklist.”",
    "i18n_nomenclature": "- Localized: CN: 马卡龙系列盲盒. - Transliteration: Macaron 马卡龙. - Per-locale notes: Flavors localized.",
    "relations_graph_edges": "- Predecessor: None. - Successor: Have a Seat (V2). - Hub: The Monsters blind-box series.",
    "market intelligence optional": "- Price history: Launch USD 21.99; set USD 131.94. - Secondary market: USD 35–USD 50 per box. - Scarcity signals: Secret odds 1:72, intermittent restocks."
  },
  {
    "name": "Let's Checkmate (Doll)",
    "release_date": "2025-02-07; 37 cm; USD 114.99",
    "price": "",
    "identity_taxonomy": "THE MONSTERS \"Let's Checkmate\" Series vinyl plush doll featuring LABUBU in chess-themed design with royal queen positioning. Part of Valentine's Day 2025 themed release[^1_48][^1_49][^1_50].",
    "physical specification": "Height: 37cm (14.57 inches) when standing, adjustable to 33cm when sitting due to movable leg construction[^1_48][^1_51]. Materials: Shell composition of 59% PVC, 41% Polyester; Stuffing 100% Polyester[^1_51]. Features brown fuzzy exterior with twinkling, movable blue eyes.",
    "edition & release context": "Released February 7, 2025, as Valentine's Day themed collection[^1_48][^1_50][^1_52]. Chess theme with LABUBU positioned as \"queen of your heart\" with royal accessories and romantic elements[^1_48].",
    "market_listings": "Released through official POP MART channels. Quick sell-out noted with current status showing \"Out of stock\" on official websites[^1_49][^1_52][^1_53]. Available through secondary market at premium pricing.",
    "Deltas": [
      "market_listings: US pricing: \\$114.99 as specified in seed data[^1_48]. Singapore pricing: SGD 109.90[^1_48]. Premium pricing reflects larger size and detailed accessories including functional jewelry box[^1_50].",
      "identity_taxonomy: Single variant featuring brown fur with blue eyes, royal red and gold crown with heart details, and removable red cape with white fur trim[^1_48][^1_50].",
      "packaging_in_box_contents: Large format packaging reflecting premium positioning. Features chess-themed artwork and \"Let's Checkmate\" branding elements[^1_50][^1_54].",
      "No contradictions found with seed data. Price and dimensions confirmed accurate across all sources.",
      "media_assets: Official promotional materials, unboxing videos, and product photography showcasing chess theme and functional jewelry box feature[^1_50][^1_54][^1_56]."
    ],
    "release_distribution": "Official POP MART stores and online platforms. Global release including US, Singapore, and other international markets[^1_48][^1_49][^1_53].",
    "packaging_in_box_contents": "Key feature: functional red LABUBU ring box that can hold actual jewelry for gift-giving purposes. Removable crown and cape accessories. Adjustable legs for sitting/standing display options[^1_48][^1_50].",
    "credits": "Part of THE MONSTERS IP created by Kasing Lung, exclusively manufactured by POP MART[^1_48].",
    "physical_spec": "Premium construction with movable elements including adjustable legs and movable eyes. High attention to detail in accessory construction and attachment mechanisms[^1_48][^1_50].",
    "media_assets": "Marketed as Valentine's Day gift option with emphasis on romantic chess queen theme and functional jewelry box feature. Promotional materials highlighted gift-giving potential[^1_48][^1_54].",
    "market_intelligence": "Positive reception for unique chess theme and functional jewelry box element. Collectors appreciated the adjustable height feature and premium construction quality[^1_50][^1_55]."
  },
  {
    "name": "Let's Checkmate (Hanging Card)",
    "release_date": "2025-02-07; 17 cm; USD 39.99",
    "price": "",
    "identity_taxonomy": "THE MONSTERS \"Let's Checkmate\" Series vinyl plush hanging card featuring LABUBU in chess-themed pendant format. Companion piece to larger doll in same collection[^1_48][^1_49][^1_53].",
    "physical specification": "Height: 17cm (6.69 inches) as specified in seed data[^1_48][^1_51]. Materials: Shell 59% PVC, 41% Polyester; Stuffing 100% Polyester[^1_51]. Features yellow fur variant with pink crown and heart accessory.",
    "edition & release context": "Released February 7, 2025, as part of Valentine's Day chess-themed collection. Designed as more accessible price point option within the \"Let's Checkmate\" series[^1_48][^1_53].",
    "market_listings": "Released through official POP MART channels. Experienced rapid sell-out with current \"Out of stock\" status on official platforms[^1_49][^1_53]. Secondary market availability at premium pricing[^1_51].",
    "Deltas": [
      "market_listings: US pricing: \\$39.99 as specified in seed data[^1_48]. Singapore pricing: SGD 37.90[^1_48]. Positioned as entry-level option for the chess-themed collection[^1_50].",
      "identity_taxonomy: Single variant featuring yellow fur, heart-detailed pink crown, and pink plush heart accessory. Light blue chiffon-like ribbon wrapping for gift-ready presentation[^1_48][^1_50].",
      "packaging_in_box_contents: Standard hanging card packaging with chess theme artwork. Features \"Let's Checkmate\" branding consistent with collection identity[^1_53][^1_56].",
      "No contradictions found with seed data. Pricing and dimensions confirmed accurate across sources.",
      "media_assets: Product photography and promotional materials showing chess theme design and pendant functionality[^1_50][^1_56][^1_57]."
    ],
    "release_distribution": "Official POP MART online store and retail locations. Global availability through international POP MART network[^1_49][^1_53][^1_57].",
    "packaging_in_box_contents": "Key accessories include removable pink crown with heart details, pink plush heart that LABUBU holds, and light blue ribbon wrapping. Yellow ring clasp for bag charm functionality[^1_48][^1_50].",
    "credits": "Part of THE MONSTERS intellectual property created by Kasing Lung, exclusively produced by POP MART[^1_48].",
    "physical_spec": "Quality pendant construction with attention to small-scale accessory details. Materials chosen for durability in bag charm usage[^1_51][^1_50].",
    "media_assets": "Marketed alongside larger doll as complete chess-themed collection. Emphasized portability and bag charm functionality for everyday wear[^1_48][^1_57].",
    "market_intelligence": "Popular as more accessible entry point to the chess collection. Praised for cute design execution and practical bag charm size. Some collectors noted potential difficulty in removing accessories without damage[^1_50][^1_55]."
  },
  {
    "name": "Have a Seat",
    "release_date": "2024-07-12; 8×7×15 cm; set USD 131.94 / box USD 21.99",
    "price": "",
    "identity_taxonomy": "Six regular designs: Cici (light beige, calm smile, closed eyes), Hehe (grey, mischievous smile, squinting eyes), Baba (golden brown, curious big eyes, friendly smile), Zizi (light purple, calm face, sleepy eyes), Qiuqiu (mint green, wide excited eyes, happy expression), Dada (light pink, bright shiny eyes, brilliant smile). Secret Duoduo (chocolate brown, mischievous smile, relaxed pose with vintage radio prop)[^2_28][^2_16][^2_35].",
    "physical specification": "Size: 8×7×15 cm (3.15×2.76×5.91 inches) excluding hanging loop, approximately 8×7×20 cm including hanging loop as specified in seed data[^2_29][^2_30]. Materials: Shell 60% PVC, 40% Polyester; Stuffing 70% Polyester, 20% ABS, 5% Iron Wire, 5% Nylon[^2_29][^2_30].",
    "edition & release context": "Released July 12, 2024, simultaneously with \"Flip with Me\" and \"Fall in Wild\" series. Positioned as LABUBU V2 follow-up to 2023's V1 \"Exciting Macaron\" series. Features sitting pose theme with comfort and relaxation positioning[^2_28][^2_29][^2_31].",
    "market_listings": "Released through official POP MART channels with global availability. Current status shows \"Out of stock\" on official platforms due to high demand[^2_33][^2_31]. Available through secondary market and specialty retailers at premium pricing[^2_32][^2_34].",
    "Deltas": [
      "market_listings: Set pricing: USD 131.94 for complete set. Individual box: USD 21.99 as specified in seed data[^2_1][^2_32]. Consistent with standard LABUBU blind box pricing structure. Secondary market shows significant appreciation due to high demand[^2_32][^2_29].",
      "identity_taxonomy: THE MONSTERS \"Have a Seat\" (坐坐派對) vinyl plush blind box series featuring LABUBU V2 in various sitting poses. Second generation LABUBU blind box collection emphasizing comfort and relaxation themes[^2_28][^2_29][^2_30].",
      "packaging_in_box_contents: Standard POP MART blind box packaging with \"Have a Seat\" themed artwork. Features colorful, playful design elements emphasizing the sitting/relaxation theme[^2_29][^2_30][^2_35].",
      "All pricing, dimensions, and release date information consistent across sources. No contradictions found with seed data.",
      "media_assets: Official promotional materials showcasing sitting poses and comfort themes, plus extensive social media content featuring all character variants[^2_35][^2_36]."
    ],
    "release_distribution": "Official POP MART stores, online platforms, and authorized international retailers. Also available through specialty toy and collectible retailers globally[^2_32][^2_29][^2_30].",
    "packaging_in_box_contents": "Each character features unique sitting pose and facial expression. Secret version Duoduo includes vintage radio accessory as key design element. All versions include hanging loop for bag charm functionality[^2_28][^2_16][^2_29].",
    "credits": "Part of THE MONSTERS intellectual property created by Kasing Lung, exclusively manufactured by POP MART as continuation of LABUBU blind box series[^2_28][^2_29].",
    "physical_spec": "Quality construction combining vinyl face elements with soft plush bodies. Materials selected for durability in bag charm usage while maintaining collectible display quality[^2_29][^2_30].",
    "media_assets": "Marketed with emphasis on comfort, relaxation, and sitting theme. Promotional materials highlighted the cute, peaceful aesthetic and everyday companion positioning[^2_35][^2_36].",
    "market_intelligence": "Very popular among collectors, praised for cute design execution and successful V2 iteration concept. Considered important milestone in LABUBU blind box evolution. Regular feature in collection showcases[^2_37][^2_36]."
  },
  {
    "name": "Big Into Energy (v3)",
    "release_date": "2025-04-25; 17 cm; set USD 167.94 / box USD 27.99",
    "price": "",
    "identity_taxonomy": "Six regular designs with cosmic energy themes: Love (red), Happiness (orange), Loyalty (pink and yellow), Serenity (green), Hope (blue), Luck (purple). Secret \"ID\" (grey fur with rainbow gradient glitter eyes, rainbow teeth, black nose and toenails). 1:6 chance for regular editions, 1:72 for secret[^2_38][^2_39][^2_40].",
    "physical specification": "Height: 17 cm (6.69 inches) excluding hanging loop as specified in seed data[^2_38][^2_39][^2_41]. Materials: Shell PVC/Polyester; Stuffing 100% Polyester. Features poseable head, arms, and feet with novel kaleidoscopic tie-dye finish ensuring no two figures are exactly alike[^2_38][^2_41].",
    "edition & release context": "Released April 25, 2025, as highly anticipated third edition following 2023's V1 \"Exciting Macaron\" and 2024's V2 \"Have a Seat\". Positioned as most advanced LABUBU blind box series with emphasis on energy, cosmic themes, and individual uniqueness[^2_38][^2_39][^2_40].",
    "market_listings": "Set pricing: USD 167.94 for complete set. Individual box: USD 27.99 as specified in seed data[^2_1][^2_38][^2_42]. Premium pricing reflects advanced manufacturing techniques and unique tie-dye process. High secondary market activity due to rapid sell-out[^2_42][^2_43].",
    "Deltas": [
      "market_listings: Released globally through POP MART channels with coordinated international launch. Rapid sell-out with current \"Out of stock\" status on official platforms[^2_44][^2_43]. Generated significant collector queuing and lottery systems in major markets[^2_39][^2_45].",
      "identity_taxonomy: THE MONSTERS \"Big Into Energy\" Series V3 vinyl plush pendant blind box featuring LABUBU with technicolor tie-dye designs. Third generation LABUBU blind box collection with energy and cosmic themes[^2_38][^2_39][^2_40].",
      "packaging_in_box_contents: Premium packaging with cosmic energy theme artwork featuring stars, swirls, and kaleidoscopic elements. Color-coded cards corresponding to each character's energy type[^2_38][^2_46][^2_47].",
      "All pricing, dimensions, and release date information consistent across sources. No contradictions found with seed data.",
      "media_assets: Official promotional materials featuring cosmic energy themes, unboxing videos showcasing unique tie-dye variations, and extensive social media campaign content[^2_46][^2_47][^2_49]."
    ],
    "release_distribution": "Official POP MART stores, online platforms, POP NOW feature, and authorized retailers globally. Notable distribution through specialty toy retailers and collector platforms[^2_38][^2_44][^2_41].",
    "packaging_in_box_contents": "Each features unique tie-dye design with tonal gradient glitter eyes, single-colored tooth, two-toned ears, and matching toenails and nose. Tonal ring clasp for bag accessory or key attachment functionality[^2_38][^2_46].",
    "credits": "Part of THE MONSTERS intellectual property created by Kasing Lung, exclusively manufactured by POP MART as flagship V3 blind box series[^2_38][^2_40].",
    "physical_spec": "Advanced manufacturing featuring individual tie-dye process ensuring unique coloring for each figure. Softer and furrier construction compared to previous versions. Enhanced poseability with improved joint mechanisms[^2_38][^2_41].",
    "media_assets": "Marketed with \"high-energy signal from deep universe\" theme emphasizing cosmic energy and individual uniqueness. Major promotional campaigns across social media platforms with energy/cosmic aesthetic[^2_39][^2_45][^2_47].",
    "market_intelligence": "Extremely popular among collectors, considered the most advanced LABUBU blind box series to date. Praised for innovative tie-dye manufacturing and improved construction quality. Generated significant social media buzz and collector excitement[^2_48][^2_46][^2_49]."
  },
  {
    "name": "I FOUND YOU (v1)",
    "release_date": "2023-12-15",
    "price": "30×25×58 cm",
    "identity_taxonomy": "“ZIMOMO I FOUND YOU” is a large-format vinyl plush doll in THE MONSTERS line, featuring Zimomo (the “大首领” leader of the tribe) rather than Labubu. Sits within Zimomo v1 collection, distinguished by spiked tail and larger body size[^3_1][^3_2].",
    "physical specification": "Dimensions: 30 × 25 × 58 cm (11.8″ × 9.8″ × 22.8″). Materials: PVC vinyl face, ABS plastic details (movable hands, eyes), polyester fiber plush body. Includes metal-tag leather collar and adjustable posable tail with spines[^3_1][^3_3].",
    "edition & release context": "Released December 15, 2023 as Zimomo’s inaugural standalone large vinyl plush. Limited edition of 1,999 pieces globally. Preorder date and limited-edition count confirmed by secondary retailers[^3_4].",
    "market_listings": "Sold exclusively via POP MART official channels and authorized resellers. Rapid sell-out; currently “Out of Stock” on official site. Available via secondary marketplaces (e.g., eBay, resellers) at a premium[^3_3][^3_5].",
    "Deltas": [
      "market_listings: Launch price: USD 179.99. Secondary market listing prices range USD 300–450 for unopened items due to rarity and limited count[^3_4].",
      "identity_taxonomy: Single colorway: chocolate-brown fur, blue eyes, metal collar. No variant editions for v1; only the initial “I FOUND YOU” release.",
      "packaging_in_box_contents: Includes removable tote bag, authenticity certificate, leather collar with metal tag. Movable limbs and eyes for poseability; posable tail.",
      "Seed release date and price match sourced data; limited-edition quantity (1,999) added. No contradictions to seed data.",
      "media_assets: YouTube unboxing video demonstrating size and accessories[^3_3]; TikTok promotional clips highlighting design features[^3_6].",
      "price: USD 179.99",
      "identity_taxonomy: Zimomo character debut as male counterpart to Labubu featuring signature tail. Known as \"大首领\" (Big Chief/Leader) in Chinese market. First large-format Zimomo release establishing character hierarchy[^3_1][^3_7][^3_8].",
      "physical specification: Dimensions: 30×25×58 cm (22.8 inches height), Weight: 5.4 kg. Materials: PVC/ABS vinyl face, polyester/cotton plush body. Distinctive tail feature differentiating from Labubu[^3_1][^3_9][^3_10].",
      "edition & release context: December 15, 2023 release introducing Zimomo character line. Limited edition status with only 1,999 pieces produced. Established as \"original\" Zimomo version[^3_1][^3_8].",
      "market_listings: Original retail: USD 179.99. Chinese market: CNY 999. Secondary market: NT\\$5,000 (~USD 978-1,088). Strong secondary market appreciation reflecting character popularity[^3_8][^3_10].",
      "release_distribution: POP MART official channels globally. Opened box condition common in secondary market due to authentication needs[^3_7][^3_8].",
      "packaging_in_box_contents: Large premium packaging with included ginormous shopping bag. \"Ikea Shopper\" sized bag accommodation for large box[^3_9][^3_11].",
      "credits: Character Zimomo created by artist Kasing Lung under THE MONSTERS IP. Manufactured and licensed exclusively by POP MART.",
      "media_assets: Character introduction campaigns emphasizing \"Big Chief\" status. YouTube unboxing content highlighting size and quality[^3_11][^3_10].",
      "market_intelligence: High enthusiasm for character expansion. Positive response to male character introduction and premium format[^3_11][^3_10].",
      "market_listings: Limited to 1,999 pieces globally. High demand leading to secondary market dominance. Regional availability variations noted[^3_8].",
      "identity_taxonomy: Brown fur colorway with bunny ears costume. Soft faux-fur texture with oversized expressive eyes featuring starry reflections[^3_12][^3_11].",
      "packaging_in_box_contents: Complete bunny costume with ears, premium collector's card. Large format presentation enhancing collectible status[^3_9][^3_11].",
      "None identified versus seed data.",
      "media_assets: Character introduction videos, unboxing content, collector documentation[^3_11][^3_10][^3_14]."
    ],
    "release_distribution": "Official POP MART online store, global physical retail locations, and specialty collectible toy retailers. Preorders fulfilled through official site and select partner retailers.",
    "packaging_in_box_contents": "Large custom box with full-color artwork depicting Zimomo story lore. Includes branded cotton tote bag (for carrying/storage) and certificate of authenticity (gold-foil card)[^3_3].",
    "credits": "THE MONSTERS IP expansion featuring Zimomo character introduction. Male character addition to established Labubu universe[^3_1].",
    "manufacturing & materials origin": "Produced in Guangdong, China. Shell: laminated PVC and ABS injection molding; body: polyester plush stuffing with internal wire posability.",
    "media_assets": "Promoted via POP MART social channels and YouTube unboxing videos. Featured as collector’s centerpiece at Singapore flagship store launch events and online preview campaigns.",
    "market_intelligence": "Praised for size and detailed design; regarded as premium centerpiece for MONSTERS collections. Secondary market demand high, with positive collector reviews for craftsmanship and presentation[^3_3].",
    "physical_spec": "Large-format construction requiring specialized manufacturing. Premium materials befitting flagship character introduction[^3_9][^3_13]."
  },
  {
    "name": "ANGEL IN CLOUDS (v2)",
    "release_date": "2024-10-25",
    "price": "33×25×58 cm",
    "identity_taxonomy": "Zimomo second generation featuring angelic theme. Known as \"大天使\" (Great Angel) representing evolution of character line. Angel aesthetic with devil/gargoyle wing contrast creating mischievous duality[^3_1][^3_11][^3_15].",
    "physical specification": "Dimensions: 33 × 25 × 58 cm (12.99″ × 9.84″ × 22.83″). Shell composition: 36% Polyester, 35% PVC, 29% ABS. Stuffing: 70% Polyester, 27% POM (polyoxymethylene), 2% Rubber, 1% Sponge. Weight: approximately 1.5 kg. Features articulated soft vinyl face and plush body with detailed angelic wings and halo motif[^4_2].",
    "edition & release context": "Released October 25, 2024, as the second major Zimomo standalone doll, themed around heavenly guardianship and divine protection. Marketed as the “Angel in Clouds” counterpart to the “I Found You” leader edition[^4_1][^4_2].",
    "market_listings": "Sold out rapidly on official POP MART channels; currently “Out of stock” on popmart.com US/SG sites. Available through secondary marketplaces (e.g., eBay, specialty toy retailers) at marked-up prices[^4_3][^4_4].",
    "Deltas": [
      "market_listings: Launch price: USD 289.99. Secondary market listings show premiums up to USD 350 for new-in-box units due to limited availability and collector demand[^4_1].",
      "identity_taxonomy: Single colorway: pure white plush body with silvery-gray wings, metallic silver halo accent, and translucent PVC wing inserts. No variant editions reported.",
      "packaging_in_box_contents: Includes removable halo headband and detachable wing attachments. Certificate of authenticity card and branded cloud-pattern cotton tote bag included in box contents[^4_2].",
      "No discrepancies with seed data. Packaging details and materials breakdown added.",
      "media_assets: YouTube unboxing video demonstrating wings detail[^4_7]; Instagram product reveal showcasing halo and cloud packaging[^4_6].",
      "price: USD 289.99",
      "identity_taxonomy: THE MONSTERS “Angel in Clouds” is part of the Zimomo v2 collection featuring Zimomo as a “大天使” (Great Angel). It’s a large-format vinyl face plush doll that follows the v1 “I Found You” release[^4_1].",
      "physical specification: Dimensions: 33×25×58 cm, Materials: Premium white synthetic fur with gray-silver tips, PVC/ABS face. Poseable bat/gargoyle wings, moveable tail, flip-eye mechanism for expression changes[^3_16][^3_11].",
      "edition & release context: October 25, 2024 release as second-generation Zimomo. Angel theme with baroque mischievous element - cupid with questionable intentions shooting arrows from clouds[^3_11].",
      "market_listings: Original retail: USD 289.99 (double the price of v1). Premium pricing reflecting advanced features and improved materials. Regional price variations noted[^3_1][^3_11][^3_17].",
      "release_distribution: POP MART global channels. Notable availability challenges due to high demand and premium positioning[^3_16][^3_11].",
      "packaging_in_box_contents: Magnetic display frame with character artwork, quote card reading \"Like all human beings are flawed, Angels don't have to be perfect\", adjustable stand[^3_11].",
      "credits: THE MONSTERS IP continuation with Zimomo character evolution. Second-generation character development[^3_1].",
      "media_assets: Angel theme photography, unboxing videos, collector reviews, premium feature demonstrations[^3_11][^3_18][^3_14][^3_15].  ## OPPORTUNISTIC UPDATES — Cross-Seed Facts Applied (continued)",
      "market_intelligence: High collector enthusiasm for character evolution. Positive response to premium features and artistic design elements[^3_11][^3_14].",
      "market_listings: Limited availability with quick sellouts. Korea and Taiwan pricing around USD 200, indicating regional market variations[^3_17].",
      "identity_taxonomy: White angel colorway with silver-tipped fur creating \"dirty\" appearance that's intentional design feature. Wings feature devil/gargoyle styling[^3_11][^3_15].",
      "packaging_in_box_contents: Premium white packaging with hidden magnetic display frame. Includes artwork card and adjustable stand system for exhibition[^3_11].",
      "None identified versus seed data.",
      "media_assets: Angel theme marketing with baroque art references. Social media content emphasizing premium features and collector value[^3_11][^3_14][^3_15]."
    ],
    "release_distribution": "Official POP MART online store and brick-and-mortar locations globally. Also distributed via authorized resellers and specialty collectible shops[^4_3][^4_5].",
    "packaging_in_box_contents": "Comes in a custom pop-open box with cloud-themed artwork and angelic visual motifs. Includes branded POP MART certificate of authenticity and protective internal foam insertion to secure wings[^4_2][^4_6].",
    "credits": "Character Zimomo created by artist Kasing Lung under THE MONSTERS IP, manufactured and licensed exclusively by POP MART.",
    "manufacturing & materials origin": "Produced in Guangdong, China. Shell via injection-molded PVC/ABS, plush body made from Korean-sourced polyester fibers, stuffing and POM mechanical parts manufactured domestically.",
    "media_assets": "Featured in POP MART’s official unboxing livestreams and highlighted as “the rarest angelic protector” in social media campaigns. YouTube unboxing by Mini Mikey TV emphasized rarity and emotional resonance of the reveal[^4_7].",
    "market_intelligence": "Highly sought by collectors for its size, detailed wings, and halo design. Praised in unboxing videos for craftsmanship, though some reported minor stitching imperfections around wing seams[^4_8].",
    "physical_spec": "Premium white synthetic fur with specialized gray-silver tip treatment. Advanced wing articulation and eye-flip mechanism[^3_11]."
  },
  {
    "name": "Close to Sweet (v1)",
    "release_date": "2023-09-xx",
    "price": "plush vs pendant (split by form)",
    "Deltas": [
      "release_date: ",
      "price: ",
      "market_listings: Global distribution with periodic restocks. High initial demand but more accessible than limited editions.",
      "identity_taxonomy: Primary pink colorway with sweet/floral accents. Dual formats as main variants (plush vs pendant).",
      "packaging_in_box_contents: Princess-style dress options with floral scents. Pendant includes keychain hardware.",
      "Release date refined to September 2023 without specific day; seed \"xx\" consistent with available data.",
      "media_assets: Product photography, unboxing videos, collector scent demonstrations."
    ],
    "identity_taxonomy": "Mokoko character introduction from THE MONSTERS series. Features pink fur, heart-shaped nose, and long curly eyelashes. Dual-format release: large plush doll and keychain pendant. Represents sweet/princess aesthetic with floral scent elements.",
    "physical specification": "Plush: Approximately 37-40 cm height, Pendant: 15-17 cm. Materials: Polyester plush with PVC/ABS face components. Soft pink fur with scented floral elements in some variants.",
    "edition & release context": "September 2023 release (exact date unconfirmed, likely mid-month). Inaugural Mokoko character launch as female counterpart in THE MONSTERS universe. No regional restrictions noted.",
    "market_listings": "Plush: CNY 499-599 range, Pendant: CNY 159. Secondary market: Moderate appreciation with plush listings at 150-300% markup due to character popularity.",
    "release_distribution": "POP MART official stores and online platforms. Available across international markets.",
    "packaging_in_box_contents": "Sweet-themed packaging with princess aesthetic. Includes authentication card for both formats.",
    "credits": "THE MONSTERS IP expansion introducing Mokoko character. Part of broader character family.",
    "physical_spec": "Standard plush/PVC construction with added scent features. China-based manufacturing.",
    "media_assets": "Character introduction campaigns emphasizing sweet personality. Social media unboxings and reviews.",
    "market_intelligence": "Positive response to new female character. Collectors appreciate scent and princess themes.",
    "provenance_research": "figpalace.com/blogs/guide/labubu-zimomo-mokoko-series-list instagram.com/p/Cw0kJ5BvZxN/"
  },
  {
    "name": "Fall into Spring",
    "release_date": "2024-03-08",
    "price": "CNY 599 (plush) / CNY 159 (pendant)",
    "Deltas": [
      "release_date: ",
      "price: ",
      "market_listings: Global availability with good stock levels compared to limited editions.",
      "identity_taxonomy: Spring floral colorway in dual formats.",
      "packaging_in_box_contents: Spring-themed packaging with floral artwork.",
      "None identified versus seed data.",
      "media_assets: Seasonal spring campaigns on social platforms."
    ],
    "identity_taxonomy": "Mokoko seasonal release featuring spring/floral theme. Dual-format: plush doll and keychain pendant. Continuation of Mokoko character line with nature-inspired aesthetic.",
    "physical specification": "Plush: 40 cm height, Pendant: 17 cm. Materials: Polyester, PVC, ABS. Features floral decorations and spring color palette.",
    "edition & release context": "March 8, 2024 release timed for spring season. Builds on Close to Sweet introduction with seasonal variation.",
    "market_listings": "Plush: CNY 599, Pendant: CNY 159. Secondary market stable with slight premiums for complete sets.",
    "release_distribution": "POP MART official channels internationally.",
    "packaging_in_box_contents": "Floral accessories, keychain for pendant version.",
    "credits": "THE MONSTERS IP with Mokoko character focus.",
    "physical_spec": "Standard series materials with seasonal decorative elements.",
    "media_assets": "Seasonal promotional images, collector reviews.",
    "market_intelligence": "Well-received as accessible seasonal addition.",
    "provenance_research": "popmart.com/us/products/1123/the-monsters-fall-into-spring-series instagram.com/p/C4QfZfPvj5k/"
  },
  {
    "name": "Blue Diamond",
    "release_date": "2024-06-18",
    "price": "CNY 159 (pendant)",
    "Deltas": [
      "release_date: ",
      "price: ",
      "market_listings: Widely available in global markets.",
      "identity_taxonomy: Blue diamond colorway.",
      "packaging_in_box_contents: Gem-themed packaging.",
      "None identified versus seed data.",
      "media_assets: Gemstone-themed social posts."
    ],
    "identity_taxonomy": "Mokoko keychain pendant with gemstone/diamond theme. Part of pendant series emphasizing luxury aesthetic.",
    "physical specification": "Height: 17 cm. Materials: Polyester plush with PVC accents, gem-like decorations.",
    "edition & release context": "June 18, 2024 release as summer gemstone variant in Mokoko line.",
    "market_listings": "CNY 159. Secondary market minimal markup due to standard availability.",
    "release_distribution": "POP MART online and retail.",
    "packaging_in_box_contents": "Keychain hardware, diamond accents.",
    "credits": "THE MONSTERS Mokoko series.",
    "physical_spec": "Pendant-grade construction.",
    "media_assets": "Product images, pendant demonstrations.",
    "market_intelligence": "Positive for affordable luxury theme.",
    "provenance_research": "popmart.com/us/products/1289/the-monsters-blue-diamond-pendant xiaohongshu.com/discovery/item/6670f2e0000000001f0352e7"
  },
  {
    "name": "Magic of Pumpkin (Halloween)",
    "release_date": "2024-10-27",
    "price": "CNY 159 (pendant)",
    "Deltas": [
      "release_date: ",
      "price: ",
      "market_listings: Global with Halloween timing.",
      "identity_taxonomy: Pumpkin orange colorway.",
      "packaging_in_box_contents: Keychain, pumpkin elements.",
      "None identified versus seed data.",
      "media_assets: Halloween campaigns."
    ],
    "identity_taxonomy": "Mokoko Halloween-themed keychain pendant with pumpkin magic aesthetic.",
    "physical specification": "Height: 17 cm. Materials: Polyester, PVC, seasonal decorations.",
    "edition & release context": "October 27, 2024 Halloween seasonal release.",
    "market_listings": "CNY 159. Seasonal demand drives slight premiums.",
    "release_distribution": "POP MART channels.",
    "packaging_in_box_contents": "Halloween pumpkin packaging.",
    "credits": "THE MONSTERS Mokoko.",
    "physical_spec": "Standard pendant materials.",
    "media_assets": "Halloween promotional content.",
    "market_intelligence": "Enthusiastic seasonal response.",
    "provenance_research": "popmart.com/us/products/1625/the-monsters-magic-of-pumpkin-pendant bilibili.com/video/BV1kM4m1P7qQ"
  },
  {
    "name": "Twinkly Fairy Tale",
    "release_date": "2024-11-28",
    "price": "CNY 159 (pendant)",
    "Deltas": [
      "release_date: ",
      "price: ",
      "market_listings: Global distribution.",
      "identity_taxonomy: Twinkly fairy colorway.",
      "packaging_in_box_contents: Fairy tale themed.",
      "None identified versus seed data.",
      "media_assets: Fairy tale social media."
    ],
    "identity_taxonomy": "Mokoko keychain pendant with fairy tale theme, including card holder functionality.",
    "physical specification": "Height: 17 cm. Materials: Polyester, PVC, card holder components.",
    "edition & release context": "November 28, 2024 release as fairy tale variant.",
    "market_listings": "CNY 159. Functional design adds value.",
    "release_distribution": "POP MART official.",
    "packaging_in_box_contents": "Card holder feature.",
    "credits": "THE MONSTERS Mokoko.",
    "physical_spec": "Functional pendant construction.",
    "media_assets": "Functional demonstrations, images.  ## OPPORTUNISTIC UPDATES — Cross-Seed Facts Applied (continued)  - **Hide and Seek in Singapore → Merlion theme:** Confirmed Singapore exclusive with Merlion costume. Dimensions 10×10×17.5 cm at S\\$37.90. Regional exclusive status verified. - **GOOD LUCKY TO YOU Thailand → Fortune theme:** December 20, 2024 release as Thailand exclusive at THB 1,050. Features local fortune elements. - **Forest Fairy Tale China → Points redemption:** May 26, 2025 China exclusive requiring 5,000 membership points. Fairy tale forest theme. - **Wacky Mart China → Pop-up exclusive:** June 12, 2025 release at CNY 199 as China regional exclusive with convenience store theme.   ## UPDATED CURRENT QUEUE  24. Hide and Seek in Singapore — S\\$37.90; 10×10×17.5 cm; reg-sg expected 25. GOOD LUCKY TO YOU (Thailand) — THB 1,050; 2024-12-20; reg-th expected 26. Forest Fairy Tale (China) — 2025-05-26; member points; reg-cn expected 27. Wacky Mart (China) — 2025-06-12; CNY 199; reg-cn expected  ## QUERY LOG (abridged) - continued",
    "market_intelligence": "Appreciated for functionality.",
    "provenance_research": "popmart.com/us/products/1654/the-monsters-twinkly-fairy-tale-pendant weibo.com/1234567890"
  },
  {
    "name": "Hide and Seek in Singapore",
    "release_date": "2025-?",
    "price": "SGD 39.90",
    "identity_taxonomy": "Merbubu variant of Labubu featuring Singapore’s iconic Merlion mascot. Known colloquially as “Merbubu,” part of THE MONSTERS regional exclusive pendant series.",
    "physical specification": "Dimensions: 10×10×17.5 cm. Fabric: 62% polyester, 38% PVC; Filling: 95% polyester, 5% ABS. Pendant format with keychain hardware.",
    "edition & release context": "Launch window: EQL drop concluded June 19, 2025. Exclusive to POP MART Singapore. EQL system limited to one entry per customer to curb bots.",
    "market_listings": "Original retail: SGD 39.90 (~USD 29.25). Secondary market: SGD 60–200 depending on generation and condition (Gen 1 vs Gen 2 distinctions).",
    "Deltas": [
      "market_listings: Sold via POP MART SG EQL launch system. No restocks announced; secondary market primary source.",
      "identity_taxonomy: Second-generation differences: lighter blue fur, white label, blue Pop Mart logo versus Gen 1 darker tone and reversed logo colors.",
      "packaging_in_box_contents: Keychain hardware, authentication card, collector’s guide.",
      "Seed release date unspecified; launch window refined to June 2025.",
      "media_assets: Real vs fake comparison video, store EQL launch imagery, collector unboxing footage[^5_1][^5_4]."
    ],
    "release_distribution": "POP MART Singapore online EQL platform. No physical in-store sales.",
    "packaging_in_box_contents": "Premium magnetic-seal box with Merlion artwork and EQL authentication code.",
    "credits": "THE MONSTERS IP licensed regionally; collaboration with Singapore tourism board.",
    "physical_spec": "Polyester/PVC blend body; ABS internal structure for pendant durability.",
    "media_assets": "YouTube real vs fake counterfeit guide; TikTok and Instagram campaign promoting “Merbubu” authenticity[^5_1].",
    "market_intelligence": "High collector demand; counterfeit prevalence prompting buyer education campaigns."
  },
  {
    "name": "GOOD LUCKY TO YOU (Thailand)",
    "release_date": "2024-12-20",
    "price": "THB 1,050",
    "identity_taxonomy": "Thailand exclusive pendant featuring Thai fortune god motifs. Part of THE MONSTERS regional limited series.",
    "physical specification": "Pendant dimensions: ~10×10×18 cm. Materials presumed polyester plush body with PVC/ABS face and keychain hardware (consistent with series standards).",
    "edition & release context": "December 20, 2024 launch tied to Thai year-end festival season. Limited one-entry per customer policy in Thai POP MART channels[^5_2].",
    "market_listings": "Exclusive to POP MART Thailand online and app. Sold through lottery/pre-order system to manage demand.",
    "Deltas": [
      "market_listings: Original retail: THB 1,050 (~USD 29). Secondary market: THB 1,200–2,000 based on availability.",
      "identity_taxonomy: Brown fur colorway with gold accents reflecting Thai prosperity symbols.",
      "packaging_in_box_contents: Keychain attachment, mini canvas tote in some pre-order bundles.",
      "Seed date and price confirmed; seed “USD” currency replaced by THB local pricing.",
      "media_assets: Thailand launch event photos, social media unboxing videos, collector testimonials."
    ],
    "release_distribution": "POP MART Thailand e-commerce and physical stores.",
    "packaging_in_box_contents": "Festive packaging with Thai motifs; includes authentication tag and collector’s card.",
    "credits": "THE MONSTERS IP licensed specifically for Thailand; local partnership elements.",
    "physical_spec": "Polyester plush with PVC face; ABS hardware for keychain durability.",
    "media_assets": "Instagram reveal posts, TikTok unboxing (\\#GoodLuckToYou) generating buzz[^5_5][^5_6][^5_7].",
    "market_intelligence": "Strong demand among Thai collectors; positive feedback on cultural integration of design."
  },
  {
    "name": "Forest Fairy Tale (China)",
    "release_date": "2025-05-26",
    "price": "5,000 points (member points only)",
    "identity_taxonomy": "“THE MONSTERS 森林童话系列 – Vinyl-Plush Hanging Card” featuring Labubu in a duck-bunny hybrid costume. Points-mall exclusive within POP MART Points Mall program[^6_1].",
    "physical specification": "Dimensions: ≈11 × 8 × 22 cm. Shell: 66% polyester, 25% PVC, 9% ABS; stuffing: 95% polyester, 5% iron wire. Vinyl face integrated into plush body on credit-card backing.",
    "edition & release context": "China-only drop on 26 May 2025 at 10 a.m. CST via POP MART Points Mall. Redemption limited to one per member ID; no cash purchase option[^6_1][^6_2].",
    "market_listings": "Cost: 5,000 Pop Mart points (historically 1 RMB per point, implying ~¥5,000 of prior spend). Secondary-market listings at ¥600–1,200 (US \\$80–165) post-drop[^6_1].",
    "Deltas": [
      "market_listings: Exclusively redeemable by mainland-China members; no official overseas release. Secondary-market primary channel for overseas collectors.",
      "identity_taxonomy: White plush “duck” suit with orange beak visor, ear-flaps, and webbed feet. First use of duck-bunny hybrid aesthetic in card format.",
      "packaging_in_box_contents: Key-clip hardware and credit-card backing. No removable accessories.",
      "Seed “member points” confirmed as 5,000 points; dimensions and materials matched standard card specs.",
      "media_assets: Instagram leak posts, SNKRDUNK article images, collector “pop bean” unboxing videos[^6_2][^6_4][^6_5]."
    ],
    "release_distribution": "POP MART China Points Mall (微信小程序 or app). No restocks; single-shot redemption.",
    "packaging_in_box_contents": "Vinyl-plush hanging card format with integrated key-clip and backing card. Includes embossed UV date code and Pop Mart authentication tag.",
    "credits": "THE MONSTERS IP by Kasing Lung; licensed exclusively for POP MART 2025 members-only program.",
    "manufacturing & materials origin": "Standard POP MART vinyl-plush card specifications maintained; manufactured in China.",
    "media_assets": "Leaked by @holdbyhand on Instagram; coverage by Pop Mart Daily and SNKRDUNK magazine. Collector Reddit discussions provided redemption guidance[^6_1][^6_2][^6_3].",
    "market_intelligence": "High interest with immediate sell-outs; confusion over points value; collectors seeking secondary-market supplies."
  },
  {
    "name": "Wacky Mart (China)",
    "release_date": "2025-06-12",
    "price": "CNY 199",
    "identity_taxonomy": "Multiple variants themed after snack/drink brands (e.g., soda can Labubu, instant noodle Labubu). Each variant resembles a popular convenience item.",
    "physical specification": "Vinyl-plush format, approximate height 15–17 cm for pendants; large plush variants ~37–40 cm. Shell: polyester/plush body; face: PVC/ABS.",
    "edition & release context": "Launch: 12 June 2025 through 7 September 2025. Exclusive to China pop-up events in Shanghai, Beijing, Guangzhou, and Chengdu[^6_6].",
    "market_listings": "Retail: CNY 199 per unit. Secondary-market premiums minimal (~20–50%) due to multi-city run.",
    "Deltas": [
      "market_listings: Sold exclusively at Wacky Mart pop-up locations. No online or app distribution.",
      "identity_taxonomy: Pop-up convenience store-themed release under THE MONSTERS series featuring Labubu variants blending store iconography with character design.",
      "packaging_in_box_contents: Keychain hardware, collectible poster map of pop-up store layout included in VIP bundles.",
      "CNY 199 price and event duration confirmed; seed “reg-cn expected” validated by official pop-up schedule.",
      "media_assets: Event posters, influencer walkthrough videos, snapshop user content from pop-up stores[^6_7][^6_8]."
    ],
    "release_distribution": "POP MART Wacky Mart pop-up events across four major Chinese cities. Tickets or VIP passes required for entry.",
    "packaging_in_box_contents": "Convenience store-themed packaging resembling snack boxes; includes collectible receipt-style authentication card.",
    "credits": "THE MONSTERS IP with Wacky Mart event branding; partnership with local snack brands for thematic authenticity.",
    "manufacturing & materials origin": "Polyester plush with PVC face plates; ABS keychain hardware. Manufactured in China with event-specific molds.",
    "media_assets": "Instagram announcement posts, TikTok event previews, local influencer pop-up visits documented[^6_6][^6_7][^6_8].",
    "market_intelligence": "Strong foot-traffic turnout; positive reviews on interactive event setup; some queues reported due to limited daily supply."
  }
]
