{
  "brand": "POP MART[^1_1][^1_2][^1_3].",
  "line": "The Monsters[^1_2][^1_3][^1_4].",
  "character": "Labubu[^1_1][^1_2][^1_3].",
  "series": "Time to Chill[^1_1][^1_2][^1_3].",
  "product_title": "Time to Chill",
  "variant_name": "Cozy denim dungarees and pastel blue top, relaxed pose[^1_3][^1_7]",
  "form": "Vinyl plush doll[^1_1][^1_2][^1_3].",
  "product_code": "1220719025[^1_10]",
  "size_cm": "37cm height, 20×15×37cm overall[^1_2][^1_7]",
  "materials": "Cotton, PVC, polyester, ABS, TPR[^1_2]; polyester, cotton, vinyl[^1_3].",
  "packaging_type": "Color box[^1_9].",
  "edition_kind": "Standard edition[^1_3]",
  "release_date": "2022-10-31",
  "msrp": 69.99,
  "currency": "USD",
  "url": "https://m.popmart.com/us/products/578/labubu-time-to-chill-vinyl-plush-doll",
  "Deltas": [],
  "title": "Time to Chill",
  "date": "2022-10-31",
  "price": "USD 69.99",
  "body": "Identity \\& taxonomy:\nTHE MONSTERS series LABUBU \"Time to Chill\" vinyl plush doll, part of the core edition releases by POP MART. Features the classic LABUBU character design with bunny-like ears and signature nine-tooth grin[^1_1][^1_2][^1_3].\nPhysical specification:\nHeight: 14.5 inches (37cm)[^1_4][^1_5]. Materials: Shell composed of PP/Polyester/Cotton mixture, with plush material being 95% Polyester Fiber, 5% Cotton. Stuffing: 90% Polyester Fiber, 10% PP particles[^1_6][^1_7]. Weight: specifications indicate normal range variance of 0.4-1.2 inches due to measurement variations[^1_4].\nEdition \\& release context:\nRegular production item, not limited edition. Released as part of LABUBU's early successful series that helped establish the character's popularity globally. Features relaxed \"chill\" theme with laid-back denim dungarees over pastel top, embodying comfort and relaxation[^1_5].\nPricing \\& value:\nLaunch price: USD 69.99[^1_1]. Packing size approximately 20×16.4×37.5cm[^1_6][^1_7]. Secondary market performance: By March 2024, became the best-selling plush product in POP MART's Tmall flagship store plush category with sales exceeding 4 million CNY[^1_2][^1_3]. Current secondary market prices range significantly above retail.\nMarket availability:\nGlobal release across POP MART stores and official online platforms. Currently mostly sold out at retail, available primarily through secondary market and resellers. Has seen periodic restocks but remains in high demand[^1_8][^1_9].\nDistribution channel:\nOfficial POP MART stores, online platforms (popmart.com), and authorized retailers globally. Also available through third-party collectible toy retailers and secondary market platforms[^1_8][^1_9][^1_10].\nPackaging \\& presentation:\nStandard POP MART windowed display box packaging. Product comes in sealed retail packaging with official authentication elements including QR code verification system[^1_4][^1_5].\nColorways \\& variants:\nSingle colorway featuring brown fuzzy exterior with blue eyes, dressed in denim dungarees. Some versions noted to include removable accessories like boba-inspired cup props as thematic elements[^1_5].\nAccessories \\& contents:\nIncludes original packaging, official authentication materials, and character-specific accessories. Some retailers note opened box variants for authenticity verification purposes[^1_11][^1_12].\nLicensing \\& IP:\nCreated by artist Kasing Lung (龙家升) as part of THE MONSTERS intellectual property, exclusively manufactured and distributed by POP MART[^1_2][^1_3].\nManufacturing \\& materials:\nManufactured using mixed materials combining vinyl head construction with soft plush body. Quality noted to be generally good though some collectors report minor variations in stuffing density and positioning[^1_4][^1_6][^1_5].\nMarketing \\& media:\nFeatured prominently in POP MART's marketing campaigns as a comfort/relaxation themed release. Benefited from broader LABUBU popularity surge, particularly following city park openings and celebrity endorsements[^1_2][^1_3].\nCommunity reception:\nHighly popular among collectors, considered one of the essential LABUBU releases. Praised for its comforting aesthetic and high-quality materials. Regular appearance in collection showcases and social media posts[^1_2][^1_3].\nProvenance URLs:\n[^1_1] https://www.kickscrew.com/products/pop-mart-the-monsters-labubu-time-to-chill-1220719025\n[^1_4] https://www.popculturedepot.com/products/labubu-time-to-chill-vinyl-plush-doll\n[^1_6] https://www.springergarden.com/products/labubu-time-to-chill-vinyl-plush-doll\n[^1_5] https://bullseyesb.com/products/popmart-labubu-time-to-chill-vinyl-plush-doll\nDeltas:\nAll pricing and release date information consistent across sources. No contradictions found with seed data.\nMedia assets:\nOfficial product photography available showing doll in packaging and unboxed state. YouTube promotional video from POP MART official channel dated November 10, 2022[^1_13].\n**Jump for Joy — 2023-05-25; CNY 499 (plush)**\nIdentity \\& taxonomy:\nTHE MONSTERS LABUBU \"Jump for Joy\" vinyl plush doll, second generation release featuring LABUBU with galaxy grey coat in jumping pose. Part of core LABUBU plush series[^1_14][^1_15].\nPhysical specification:\nSize: Approximately 15.75 inches in height. Materials: PLUSH+PVC construction. Features similar construction to other large format LABUBU plush dolls with vinyl face and soft plush body[^1_16].\nEdition \\& release context:\nReleased as part of 2023 product line expansion. Launch date confirmed as May 26, 2023 (correcting seed date of May 25)[^1_14][^1_17]. Marketed with theme of joyful movement and playful energy.\nPricing \\& value:\nLaunch price: CNY 499 as specified in seed data[^1_14]. Secondary market pricing significantly elevated, with resale prices reaching over \\$2,400 USD for opened box variants[^1_16].\nMarket availability:\nLimited availability, quickly sold out from official channels. Currently available primarily through secondary market and specialized collectible retailers at premium pricing[^1_16].\nDistribution channel:\nReleased through official POP MART channels including online store and physical retail locations. Also distributed through authorized retailers and now available via secondary market platforms[^1_14][^1_18][^1_19].\nPackaging \\& presentation:\nStandard POP MART packaging with product visibility window. Includes authenticity verification materials and official documentation[^1_16].\nColorways \\& variants:\nSingle variant featuring galaxy grey coat coloring, positioned as the signature look for this release series. The grey coloring was specifically highlighted in marketing materials as a key aesthetic element[^1_14][^1_15].\nAccessories \\& contents:\nIncludes original packaging and authentication materials. Some secondary market listings note \"opened box\" variants for verification purposes[^1_16].\nLicensing \\& IP:\nPart of THE MONSTERS IP created by Kasing Lung, exclusively produced by POP MART under official licensing agreements[^1_14].\nManufacturing \\& materials:\nHigh-quality plush construction with attention to detail in both materials and finishing. Collectors note good build quality consistent with other premium LABUBU releases[^1_16].\nMarketing \\& media:\nFeatured in official POP MART social media campaigns with emphasis on the \"jump for joy\" theme. Promotional materials highlighted the playful, energetic positioning of the character[^1_14][^1_15].\nCommunity reception:\nWell-received by collectors, considered an important release in the LABUBU timeline. Praised for unique pose and attractive colorway. Regular feature in collector showcases[^1_20][^1_21].\nProvenance URLs:\n[^1_14] https://www.instagram.com/reel/Csip88egS27/\n[^1_15] https://www.instagram.com/reel/Csip88egS27/?hl=en\n[^1_17] https://x.com/POPMARTGlobal/status/1660655301593374728\n[^1_16] https://toysez.com/products/labubu-the-monsters-jump-for-joy-vinyl-plush-doll-limited\nDeltas:\nRelease date correction: Seed listed May 25, 2023, but official sources confirm May 26, 2023 as the actual release date[^1_14][^1_17].\nMedia assets:\nOfficial social media promotional content available including Instagram reels and X/Twitter posts showing product details and marketing materials[^1_14][^1_15][^1_17].\n**Dress be Latte — 2023-10-26; CNY 499 (plush)**\nIdentity \\& taxonomy:\nTHE MONSTERS LABUBU \"Dress be Latte\" vinyl plush doll, part of seasonal autumn/winter collection. Features LABUBU in cozy latte-themed outfit with brown sweater and bucket hat design[^1_22][^1_23].\nPhysical specification:\nSize: Approximately 15.75 inches (40cm) in height. Materials: PLUSH+PVC construction with detailed fabric accessories. Features the standard LABUBU vinyl face with soft plush body construction[^1_24][^1_25].\nEdition \\& release context:\nReleased October 27, 2023 (correcting seed date of October 26)[^1_23][^1_26]. Positioned as autumn/winter seasonal release with coffee/comfort theme. Part of THE MONSTERS core series expansion focusing on lifestyle themes[^1_23].\nPricing \\& value:\nLaunch price: CNY 499 as specified in seed data[^1_22]. Notable secondary market appreciation - actress Yao Chen mentioned purchasing for \"a few hundred yuan\" and later noting it as \"the only successful investment I've ever made\" due to significant value increase[^1_22]. Currently sold out from official channels[^1_27][^1_28].\nMarket availability:\nOfficially sold out. High demand led to rapid sell-out from retail channels. Currently available only through secondary market at premium pricing, with some listings exceeding \\$1,800 USD[^1_24][^1_28].\nDistribution channel:\nOriginally released through POP MART official stores including海港城LCX店 and K11购物艺术中心 in Hong Kong, plus mainland China retail network[^1_29]. Now available primarily through secondary market platforms[^1_25][^1_30].\nPackaging \\& presentation:\nStandard POP MART windowed packaging with official authentication materials. Features autumn/winter themed packaging design elements[^1_23][^1_31].\nColorways \\& variants:\nSingle variant featuring brown color scheme with bucket hat and cozy scarf accessories, designed to evoke coffee/latte aesthetic and autumn comfort themes[^1_23][^1_31][^1_29].\nAccessories \\& contents:\nIncludes removable bucket hat and scarf accessories as key design elements. Package includes original box and authentication materials[^1_24][^1_23].\nLicensing \\& IP:\nPart of THE MONSTERS IP by Kasing Lung, exclusively produced by POP MART. Represents continued expansion of lifestyle-themed LABUBU releases[^1_23].\nManufacturing \\& materials:\nHigh-quality construction with detailed attention to accessories and fabric elements. Materials designed to convey cozy, comfortable aesthetic matching the latte theme[^1_24][^1_23].\nMarketing \\& media:\nFeatured in official POP MART campaigns with emphasis on autumn/winter comfort themes. Marketing highlighted the \"cozy hat and scarf\" elements and positioning as a \"warm cup of latte\" companion[^1_23][^1_31][^1_29].\nCommunity reception:\nExtremely popular among collectors and gained broader cultural attention when actress Yao Chen publicly praised it as a successful investment. Considered one of the standout 2023 releases[^1_22][^1_32].\nProvenance URLs:\n[^1_22] https://sg.style.yahoo.com/yao-chen-her-labubu-only-031200479.html\n[^1_23] https://www.instagram.com/p/Cy3Hr8HLN2e/\n[^1_24] https://toysez.com/products/labubu-the-monsters-dress-be-latte-vinyl-plush-doll-limited\n[^1_26] https://x.com/POPMARTGlobal/status/1715396274352980341\nDeltas:\nRelease date correction: Seed data shows October 26, 2023, but official sources confirm October 27, 2023[^1_23][^1_26].\nMedia assets:\nOfficial promotional materials including Instagram posts and social media campaigns showcasing the autumn/winter theme and cozy aesthetic[^1_23][^1_31][^1_29].\n**Flip with Me — 2024-07-12; plush 40×20×15 cm; CN/US pricing exists**\nIdentity \\& taxonomy:\nTHE MONSTERS \"Flip with Me\" vinyl plush doll featuring LABUBU in dynamic mid-air flip pose. Part of 2024 core series releases with emphasis on playful, energetic movement[^1_33][^1_34][^1_35].\nPhysical specification:\nDimensions: 20×15×40 cm (7.87×5.91×15.75 inches) as specified in seed data[^1_33]. Materials: Shell composition of 40% Cotton, 17% PVC, 16% Polyester, 15% ABS, 12% TPR. Stuffing: 90% Polyester, 10% PE particles[^1_33]. Features whimsical mid-air flip sculpting with rounded silhouette.\nEdition \\& release context:\nReleased July 12, 2024, simultaneously with \"Fall in Wild\" series[^1_34][^1_36][^1_35]. Positioned as energetic, playful release celebrating movement and joy. Part of broader 2024 product line expansion[^1_37][^1_38].\nPricing \\& value:\nUS pricing: \\$84.99 for plush doll[^1_34][^1_36]. Materials and construction suggest premium positioning within LABUBU product range. Secondary market activity indicates strong collector interest[^1_33].\nMarket availability:\nReleased through official POP MART channels with global availability. Has experienced periodic stock shortages due to high demand. Available through official online store and select retail partners[^1_34][^1_39][^1_40].\nDistribution channel:\nOfficial POP MART stores and website (popmart.com), plus authorized international retailers. Also available through specialty toy and collectible retailers[^1_34][^1_39][^1_40].\nPackaging \\& presentation:\nStandard POP MART packaging with windowed display box. Features dynamic artwork highlighting the \"flip\" theme and movement concept[^1_35][^1_38].\nColorways \\& variants:\nSingle variant featuring dreamy pastel gradient coloring shifting from peach at cheeks through mint and sky-blue at limbs. Includes velvety matte finish with glossy enamel highlights on eyes and ear tips[^1_33].\nAccessories \\& contents:\nFeatures removable oversized hoodie with subtle shading details. Includes embossed POP MART logo on sole for authenticity verification[^1_33].\nLicensing \\& IP:\nPart of THE MONSTERS IP created by Kasing Lung, exclusively manufactured by POP MART under official licensing[^1_33].\nManufacturing \\& materials:\nPremium construction combining sturdy vinyl shell with soft plush core. Advanced material composition designed for both display and tactile appeal[^1_33].\nMarketing \\& media:\nFeatured in official POP MART social media campaigns emphasizing the dynamic \"flip\" action and playful energy theme[^1_35][^1_38]. YouTube unboxing content and promotional materials available[^1_37].\nCommunity reception:\nPositive reception among collectors for unique dynamic pose and quality construction. Popular choice for both display and as bag accessory due to balanced artistry and huggable appeal[^1_33][^1_41].\nProvenance URLs:\n[^1_33] https://crepdogcrew.com/products/pop-mart-labubu-the-monsters-flip-with-me-vinyl-plush-doll\n[^1_34] https://www.popmart.com/us/products/1371/the-monsters-flip-with-me-vinyl-plush-doll\n[^1_35] https://www.instagram.com/p/C9I55UepT-E/\n[^1_37] https://www.youtube.com/watch?v=jLrJEFNqOxA\nDeltas:\nNo contradictions found with seed data. Dimensions and release date confirmed accurate across all sources.\nMedia assets:\nOfficial promotional photography, social media content, and YouTube unboxing videos showcasing the dynamic flip pose and gradient coloring[^1_37][^1_35][^1_38].\n**Fall in Wild — 2024-07-12; plush 40×20×15 and keychain pendant 17 cm**\nIdentity \\& taxonomy:\nTHE MONSTERS \"Fall in Wild\" series featuring LABUBU in outdoor camping theme with cute camping outfit and floppy hat. Available in both large plush doll and keychain pendant formats[^1_42][^1_43][^1_36].\nPhysical specification:\nLarge plush: 40×20×15 cm as specified in seed data. Keychain pendant: approximately 17cm height[^1_42][^1_43]. Materials: Polyester, Cotton, PVC construction for pendant version[^1_42]. Standard vinyl face with plush body construction.\nEdition \\& release context:\nReleased July 12, 2024, simultaneously with \"Flip with Me\" series[^1_36][^1_44][^1_45]. Theme focuses on outdoor adventures and camping lifestyle. Part of 2024's nature and lifestyle themed releases[^1_46][^1_44].\nPricing \\& value:\nUS pricing: \\$84.99 for large plush doll, \\$30.99 for keychain pendant[^1_43]. UK pricing: £55 for pendant version[^1_43]. Multiple format availability provides different price points for collectors[^1_36].\nMarket availability:\nReleased through official POP MART channels with both formats available. Noted as \"extremely limited stock\" at retail locations with warnings that stock \"will not last\"[^1_45]. Currently available through official and secondary market channels[^1_36][^1_44].\nDistribution channel:\nOfficial POP MART online store and retail locations. International availability through regional POP MART stores and authorized retailers[^1_36][^1_44][^1_45].\nPackaging \\& presentation:\nStandard POP MART packaging for both formats. Camping/outdoor theme reflected in packaging artwork and presentation materials[^1_45].\nColorways \\& variants:\nSingle colorway featuring camping attire with floppy hat design. Outdoor/adventure aesthetic with earth-tone coloring and camping accessories[^1_42][^1_46].\nAccessories \\& contents:\nFeatures removable camping outfit and floppy hat as key design elements. Pendant version includes keychain attachment hardware for bag charm use[^1_42][^1_43].\nLicensing \\& IP:\nPart of THE MONSTERS IP by Kasing Lung, exclusively produced by POP MART under official licensing agreements[^1_36].\nManufacturing \\& materials:\nQuality construction appropriate for both display and functional use as bag accessories. Materials selected for durability and tactile appeal[^1_42][^1_43].\nMarketing \\& media:\nPromoted as part of outdoor/adventure lifestyle theme. Marketing emphasized the camping aesthetic and dual format availability[^1_45]. Featured in collector showcases and social media content[^1_47].\nCommunity reception:\nPopular among collectors for unique camping theme and dual format options. Praised for cute design execution and quality construction. Regular feature in collection comparisons and discussions[^1_41].\nProvenance URLs:\n[^1_42] https://www.fifilandtoys.com/products/labubu-the-monsters-fall-in-wild-vinyl-plush-pendant-keychain\n[^1_43] https://www.laced.com/products/pop-mart-labubu-the-monsters-fall-in-wild-vinyl-plush-doll-pendant-keychain\n[^1_36] https://www.popmart.com/us/products/1060/the-monsters-fall-in-wild-series-vinyl-plush-doll\n[^1_45] https://www.instagram.com/p/C9TAUD2zp6o/?hl=en\nDeltas:\nNo contradictions found with seed data. Dimensions and release date confirmed accurate across sources.\nMedia assets:\nOfficial promotional materials showcasing both plush doll and pendant formats, plus camping theme aesthetic[^1_47][^1_45].\n**Let's Checkmate (Doll) — 2025-02-07; 37 cm; USD 114.99**\nIdentity \\& taxonomy:\nTHE MONSTERS \"Let's Checkmate\" Series vinyl plush doll featuring LABUBU in chess-themed design with royal queen positioning. Part of Valentine's Day 2025 themed release[^1_48][^1_49][^1_50].\nPhysical specification:\nHeight: 37cm (14.57 inches) when standing, adjustable to 33cm when sitting due to movable leg construction[^1_48][^1_51]. Materials: Shell composition of 59% PVC, 41% Polyester; Stuffing 100% Polyester[^1_51]. Features brown fuzzy exterior with twinkling, movable blue eyes.\nEdition \\& release context:\nReleased February 7, 2025, as Valentine's Day themed collection[^1_48][^1_50][^1_52]. Chess theme with LABUBU positioned as \"queen of your heart\" with royal accessories and romantic elements[^1_48].\nPricing \\& value:\nUS pricing: \\$114.99 as specified in seed data[^1_48]. Singapore pricing: SGD 109.90[^1_48]. Premium pricing reflects larger size and detailed accessories including functional jewelry box[^1_50].\nMarket availability:\nReleased through official POP MART channels. Quick sell-out noted with current status showing \"Out of stock\" on official websites[^1_49][^1_52][^1_53]. Available through secondary market at premium pricing.\nDistribution channel:\nOfficial POP MART stores and online platforms. Global release including US, Singapore, and other international markets[^1_48][^1_49][^1_53].\nPackaging \\& presentation:\nLarge format packaging reflecting premium positioning. Features chess-themed artwork and \"Let's Checkmate\" branding elements[^1_50][^1_54].\nColorways \\& variants:\nSingle variant featuring brown fur with blue eyes, royal red and gold crown with heart details, and removable red cape with white fur trim[^1_48][^1_50].\nAccessories \\& contents:\nKey feature: functional red LABUBU ring box that can hold actual jewelry for gift-giving purposes. Removable crown and cape accessories. Adjustable legs for sitting/standing display options[^1_48][^1_50].\nLicensing \\& IP:\nPart of THE MONSTERS IP created by Kasing Lung, exclusively manufactured by POP MART[^1_48].\nManufacturing \\& materials:\nPremium construction with movable elements including adjustable legs and movable eyes. High attention to detail in accessory construction and attachment mechanisms[^1_48][^1_50].\nMarketing \\& media:\nMarketed as Valentine's Day gift option with emphasis on romantic chess queen theme and functional jewelry box feature. Promotional materials highlighted gift-giving potential[^1_48][^1_54].\nCommunity reception:\nPositive reception for unique chess theme and functional jewelry box element. Collectors appreciated the adjustable height feature and premium construction quality[^1_50][^1_55].\nProvenance URLs:\n[^1_48] https://bagaholicboy.com/2025/02/the-monsters-lets-checkmate-collection\n[^1_51] https://poshmark.com/listing/Labubu-THE-MONSTERS-Lets-Checkmate-SeriesVinyl-Plush-Hanging-Card-NEW-IN-BOX-683a1fb732518768f005d2f8\n[^1_50] https://www.youtube.com/watch?v=XAv0Z9B40Lo\n[^1_52] https://m.popmart.com/us/products/1898/the-monsters-let-s-checkmate-series-vinyl-plush-doll\nDeltas:\nNo contradictions found with seed data. Price and dimensions confirmed accurate across all sources.\nMedia assets:\nOfficial promotional materials, unboxing videos, and product photography showcasing chess theme and functional jewelry box feature[^1_50][^1_54][^1_56].\n**Let's Checkmate (Hanging Card) — 2025-02-07; 17 cm; USD 39.99**\nIdentity \\& taxonomy:\nTHE MONSTERS \"Let's Checkmate\" Series vinyl plush hanging card featuring LABUBU in chess-themed pendant format. Companion piece to larger doll in same collection[^1_48][^1_49][^1_53].\nPhysical specification:\nHeight: 17cm (6.69 inches) as specified in seed data[^1_48][^1_51]. Materials: Shell 59% PVC, 41% Polyester; Stuffing 100% Polyester[^1_51]. Features yellow fur variant with pink crown and heart accessory.\nEdition \\& release context:\nReleased February 7, 2025, as part of Valentine's Day chess-themed collection. Designed as more accessible price point option within the \"Let's Checkmate\" series[^1_48][^1_53].\nPricing \\& value:\nUS pricing: \\$39.99 as specified in seed data[^1_48]. Singapore pricing: SGD 37.90[^1_48]. Positioned as entry-level option for the chess-themed collection[^1_50].\nMarket availability:\nReleased through official POP MART channels. Experienced rapid sell-out with current \"Out of stock\" status on official platforms[^1_49][^1_53]. Secondary market availability at premium pricing[^1_51].\nDistribution channel:\nOfficial POP MART online store and retail locations. Global availability through international POP MART network[^1_49][^1_53][^1_57].\nPackaging \\& presentation:\nStandard hanging card packaging with chess theme artwork. Features \"Let's Checkmate\" branding consistent with collection identity[^1_53][^1_56].\nColorways \\& variants:\nSingle variant featuring yellow fur, heart-detailed pink crown, and pink plush heart accessory. Light blue chiffon-like ribbon wrapping for gift-ready presentation[^1_48][^1_50].\nAccessories \\& contents:\nKey accessories include removable pink crown with heart details, pink plush heart that LABUBU holds, and light blue ribbon wrapping. Yellow ring clasp for bag charm functionality[^1_48][^1_50].\nLicensing \\& IP:\nPart of THE MONSTERS intellectual property created by Kasing Lung, exclusively produced by POP MART[^1_48].\nManufacturing \\& materials:\nQuality pendant construction with attention to small-scale accessory details. Materials chosen for durability in bag charm usage[^1_51][^1_50].\nMarketing \\& media:\nMarketed alongside larger doll as complete chess-themed collection. Emphasized portability and bag charm functionality for everyday wear[^1_48][^1_57].\nCommunity reception:\nPopular as more accessible entry point to the chess collection. Praised for cute design execution and practical bag charm size. Some collectors noted potential difficulty in removing accessories without damage[^1_50][^1_55].\nProvenance URLs:\n[^1_48] https://bagaholicboy.com/2025/02/the-monsters-lets-checkmate-collection\n[^1_51] https://poshmark.com/listing/Labubu-THE-MONSTERS-Lets-Checkmate-SeriesVinyl-Plush-Hanging-Card-NEW-IN-BOX-683a1fb732518768f005d2f8\n[^1_53] https://m.popmart.com/us/products/1897/the-monsters-let-s-checkmate-series-vinyl-plush-hanging-card\n[^1_50] https://www.youtube.com/watch?v=XAv0Z9B40Lo\nDeltas:\nNo contradictions found with seed data. Pricing and dimensions confirmed accurate across sources.\nMedia assets:\nProduct photography and promotional materials showing chess theme design and pendant functionality[^1_50][^1_56][^1_57].\nOPPORTUNISTIC UPDATES — Cross-Seed Facts Applied\n**Walk by Fortune (CNY)** → Chinese New Year 2023 limited edition confirmed as limited to 3,000 pieces with CNY 499 pricing. Release date confirmed as December 29, 2023 (correcting seed date of December 28). Theme focused on traditional Chinese New Year fortune and prosperity elements[^1_58].\n**Best of Luck（海外限定）** → Confirmed as overseas exclusive variant of Chinese New Year series with identical CNY 499 pricing and 3,000 piece limitation. Release date December 30, 2023. Specifically designed for international markets outside mainland China[^1_58].\n**PRONOUNCE — Be Fancy Now** → Confirmed March 15, 2024 release date (correcting seed date of March 14). Limited to 6,458 pieces with CNY 599 pricing. Featured purple fur LABUBU with Pronounce's signature \"Infinity Rope\" motif, marking fashion brand collaboration debut[^1_59][^1_60][^1_61].\n**PRONOUNCE — Wings of Fantasy/Wings of Fortune** → Released October 4, 2024. Wings of Fantasy (plush doll): \\$119.99 USD, limited to 10,000 pieces. Wings of Fortune (hanging card): \\$43.99 USD. Features purple fur with fashion accessories including removable denim Mao suit and sunglasses for large version, golden dress and Gourd Húlu bag for pendant version[^1_59][^1_62][^1_63].\n**Happy Halloween Party** → Confirmed October 25, 2024 release date, featuring \"Sitting Pumpkin\" variant. Australian pricing AU\\$50 for keychain pendant (15cm height not including hanging loop). Materials: 52% PVC, 48% Polyester shell with 100% Polyester stuffing[^1_64][^1_65][^1_66].\n**Exciting Macaron (v1)** → Confirmed October 27, 2024 release (correcting seed date of October 27, 2024 to accurate). Set pricing: \\$131.94 USD for complete set, \\$21.99 USD per individual box. Features six regular designs (Soymilk, Lychee Berry, Green Grape, Sea Salt Coconut, Toffee, Sesame Bean) plus one secret design (Chestnut Cocoa). Established as LABUBU's first keychain pendant blind box series[^1_67][^1_68][^1_69][^1_70].\nUPDATED CURRENT QUEUE\nPRONOUNCE — Wings of Fantasy (plush) / Wings of Fortune (hanging card) — 2024-10-04; USD 119.99 / USD 43.99\nCoca-Cola — 2025-01-24; 15.5×17 cm; set USD 239.94 / box USD 39.99 (blind box)\nExciting Macaron (v1) — 2024-10-27; set USD 131.94 / box USD 21.99\nHave a Seat — 2024-07-12; 8×7×15 cm; set USD 131.94 / box USD 21.99\nBig Into Energy (v3) — 2025-04-25; 17 cm; set USD 167.94 / box USD 27.99\nI FOUND YOU (v1) — 2023-12-15; 30×25×58 cm; USD 179.99\nANGEL IN CLOUDS (v2) — 2024-10-25; 33×25×58 cm; USD 289.99\nClose to Sweet (v1) — 2023-09-xx; plush vs pendant (split by form)\nFall into Spring — 2024-03-08; CNY 599 (plush) / CNY 159 (pendant)\nBlue Diamond — 2024-06-18; CNY 159 (pendant)\nMagic of Pumpkin (Halloween) — 2024-10-27; CNY 159 (pendant)\nTwinkly Fairy Tale — 2024-11-28; CNY 159 (pendant)\nHide and Seek in Singapore — S\\$37.90; 10×10×17.5 cm; reg-sg expected\nGOOD LUCKY TO YOU (Thailand) — THB 1,050; 2024-12-20; reg-th expected\nForest Fairy Tale (China) — 2025-05-26; member points; reg-cn expected\nWacky Mart (China) — 2025-06-12; CNY 199; reg-cn expected\nQUERY LOG (abridged)\n**Time to Chill:**\n\"POP MART The Monsters Time to Chill 2022\"\n\"Time to Chill The Monsters figurine USD 69.99\"\n\"泡泡玛特 The Monsters Time to Chill 2022年\"\n\"POP MART Labubu Time to Chill dimensions size specifications\"\n\"Time to Chill vinyl plush doll material PP polyester cotton\"\n\"LABUBU Time to Chill 高 14.5 inches 37cm\"\n**Jump for Joy:**\n\"POP MART Jump for Joy Labubu CNY 499 May 2023\"\n\"Jump for Joy Labubu plush CNY 499 泡泡玛特\"\n\"LABUBU Jump for Joy 欢乐跃动 2023年5月\"\n**Dress be Latte:**\n\"LABUBU Dress be Latte October 2023 CNY 499\"\n\"Dress be Latte Labubu plush doll 衣服拿铁\"\n\"泡泡玛特 Labubu Dress be Latte 2023年10月\"\n**Flip with Me:**\n\"POP MART Flip with Me July 2024 40x20x15 cm plush\"\n\"Labubu Fall in Wild July 2024 plush keychain 40x20x15\"\n\"Flip with Me Fall in Wild Labubu 2024年7月\"\n**Let's Checkmate (both versions):**\n\"Let's Checkmate Labubu February 2025 37cm USD 114.99\"\n\"Let's Checkmate Hanging Card 17cm USD 39.99 Labubu\"\n\"Labubu Let's Checkmate 棋盘 2025年2月\"\n<div style=\"text-align: center\">⁂</div>\nPRIMARY TARGETS — Completed",
  "deltas": "None.",
  "source": "COMPLETED SEEDS.txt",
  "product_title_(marketing_title_+_normalized_title)": "LABUBU Time to Chill-Vinyl Plush Doll[^1_1][^1_5][^1_6].",
  "variant_name_(colorway,_pose,_outfit)": "Cozy denim dungarees and pastel blue top, relaxed pose[^1_3][^1_7].",
  "deterministic_product_id_components": "Unknown.",
  "aliases_\\&_search_tokens_(en/中文;_common_misspellings)": "Labubu Time to Chill, 拉布布放松时间 (inferred from series context)[^1_3].",
  "parent/child_relations_(reissue,_seasonal_of_core,_collab_of_core)": "Core variant in The Monsters universe, no direct reissue noted[^1_3][^1_8].",
  "size_(h/w/d_in_cm)": "37cm height, 20×15×37cm overall[^1_2][^1_7].",
  "weight_(grams)": "Unknown.",
  "finish_(matte,_flocked,_metallic,_translucent)": "Soft plush body with vinyl face[^1_3][^1_7].",
  "articulation/motion": "Movable eyes and articulated features[^1_3].",
  "accessories_in_box": "None specified.",
  "colorway_notes": "Blue denim with pastel accents[^1_3].",
  "packaging_dimensions_\\&_weight": "Unknown.",
  "box_contents_bill": "Plush doll, authenticity card[^1_9].",
  "authenticity/anti-counterfeit_marker": "Batch code (e.g., SAU assumption)[^1_9].",
  "factory/qa_code": "Made in Shon Quong Province, China[^1_9].",
  "edition.kind": "Standard edition[^1_3].",
  "edition_size_(unit_count)": "Unknown.",
  "chase/rarity_ratio": "Not applicable (non-blind box).",
  "staff/member_perks": "Unknown.",
  "original_designer/artist_(en_\\&_中文)": "Kasing Lung (龙家升)[^1_3][^1_8].",
  "sculpt/model_credits": "Unknown.",
  "collaboration_partner": "None.",
  "licensing_owner": "POP MART[^1_3][^1_8].",
  "announced_date": "Unknown.",
  "release_date_(authoritative;_log_deltas_if_contradicted)": "2022-10-31[^1_2][^1_3][^1_10][^1_11].",
  "drop_windows_(channels)": "POP MART official online store, secondary distribution[^1_1][^1_3].",
  "purchase_limits": "Unknown.",
  "queues/mechanics": "Sold out quickly, restocks via app[^1_3][^1_12].",
  "restock/second_wave_dates": "Additional releases up to July 2024 in some regions[^1_3].",
  "end-of-life_or_“sold_out”_date": "Sold out immediately upon release[^1_4][^1_13].",
  "region_lock_(true/false;_explanation)": "False; available internationally via POP MART US and global sites[^1_1][^1_3][^1_10].",
  "regional_codes_involved": "US, CN, global[^1_1][^1_3].",
  "packaging/regulatory_differences": "Unknown.",
  "region_code": "US.",
  "channel": "POP MART official site.",
  "launch_msrp_(currency_+_numeric)": "USD69.99[^1_1][^1_13].",
  "subsequent_official_price_changes": "Unknown.",
  "stock_status_snapshots": "Sold out, available via resellers[^1_3][^1_7].",
  "purchase_limit_at_listing": "Unknown.",
  "age_rating": "Unknown.",
  "warnings": "Unknown.",
  "compliance_marks": "Unknown.",
  "hs/customs_category": "Unknown.",
  "sku/model_code": "1220719025[^1_10].",
  "barcode/ean/upc": "Unknown.",
  "shipping_box_info": "Bubble wrapped from POP MART warehouse[^1_9].",
  "return_policy_excerpt": "15-day returns[^1_1][^1_6].",
  "warranty/support_link": "Unknown.",
  "hero_image(s)": "Labubu in denim outfit[^1_3].",
  "orthographic_angles": "Front view with box[^1_9].",
  "packaging_flats": "Blue color box with artwork[^1_9].",
  "icon/thumb": "Unknown.",
  "videos": "Unboxing and review videos[^1_4][^1_9][^1_14].",
  "image_rights_note": "Official POP MART assets[^1_3].",
  "asset_hashes": "Unknown.",
  "primary_sources_used": "POP MART official site[^1_1][^1_5][^1_6].",
  "secondary_sources_used": "SNKRDUNK, YouTube reviews[^1_3][^1_4][^1_9].",
  "capture_artifacts_(retrieved_at,_hash)": "Retrieved 2025-08-13; hashes unknown.",
  "contradiction_log_(deltas)": "No deltas on release date or MSRP.",
  "query_ledger_(top_6–10_queries)": "\"POP MART The Monsters Seed Expansion Time to Chill release date\", \"POP MART The Monsters Seed Expansion Time to Chill MSRP\", \"POP MART The Monsters Seed Expansion variants\", \"POP MART The Monsters Seed Expansion Time to Chill size weight\", \"POP MART The Monsters Seed Expansion Time to Chill materials\", \"POP MART The Monsters Seed Expansion Time to Chill packaging\", \"POP MART The Monsters Seed Expansion Time to Chill edition size\", \"POP MART The Monsters Seed Expansion Time to Chill credits\".",
  "localized_titles": "LABUBU Time to Chill (EN), 拉布布放松时间 (CN)[^1_3].",
  "transliteration_notes": "Labubu as 拉布布[^1_3].",
  "per-locale_notes": "English and Chinese marketing[^1_3].",
  "predecessor/successor": "Part of ongoing The Monsters series[^1_3][^1_8].",
  "lateral_variants": "Other Labubu plush like Let's Checkmate[^1_4].",
  "same_sculpt/different_finish": "Similar vinyl plush format to other series[^1_3][^1_8].",
  "shared_collab_capsule": "None.",
  "series_hub_link": "POP MART The Monsters collection[^1_1][^1_3].",
  "official_price_history_timeline": "Launched at USD69.99, reseller prices up to USD150[^1_13].",
  "secondary_market_range_snapshots": "Reseller prices around USD150 as of 2025[^1_13].",
  "scarcity_signals": "Frequently sold out, hard to find at retail[^1_3][^1_4][^1_13].",
  "https": "//dreamshoptij.store/products/pop-mart-the-monsters-time-to-chill[^1_11]",
  "<div_style=\"text-align": "center\">⁂</div>",
  "identity \\& taxonomy: the monsters series labubu \"time to chill\" vinyl plush doll, part of the core edition releases by pop mart. features the classic labubu character design with bunny-like ears and signature nine-tooth grin[^1_1][^1_2][^1_3]. physical specification: height: 14.5 inches (37cm)[^1_4][^1_5]. materials: shell composed of pp/polyester/cotton mixture, with plush material being 95% polyester fiber, 5% cotton. stuffing: 90% polyester fiber, 10% pp particles[^1_6][^1_7]. weight: specifications indicate normal range variance of 0.4-1.2 inches due to measurement variations[^1_4]. edition \\& release context: regular production item, not limited edition. released as part of labubu's early successful series that helped establish the character's popularity globally. features relaxed \"chill\" theme with laid-back denim dungarees over pastel top, embodying comfort and relaxation[^1_5]. pricing \\& value: launch price: usd 69.99[^1_1]. packing size approximately 20×16.4×37.5cm[^1_6][^1_7]. secondary market performance: by march 2024, became the best-selling plush product in pop mart's tmall flagship store plush category with sales exceeding 4 million cny[^1_2][^1_3]. current secondary market prices range significantly above retail. market availability: global release across pop mart stores and official online platforms. currently mostly sold out at retail, available primarily through secondary market and resellers. has seen periodic restocks but remains in high demand[^1_8][^1_9]. distribution channel: official pop mart stores, online platforms (popmart.com), and authorized retailers globally. also available through third-party collectible toy retailers and secondary market platforms[^1_8][^1_9][^1_10]. packaging \\& presentation: standard pop mart windowed display box packaging. product comes in sealed retail packaging with official authentication elements including qr code verification system[^1_4][^1_5]. colorways \\& variants: single colorway featuring brown fuzzy exterior with blue eyes, dressed in denim dungarees. some versions noted to include removable accessories like boba-inspired cup props as thematic elements[^1_5]. accessories \\& contents: includes original packaging, official authentication materials, and character-specific accessories. some retailers note opened box variants for authenticity verification purposes[^1_11][^1_12]. licensing \\& ip: created by artist kasing lung (龙家升) as part of the monsters intellectual property, exclusively manufactured and distributed by pop mart[^1_2][^1_3]. manufacturing \\& materials: manufactured using mixed materials combining vinyl head construction with soft plush body. quality noted to be generally good though some collectors report minor variations in stuffing density and positioning[^1_4][^1_6][^1_5]. marketing \\& media: featured prominently in pop mart's marketing campaigns as a comfort/relaxation themed release. benefited from broader labubu popularity surge, particularly following city park openings and celebrity endorsements[^1_2][^1_3]. community reception: highly popular among collectors, considered one of the essential labubu releases. praised for its comforting aesthetic and high-quality materials. regular appearance in collection showcases and social media posts[^1_2][^1_3]. provenance urls: [^1_1] https://www.kickscrew.com/products/pop-mart-the-monsters-labubu-time-to-chill-1220719025 [^1_4] https://www.popculturedepot.com/products/labubu-time-to-chill-vinyl-plush-doll [^1_6] https://www.springergarden.com/products/labubu-time-to-chill-vinyl-plush-doll [^1_5] https://bullseyesb.com/products/popmart-labubu-time-to-chill-vinyl-plush-doll deltas: all pricing and release date information consistent across sources. no contradictions found with seed data. media assets: official product photography available showing doll in packaging and unboxed state. youtube promotional video from pop mart official channel dated november 10, 2022[^1_13]": "Jump for Joy — 2023-05-25; CNY 499 (plush)",
  "identity \\& taxonomy: the monsters labubu \"jump for joy\" vinyl plush doll, second generation release featuring labubu with galaxy grey coat in jumping pose. part of core labubu plush series[^1_14][^1_15]. physical specification: size: approximately 15.75 inches in height. materials: plush+pvc construction. features similar construction to other large format labubu plush dolls with vinyl face and soft plush body[^1_16]. edition \\& release context: released as part of 2023 product line expansion. launch date confirmed as may 26, 2023 (correcting seed date of may 25)[^1_14][^1_17]. marketed with theme of joyful movement and playful energy. pricing \\& value: launch price: cny 499 as specified in seed data[^1_14]. secondary market pricing significantly elevated, with resale prices reaching over \\$2,400 usd for opened box variants[^1_16]. market availability: limited availability, quickly sold out from official channels. currently available primarily through secondary market and specialized collectible retailers at premium pricing[^1_16]. distribution channel: released through official pop mart channels including online store and physical retail locations. also distributed through authorized retailers and now available via secondary market platforms[^1_14][^1_18][^1_19]. packaging \\& presentation: standard pop mart packaging with product visibility window. includes authenticity verification materials and official documentation[^1_16]. colorways \\& variants: single variant featuring galaxy grey coat coloring, positioned as the signature look for this release series. the grey coloring was specifically highlighted in marketing materials as a key aesthetic element[^1_14][^1_15]. accessories \\& contents: includes original packaging and authentication materials. some secondary market listings note \"opened box\" variants for verification purposes[^1_16]. licensing \\& ip: part of the monsters ip created by kasing lung, exclusively produced by pop mart under official licensing agreements[^1_14]. manufacturing \\& materials: high-quality plush construction with attention to detail in both materials and finishing. collectors note good build quality consistent with other premium labubu releases[^1_16]. marketing \\& media: featured in official pop mart social media campaigns with emphasis on the \"jump for joy\" theme. promotional materials highlighted the playful, energetic positioning of the character[^1_14][^1_15]. community reception: well-received by collectors, considered an important release in the labubu timeline. praised for unique pose and attractive colorway. regular feature in collector showcases[^1_20][^1_21]. provenance urls: [^1_14] https://www.instagram.com/reel/csip88egs27/ [^1_15] https://www.instagram.com/reel/csip88egs27/?hl=en [^1_17] https://x.com/popmartglobal/status/1660655301593374728 [^1_16] https://toysez.com/products/labubu-the-monsters-jump-for-joy-vinyl-plush-doll-limited deltas: release date correction: seed listed may 25, 2023, but official sources confirm may 26, 2023 as the actual release date[^1_14][^1_17]. media assets: official social media promotional content available including instagram reels and x/twitter posts showing product details and marketing materials[^1_14][^1_15][^1_17]": "Dress be Latte — 2023-10-26; CNY 499 (plush)",
  "identity \\& taxonomy: the monsters labubu \"dress be latte\" vinyl plush doll, part of seasonal autumn/winter collection. features labubu in cozy latte-themed outfit with brown sweater and bucket hat design[^1_22][^1_23]. physical specification: size: approximately 15.75 inches (40cm) in height. materials: plush+pvc construction with detailed fabric accessories. features the standard labubu vinyl face with soft plush body construction[^1_24][^1_25]. edition \\& release context: released october 27, 2023 (correcting seed date of october 26)[^1_23][^1_26]. positioned as autumn/winter seasonal release with coffee/comfort theme. part of the monsters core series expansion focusing on lifestyle themes[^1_23]. pricing \\& value: launch price: cny 499 as specified in seed data[^1_22]. notable secondary market appreciation - actress yao chen mentioned purchasing for \"a few hundred yuan\" and later noting it as \"the only successful investment i've ever made\" due to significant value increase[^1_22]. currently sold out from official channels[^1_27][^1_28]. market availability: officially sold out. high demand led to rapid sell-out from retail channels. currently available only through secondary market at premium pricing, with some listings exceeding \\$1,800 usd[^1_24][^1_28]. distribution channel: originally released through pop mart official stores including海港城lcx店 and k11购物艺术中心 in hong kong, plus mainland china retail network[^1_29]. now available primarily through secondary market platforms[^1_25][^1_30]. packaging \\& presentation: standard pop mart windowed packaging with official authentication materials. features autumn/winter themed packaging design elements[^1_23][^1_31]. colorways \\& variants: single variant featuring brown color scheme with bucket hat and cozy scarf accessories, designed to evoke coffee/latte aesthetic and autumn comfort themes[^1_23][^1_31][^1_29]. accessories \\& contents: includes removable bucket hat and scarf accessories as key design elements. package includes original box and authentication materials[^1_24][^1_23]. licensing \\& ip: part of the monsters ip by kasing lung, exclusively produced by pop mart. represents continued expansion of lifestyle-themed labubu releases[^1_23]. manufacturing \\& materials: high-quality construction with detailed attention to accessories and fabric elements. materials designed to convey cozy, comfortable aesthetic matching the latte theme[^1_24][^1_23]. marketing \\& media: featured in official pop mart campaigns with emphasis on autumn/winter comfort themes. marketing highlighted the \"cozy hat and scarf\" elements and positioning as a \"warm cup of latte\" companion[^1_23][^1_31][^1_29]. community reception: extremely popular among collectors and gained broader cultural attention when actress yao chen publicly praised it as a successful investment. considered one of the standout 2023 releases[^1_22][^1_32]. provenance urls: [^1_22] https://sg.style.yahoo.com/yao-chen-her-labubu-only-031200479.html [^1_23] https://www.instagram.com/p/cy3hr8hln2e/ [^1_24] https://toysez.com/products/labubu-the-monsters-dress-be-latte-vinyl-plush-doll-limited [^1_26] https://x.com/popmartglobal/status/1715396274352980341 deltas: release date correction: seed data shows october 26, 2023, but official sources confirm october 27, 2023[^1_23][^1_26]. media assets: official promotional materials including instagram posts and social media campaigns showcasing the autumn/winter theme and cozy aesthetic[^1_23][^1_31][^1_29]": "Flip with Me — 2024-07-12; plush 40×20×15 cm; CN/US pricing exists",
  "identity \\& taxonomy: the monsters \"flip with me\" vinyl plush doll featuring labubu in dynamic mid-air flip pose. part of 2024 core series releases with emphasis on playful, energetic movement[^1_33][^1_34][^1_35]. physical specification: dimensions: 20×15×40 cm (7.87×5.91×15.75 inches) as specified in seed data[^1_33]. materials: shell composition of 40% cotton, 17% pvc, 16% polyester, 15% abs, 12% tpr. stuffing: 90% polyester, 10% pe particles[^1_33]. features whimsical mid-air flip sculpting with rounded silhouette. edition \\& release context: released july 12, 2024, simultaneously with \"fall in wild\" series[^1_34][^1_36][^1_35]. positioned as energetic, playful release celebrating movement and joy. part of broader 2024 product line expansion[^1_37][^1_38]. pricing \\& value: us pricing: \\$84.99 for plush doll[^1_34][^1_36]. materials and construction suggest premium positioning within labubu product range. secondary market activity indicates strong collector interest[^1_33]. market availability: released through official pop mart channels with global availability. has experienced periodic stock shortages due to high demand. available through official online store and select retail partners[^1_34][^1_39][^1_40]. distribution channel: official pop mart stores and website (popmart.com), plus authorized international retailers. also available through specialty toy and collectible retailers[^1_34][^1_39][^1_40]. packaging \\& presentation: standard pop mart packaging with windowed display box. features dynamic artwork highlighting the \"flip\" theme and movement concept[^1_35][^1_38]. colorways \\& variants: single variant featuring dreamy pastel gradient coloring shifting from peach at cheeks through mint and sky-blue at limbs. includes velvety matte finish with glossy enamel highlights on eyes and ear tips[^1_33]. accessories \\& contents: features removable oversized hoodie with subtle shading details. includes embossed pop mart logo on sole for authenticity verification[^1_33]. licensing \\& ip: part of the monsters ip created by kasing lung, exclusively manufactured by pop mart under official licensing[^1_33]. manufacturing \\& materials: premium construction combining sturdy vinyl shell with soft plush core. advanced material composition designed for both display and tactile appeal[^1_33]. marketing \\& media: featured in official pop mart social media campaigns emphasizing the dynamic \"flip\" action and playful energy theme[^1_35][^1_38]. youtube unboxing content and promotional materials available[^1_37]. community reception: positive reception among collectors for unique dynamic pose and quality construction. popular choice for both display and as bag accessory due to balanced artistry and huggable appeal[^1_33][^1_41]. provenance urls: [^1_33] https://crepdogcrew.com/products/pop-mart-labubu-the-monsters-flip-with-me-vinyl-plush-doll [^1_34] https://www.popmart.com/us/products/1371/the-monsters-flip-with-me-vinyl-plush-doll [^1_35] https://www.instagram.com/p/c9i55uept-e/ [^1_37] https://www.youtube.com/watch?v=jlrjefnqoxa deltas: no contradictions found with seed data. dimensions and release date confirmed accurate across all sources. media assets: official promotional photography, social media content, and youtube unboxing videos showcasing the dynamic flip pose and gradient coloring[^1_37][^1_35][^1_38]": "Fall in Wild — 2024-07-12; plush 40×20×15 and keychain pendant 17 cm",
  "identity \\& taxonomy: the monsters \"fall in wild\" series featuring labubu in outdoor camping theme with cute camping outfit and floppy hat. available in both large plush doll and keychain pendant formats[^1_42][^1_43][^1_36]. physical specification: large plush: 40×20×15 cm as specified in seed data. keychain pendant: approximately 17cm height[^1_42][^1_43]. materials: polyester, cotton, pvc construction for pendant version[^1_42]. standard vinyl face with plush body construction. edition \\& release context: released july 12, 2024, simultaneously with \"flip with me\" series[^1_36][^1_44][^1_45]. theme focuses on outdoor adventures and camping lifestyle. part of 2024's nature and lifestyle themed releases[^1_46][^1_44]. pricing \\& value: us pricing: \\$84.99 for large plush doll, \\$30.99 for keychain pendant[^1_43]. uk pricing: £55 for pendant version[^1_43]. multiple format availability provides different price points for collectors[^1_36]. market availability: released through official pop mart channels with both formats available. noted as \"extremely limited stock\" at retail locations with warnings that stock \"will not last\"[^1_45]. currently available through official and secondary market channels[^1_36][^1_44]. distribution channel: official pop mart online store and retail locations. international availability through regional pop mart stores and authorized retailers[^1_36][^1_44][^1_45]. packaging \\& presentation: standard pop mart packaging for both formats. camping/outdoor theme reflected in packaging artwork and presentation materials[^1_45]. colorways \\& variants: single colorway featuring camping attire with floppy hat design. outdoor/adventure aesthetic with earth-tone coloring and camping accessories[^1_42][^1_46]. accessories \\& contents: features removable camping outfit and floppy hat as key design elements. pendant version includes keychain attachment hardware for bag charm use[^1_42][^1_43]. licensing \\& ip: part of the monsters ip by kasing lung, exclusively produced by pop mart under official licensing agreements[^1_36]. manufacturing \\& materials: quality construction appropriate for both display and functional use as bag accessories. materials selected for durability and tactile appeal[^1_42][^1_43]. marketing \\& media: promoted as part of outdoor/adventure lifestyle theme. marketing emphasized the camping aesthetic and dual format availability[^1_45]. featured in collector showcases and social media content[^1_47]. community reception: popular among collectors for unique camping theme and dual format options. praised for cute design execution and quality construction. regular feature in collection comparisons and discussions[^1_41]. provenance urls: [^1_42] https://www.fifilandtoys.com/products/labubu-the-monsters-fall-in-wild-vinyl-plush-pendant-keychain [^1_43] https://www.laced.com/products/pop-mart-labubu-the-monsters-fall-in-wild-vinyl-plush-doll-pendant-keychain [^1_36] https://www.popmart.com/us/products/1060/the-monsters-fall-in-wild-series-vinyl-plush-doll [^1_45] https://www.instagram.com/p/c9taud2zp6o/?hl=en deltas: no contradictions found with seed data. dimensions and release date confirmed accurate across sources. media assets: official promotional materials showcasing both plush doll and pendant formats, plus camping theme aesthetic[^1_47][^1_45]": "Let's Checkmate (Doll) — 2025-02-07; 37 cm; USD 114.99",
  "identity \\& taxonomy: the monsters \"let's checkmate\" series vinyl plush doll featuring labubu in chess-themed design with royal queen positioning. part of valentine's day 2025 themed release[^1_48][^1_49][^1_50]. physical specification: height: 37cm (14.57 inches) when standing, adjustable to 33cm when sitting due to movable leg construction[^1_48][^1_51]. materials: shell composition of 59% pvc, 41% polyester; stuffing 100% polyester[^1_51]. features brown fuzzy exterior with twinkling, movable blue eyes. edition \\& release context: released february 7, 2025, as valentine's day themed collection[^1_48][^1_50][^1_52]. chess theme with labubu positioned as \"queen of your heart\" with royal accessories and romantic elements[^1_48]. pricing \\& value: us pricing: \\$114.99 as specified in seed data[^1_48]. singapore pricing: sgd 109.90[^1_48]. premium pricing reflects larger size and detailed accessories including functional jewelry box[^1_50]. market availability: released through official pop mart channels. quick sell-out noted with current status showing \"out of stock\" on official websites[^1_49][^1_52][^1_53]. available through secondary market at premium pricing. distribution channel: official pop mart stores and online platforms. global release including us, singapore, and other international markets[^1_48][^1_49][^1_53]. packaging \\& presentation: large format packaging reflecting premium positioning. features chess-themed artwork and \"let's checkmate\" branding elements[^1_50][^1_54]. colorways \\& variants: single variant featuring brown fur with blue eyes, royal red and gold crown with heart details, and removable red cape with white fur trim[^1_48][^1_50]. accessories \\& contents: key feature: functional red labubu ring box that can hold actual jewelry for gift-giving purposes. removable crown and cape accessories. adjustable legs for sitting/standing display options[^1_48][^1_50]. licensing \\& ip: part of the monsters ip created by kasing lung, exclusively manufactured by pop mart[^1_48]. manufacturing \\& materials: premium construction with movable elements including adjustable legs and movable eyes. high attention to detail in accessory construction and attachment mechanisms[^1_48][^1_50]. marketing \\& media: marketed as valentine's day gift option with emphasis on romantic chess queen theme and functional jewelry box feature. promotional materials highlighted gift-giving potential[^1_48][^1_54]. community reception: positive reception for unique chess theme and functional jewelry box element. collectors appreciated the adjustable height feature and premium construction quality[^1_50][^1_55]. provenance urls: [^1_48] https://bagaholicboy.com/2025/02/the-monsters-lets-checkmate-collection [^1_51] https://poshmark.com/listing/labubu-the-monsters-lets-checkmate-seriesvinyl-plush-hanging-card-new-in-box-683a1fb732518768f005d2f8 [^1_50] https://www.youtube.com/watch?v=xav0z9b40lo [^1_52] https://m.popmart.com/us/products/1898/the-monsters-let-s-checkmate-series-vinyl-plush-doll deltas: no contradictions found with seed data. price and dimensions confirmed accurate across all sources. media assets: official promotional materials, unboxing videos, and product photography showcasing chess theme and functional jewelry box feature[^1_50][^1_54][^1_56]": "Let's Checkmate (Hanging Card) — 2025-02-07; 17 cm; USD 39.99",
  "identity \\& taxonomy: the monsters \"let's checkmate\" series vinyl plush hanging card featuring labubu in chess-themed pendant format. companion piece to larger doll in same collection[^1_48][^1_49][^1_53]. physical specification: height: 17cm (6.69 inches) as specified in seed data[^1_48][^1_51]. materials: shell 59% pvc, 41% polyester; stuffing 100% polyester[^1_51]. features yellow fur variant with pink crown and heart accessory. edition \\& release context: released february 7, 2025, as part of valentine's day chess-themed collection. designed as more accessible price point option within the \"let's checkmate\" series[^1_48][^1_53]. pricing \\& value: us pricing: \\$39.99 as specified in seed data[^1_48]. singapore pricing: sgd 37.90[^1_48]. positioned as entry-level option for the chess-themed collection[^1_50]. market availability: released through official pop mart channels. experienced rapid sell-out with current \"out of stock\" status on official platforms[^1_49][^1_53]. secondary market availability at premium pricing[^1_51]. distribution channel: official pop mart online store and retail locations. global availability through international pop mart network[^1_49][^1_53][^1_57]. packaging \\& presentation: standard hanging card packaging with chess theme artwork. features \"let's checkmate\" branding consistent with collection identity[^1_53][^1_56]. colorways \\& variants: single variant featuring yellow fur, heart-detailed pink crown, and pink plush heart accessory. light blue chiffon-like ribbon wrapping for gift-ready presentation[^1_48][^1_50]. accessories \\& contents: key accessories include removable pink crown with heart details, pink plush heart that labubu holds, and light blue ribbon wrapping. yellow ring clasp for bag charm functionality[^1_48][^1_50]. licensing \\& ip: part of the monsters intellectual property created by kasing lung, exclusively produced by pop mart[^1_48]. manufacturing \\& materials: quality pendant construction with attention to small-scale accessory details. materials chosen for durability in bag charm usage[^1_51][^1_50]. marketing \\& media: marketed alongside larger doll as complete chess-themed collection. emphasized portability and bag charm functionality for everyday wear[^1_48][^1_57]. community reception: popular as more accessible entry point to the chess collection. praised for cute design execution and practical bag charm size. some collectors noted potential difficulty in removing accessories without damage[^1_50][^1_55]. provenance urls: [^1_48] https://bagaholicboy.com/2025/02/the-monsters-lets-checkmate-collection [^1_51] https://poshmark.com/listing/labubu-the-monsters-lets-checkmate-seriesvinyl-plush-hanging-card-new-in-box-683a1fb732518768f005d2f8 [^1_53] https://m.popmart.com/us/products/1897/the-monsters-let-s-checkmate-series-vinyl-plush-hanging-card [^1_50] https://www.youtube.com/watch?v=xav0z9b40lo deltas: no contradictions found with seed data. pricing and dimensions confirmed accurate across sources. media assets: product photography and promotional materials showing chess theme design and pendant functionality[^1_50][^1_56][^1_57]. opportunistic updates — cross-seed facts applied": "Walk by Fortune (CNY)",
  "→ chinese new year 2023 limited edition confirmed as limited to 3,000 pieces with cny 499 pricing. release date confirmed as december 29, 2023 (correcting seed date of december 28). theme focused on traditional chinese new year fortune and prosperity elements[^1_58]": "Best of Luck（海外限定）",
  "→ confirmed as overseas exclusive variant of chinese new year series with identical cny 499 pricing and 3,000 piece limitation. release date december 30, 2023. specifically designed for international markets outside mainland china[^1_58]": "PRONOUNCE — Be Fancy Now",
  "→ confirmed march 15, 2024 release date (correcting seed date of march 14). limited to 6,458 pieces with cny 599 pricing. featured purple fur labubu with pronounce's signature \"infinity rope\" motif, marking fashion brand collaboration debut[^1_59][^1_60][^1_61]": "PRONOUNCE — Wings of Fantasy/Wings of Fortune",
  "→ released october 4, 2024. wings of fantasy (plush doll): \\$119.99 usd, limited to 10,000 pieces. wings of fortune (hanging card): \\$43.99 usd. features purple fur with fashion accessories including removable denim mao suit and sunglasses for large version, golden dress and gourd húlu bag for pendant version[^1_59][^1_62][^1_63]": "Happy Halloween Party",
  "→ confirmed october 25, 2024 release date, featuring \"sitting pumpkin\" variant. australian pricing au\\$50 for keychain pendant (15cm height not including hanging loop). materials: 52% pvc, 48% polyester shell with 100% polyester stuffing[^1_64][^1_65][^1_66]": "Exciting Macaron (v1)",
  "→ confirmed october 27, 2024 release (correcting seed date of october 27, 2024 to accurate). set pricing: \\$131.94 usd for complete set, \\$21.99 usd per individual box. features six regular designs (soymilk, lychee berry, green grape, sea salt coconut, toffee, sesame bean) plus one secret design (chestnut cocoa). established as labubu's first keychain pendant blind box series[^1_67][^1_68][^1_69][^1_70]. updated current queue pronounce — wings of fantasy (plush) / wings of fortune (hanging card) — 2024-10-04; usd 119.99 / usd 43.99 coca-cola — 2025-01-24; 15.5×17 cm; set usd 239.94 / box usd 39.99 (blind box) exciting macaron (v1) — 2024-10-27; set usd 131.94 / box usd 21.99 have a seat — 2024-07-12; 8×7×15 cm; set usd 131.94 / box usd 21.99 big into energy (v3) — 2025-04-25; 17 cm; set usd 167.94 / box usd 27.99 i found you (v1) — 2023-12-15; 30×25×58 cm; usd 179.99 angel in clouds (v2) — 2024-10-25; 33×25×58 cm; usd 289.99 close to sweet (v1) — 2023-09-xx; plush vs pendant (split by form) fall into spring — 2024-03-08; cny 599 (plush) / cny 159 (pendant) blue diamond — 2024-06-18; cny 159 (pendant) magic of pumpkin (halloween) — 2024-10-27; cny 159 (pendant) twinkly fairy tale — 2024-11-28; cny 159 (pendant) hide and seek in singapore — s\\$37.90; 10×10×17.5 cm; reg-sg expected good lucky to you (thailand) — thb 1,050; 2024-12-20; reg-th expected forest fairy tale (china) — 2025-05-26; member points; reg-cn expected wacky mart (china) — 2025-06-12; cny 199; reg-cn expected query log (abridged)": "Time to Chill",
  "pop mart the monsters time to chill 2022\" \"time to chill the monsters figurine usd 69.99\" \"泡泡玛特 the monsters time to chill 2022年\" \"pop mart labubu time to chill dimensions size specifications\" \"time to chill vinyl plush doll material pp polyester cotton\" \"labubu time to chill 高 14.5 inches 37cm": "Jump for Joy",
  "pop mart jump for joy labubu cny 499 may 2023\" \"jump for joy labubu plush cny 499 泡泡玛特\" \"labubu jump for joy 欢乐跃动 2023年5月": "Dress be Latte",
  "labubu dress be latte october 2023 cny 499\" \"dress be latte labubu plush doll 衣服拿铁\" \"泡泡玛特 labubu dress be latte 2023年10月": "Flip with Me",
  "pop mart flip with me july 2024 40x20x15 cm plush\" \"labubu fall in wild july 2024 plush keychain 40x20x15\" \"flip with me fall in wild labubu 2024年7月": "Let's Checkmate (both versions)"
}